{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CREATE CONSTRAINT ON (n:actionGraph) ASSERT n.id IS UNIQUE\n",
      "OPTIONAL MATCH (same_id_node:actionGraph) \n",
      "WHERE same_id_node.id = 'a' \n",
      "FOREACH(new_count \n",
      "\tIN CASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN [coalesce(same_id_node.count, 0) + 1]\n",
      "\tELSE [] END | \n",
      "\t\tSET same_id_node.count = new_count) \n",
      "WITH same_id_node \n",
      "UNWIND\n",
      "\tCASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN ['a' + same_id_node.count]\n",
      "\tELSE ['a'] END AS new_id_a \n",
      "\t\tCREATE (a:actionGraph { id : new_id_a }) \n",
      "SET a.name=['Jack']\n",
      "SET a.age=[43]\n",
      "SET a.hobby=['hiking', 'music']\n",
      "WITH a, new_id_a OPTIONAL MATCH (same_id_node:actionGraph) \n",
      "WHERE same_id_node.id = 'b' \n",
      "FOREACH(new_count \n",
      "\tIN CASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN [coalesce(same_id_node.count, 0) + 1]\n",
      "\tELSE [] END | \n",
      "\t\tSET same_id_node.count = new_count) \n",
      "WITH same_id_node \n",
      "UNWIND\n",
      "\tCASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN ['b' + same_id_node.count]\n",
      "\tELSE ['b'] END AS new_id_b \n",
      "\t\tCREATE (b:actionGraph { id : new_id_b }) \n",
      "SET b.name=['Robert']\n",
      "SET b.age=[35]\n",
      "SET b.hobby=['music', 'sport']\n",
      "WITH b, new_id_b OPTIONAL MATCH (same_id_node:actionGraph) \n",
      "WHERE same_id_node.id = 'c' \n",
      "FOREACH(new_count \n",
      "\tIN CASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN [coalesce(same_id_node.count, 0) + 1]\n",
      "\tELSE [] END | \n",
      "\t\tSET same_id_node.count = new_count) \n",
      "WITH same_id_node \n",
      "UNWIND\n",
      "\tCASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN ['c' + same_id_node.count]\n",
      "\tELSE ['c'] END AS new_id_c \n",
      "\t\tCREATE (c:actionGraph { id : new_id_c }) \n",
      "SET c.name=['Paul']\n",
      "SET c.age=[18]\n",
      "WITH c, new_id_c OPTIONAL MATCH (same_id_node:actionGraph) \n",
      "WHERE same_id_node.id = 'd' \n",
      "FOREACH(new_count \n",
      "\tIN CASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN [coalesce(same_id_node.count, 0) + 1]\n",
      "\tELSE [] END | \n",
      "\t\tSET same_id_node.count = new_count) \n",
      "WITH same_id_node \n",
      "UNWIND\n",
      "\tCASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN ['d' + same_id_node.count]\n",
      "\tELSE ['d'] END AS new_id_d \n",
      "\t\tCREATE (d:actionGraph { id : new_id_d }) \n",
      "SET d.name=['Joe']\n",
      "SET d.age=[12]\n",
      "WITH d, new_id_d OPTIONAL MATCH (same_id_node:actionGraph) \n",
      "WHERE same_id_node.id = 'e' \n",
      "FOREACH(new_count \n",
      "\tIN CASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN [coalesce(same_id_node.count, 0) + 1]\n",
      "\tELSE [] END | \n",
      "\t\tSET same_id_node.count = new_count) \n",
      "WITH same_id_node \n",
      "UNWIND\n",
      "\tCASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN ['e' + same_id_node.count]\n",
      "\tELSE ['e'] END AS new_id_e \n",
      "\t\tCREATE (e:actionGraph { id : new_id_e }) \n",
      "SET e.name=['Paul']\n",
      "SET e.age=[18]\n",
      "WITH e, new_id_e RETURN e, new_id_e\n",
      "\n",
      "MATCH (a:actionGraph { id : 'a'}) , (d:actionGraph { id : 'd'}) , (b:actionGraph { id : 'b'}) , (e:actionGraph { id : 'e'}) , (c:actionGraph { id : 'c'})  MERGE (a)-[a_b:edge]->(b)\n",
      "SET a_b.type=['friends']\n",
      "MERGE (a)-[a_c:edge]->(c)\n",
      "SET a_c.type=['colleagues']\n",
      "MERGE (b)-[b_c:edge]->(c)\n",
      "SET b_c.type=['colleagues']\n",
      "MERGE (d)-[d_a:edge]->(a)\n",
      "SET d_a.type=['child_of']\n",
      "MERGE (d)-[d_e:edge]->(e)\n",
      "SET d_e.type=['enemies']\n",
      "MERGE (e)-[e_e:edge]->(e)\n",
      "SET e_e.type=['likes']\n",
      "\n",
      "CREATE CONSTRAINT ON (n:metaModel) ASSERT n.id IS UNIQUE\n",
      "OPTIONAL MATCH (same_id_node:metaModel) \n",
      "WHERE same_id_node.id = 'a' \n",
      "FOREACH(new_count \n",
      "\tIN CASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN [coalesce(same_id_node.count, 0) + 1]\n",
      "\tELSE [] END | \n",
      "\t\tSET same_id_node.count = new_count) \n",
      "WITH same_id_node \n",
      "UNWIND\n",
      "\tCASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN ['a' + same_id_node.count]\n",
      "\tELSE ['a'] END AS new_id_a \n",
      "\t\tCREATE (a:metaModel { id : new_id_a }) \n",
      "SET a.type=['Adult']\n",
      "SET a.age=[43, 18, 35]\n",
      "SET a.name=['Robert', 'Jack', 'Paul']\n",
      "SET a.hobby=['hiking', 'music', 'sport']\n",
      "WITH a, new_id_a OPTIONAL MATCH (same_id_node:metaModel) \n",
      "WHERE same_id_node.id = 'b' \n",
      "FOREACH(new_count \n",
      "\tIN CASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN [coalesce(same_id_node.count, 0) + 1]\n",
      "\tELSE [] END | \n",
      "\t\tSET same_id_node.count = new_count) \n",
      "WITH same_id_node \n",
      "UNWIND\n",
      "\tCASE WHEN same_id_node IS NOT NULL\n",
      "\tTHEN ['b' + same_id_node.count]\n",
      "\tELSE ['b'] END AS new_id_b \n",
      "\t\tCREATE (b:metaModel { id : new_id_b }) \n",
      "SET b.type=['Child']\n",
      "SET b.age=[18, 12]\n",
      "SET b.name=['Joe', 'Paul']\n",
      "WITH b, new_id_b RETURN b, new_id_b\n",
      "\n",
      "MATCH (a:metaModel { id : 'a'}) , (b:metaModel { id : 'b'})  MERGE (a)-[a_a:edge]->(a)\n",
      "SET a_a.type=['colleagues', 'friends']\n",
      "MERGE (b)-[b_a:edge]->(a)\n",
      "SET b_a.type=['child_of']\n",
      "MERGE (b)-[b_b:edge]->(b)\n",
      "SET b_b.type=['enemies', 'friends']\n",
      "\n",
      "CREATE CONSTRAINT ON (n:actionGraph) ASSERT n.id IS UNIQUE\n",
      "CREATE CONSTRAINT ON (n:metaModel) ASSERT n.id IS UNIQUE\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<neo4j.BoltStatementResult at 0x7fe9e28445c0>"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "from regraph import Rule, plot_rule\n",
    "\n",
    "\n",
    "from regraph.neo4j.hierarchy import Neo4jHierarchy\n",
    "import regraph.neo4j.cypher_utils as cypher\n",
    "\n",
    "\n",
    "# initialize the neo4j driver, wrappped into Neo4jHierarchy object\n",
    "h = Neo4jHierarchy(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"admin\")\n",
    "h._clear()\n",
    "\n",
    "nodes = [\n",
    "    (\"a\", {\"name\": {\"Jack\"}, \"age\": {43}, \"hobby\": {\"hiking\", \"music\"}}), \n",
    "    (\"b\", {\"name\": {\"Robert\"}, \"age\": {35}, \"hobby\": {\"sport\", \"music\"}}),\n",
    "    (\"c\", {\"name\":{ \"Paul\"}, \"age\": {18}}),\n",
    "    (\"d\", {\"name\": {\"Joe\"}, \"age\": {12}}),\n",
    "    (\"e\", {\"name\": {\"Paul\"}, \"age\": {18}})\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"b\", {\"type\": {\"friends\"}}), \n",
    "    (\"a\", \"c\", {\"type\": {\"colleagues\"}}),\n",
    "    (\"b\", \"c\", {\"type\": {\"colleagues\"}}),\n",
    "    (\"d\", \"a\", {\"type\": {\"child_of\"}}), \n",
    "    (\"d\", \"e\", {\"type\": {\"enemies\"}}),\n",
    "    (\"e\", \"e\", {\"type\": {\"likes\"}})\n",
    "]\n",
    "h.add_graph('actionGraph', nodes, edges)\n",
    "\n",
    "\n",
    "nodes = [\n",
    "    (\"a\", {\"type\": {\"Adult\"}, \"age\": {43, 35, 18}, \"name\": {\"Paul\", \"Jack\", \"Robert\"}, \"hobby\": {\"hiking\", \"music\", \"sport\"}}),\n",
    "    (\"b\", {\"type\": {\"Child\"}, \"age\": {12, 18}, \"name\": {\"Paul\", \"Joe\"}})\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"a\", {\"type\": {\"friends\", \"colleagues\"}}),\n",
    "    (\"b\", \"a\", {\"type\": {\"child_of\"}}),\n",
    "    (\"b\", \"b\", {\"type\": {\"friends\", \"enemies\"}})\n",
    "]\n",
    "h.add_graph('metaModel', nodes, edges)\n",
    "\n",
    "mapping = {\n",
    "    \"a\":\"a\",\n",
    "    \"b\":\"a\",\n",
    "    \"c\":\"a\",\n",
    "    \"d\":\"b\",\n",
    "    \"e\":\"b\"\n",
    "}\n",
    "h.add_typing('actionGraph', 'metaModel', mapping)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_node(\"child\", type=\"Child\")\n",
    "\n",
    "rule = Rule.from_transform(pattern)\n",
    "clone_name, _ = rule.inject_clone_node(\"child\", \"teenager\")\n",
    "rule.inject_remove_node_attrs(clone_name, {\"type\": \"Child\"})\n",
    "rule.inject_add_node_attrs(clone_name, {\"type\": \"Teenager\"})\n",
    "\n",
    "instance = {\n",
    "    \"child\": \"b\"\n",
    "}\n",
    "\n",
    "p_typing = {\n",
    "    \"actionGraph\": {\n",
    "        \"d\": \"child\",\n",
    "        \"e\": clone_name\n",
    "    }\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'teenager': {'type': {'Child'}}}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rule.removed_node_attrs()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CREATE CONSTRAINT ON (n:metaModel) ASSERT n.id IS UNIQUE\n",
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_child:metaModel { id : 'b'})  \n",
      "\n",
      "\n",
      "// Cloning node 'child' of the lhs \n",
      "// Create clone corresponding to 'teenager' of the preserved part\n",
      "// create a node corresponding to the clone\n",
      "CREATE (p_teenager:metaModel) \n",
      "WITH p_teenager, toString(id(p_teenager)) as p_teenager_id, lhs_child.id as original_old, lhs_child \n",
      "// set the id property of the original node to NULL\n",
      "SET lhs_child.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET p_teenager = lhs_child\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET p_teenager.id = toString(id(p_teenager)), p_teenager.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET lhs_child.id = original_old\n",
      "WITH p_teenager, toString(id(p_teenager)) as p_teenager_id, lhs_child \n",
      "WITH [] as sucIgnore, [] as predIgnore, lhs_child, p_teenager, p_teenager_id \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_child)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, sucIgnore, lhs_child, p_teenager_id, p_teenager, predIgnore \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(lhs_child) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, sucIgnore, lhs_child, p_teenager_id, suc_maps, p_teenager, predIgnore \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tCREATE (p_teenager)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tCREATE (pred)-[new_edge:edge]->(p_teenager) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = lhs_child THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tCREATE (p_teenager)-[new_edge:edge]->(p_teenager) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH sucIgnore, lhs_child, p_teenager_id, p_teenager, predIgnore\n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_child)-[out_edge:typing]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, sucIgnore, lhs_child, p_teenager_id, p_teenager, predIgnore \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:typing]->(lhs_child) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, sucIgnore, lhs_child, p_teenager_id, suc_maps, p_teenager, predIgnore \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tCREATE (p_teenager)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tCREATE (pred)-[new_edge:typing]->(p_teenager) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = lhs_child THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tCREATE (p_teenager)-[new_edge:typing]->(p_teenager) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH sucIgnore, lhs_child, p_teenager_id, p_teenager, predIgnore\n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_child)-[out_edge:related]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, sucIgnore, lhs_child, p_teenager_id, p_teenager, predIgnore \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:related]->(lhs_child) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, sucIgnore, lhs_child, p_teenager_id, suc_maps, p_teenager, predIgnore \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tCREATE (p_teenager)-[new_edge:related]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tCREATE (pred)-[new_edge:related]->(p_teenager) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = lhs_child THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tCREATE (p_teenager)-[new_edge:related]->(p_teenager) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH sucIgnore, lhs_child, p_teenager_id, p_teenager, predIgnore\n",
      "WITH lhs_child, p_teenager_id, p_teenager \n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH p_teenager_id, p_teenager , lhs_child as p_child \n",
      "\n",
      "// Removing properties from node 'teenager' of P \n",
      "FOREACH(dummy IN CASE WHEN 'type' IN keys(p_teenager) THEN [1] ELSE [] END |\n",
      "\tSET p_teenager.type = filter(v in p_teenager.type WHERE NOT v IN ['Child'])\n",
      "\tFOREACH(dumy2 IN CASE WHEN size(p_teenager.type)=0 THEN [1] ELSE [] END |\n",
      "\t\tREMOVE p_teenager.type))\n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH p_teenager_id , p_child as rhs_child, p_teenager as rhs_teenager \n",
      "\n",
      "// Adding properties to the node 'teenager' from the rhs \n",
      "FOREACH (dummy IN CASE WHEN 'type' IN keys(rhs_teenager) THEN [] ELSE [1] END |\tSET rhs_teenager.type = ['Teenager'])\n",
      "FOREACH(dummy IN CASE WHEN 'type' IN keys(rhs_teenager) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Teenager'] |\n",
      "\t\tFOREACH(dummy1 IN CASE WHEN NOT val IN rhs_teenager.type THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_teenager.type = rhs_teenager.type + [val])))\n",
      "\n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_child, p_teenager_id, rhs_teenager\n",
      "\n",
      "OPTIONAL MATCH (h_i:actionGraph {id: 'd'})-[:typing*]->(g_i:metaModel)\n",
      "WHERE g_i.id <> 'b'\n",
      "MERGE (h_i)-[:_to_remove]->(g_i)\n",
      "\n",
      "OPTIONAL MATCH (h_i:actionGraph {id: 'e'})-[:typing*]->(g_i:metaModel)\n",
      "WHERE g_i.id <> '166438'\n",
      "MERGE (h_i)-[:_to_remove]->(g_i)\n",
      "\n",
      "OPTIONAL MATCH (p:metaModel)<-[:_to_remove]-(pred)-[t:typing]->(m:actionGraph)-[:_to_remove]->(o:metaModel)\n",
      "WHERE p.id <> o.id\n",
      "RETURN CASE WHEN p IS NULL OR o IS NULL \n",
      "\tTHEN true ELSE \n",
      "\t\tCASE WHEN t IS NULL \n",
      "\t\t\tTHEN true ELSE false END END as res\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "(<regraph.neo4j.hierarchy.Neo4jHierarchy at 0x7fea10c3db00>,\n",
       " {'child': 'b', 'teenager': '166438'})"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "h.rewrite(\"metaModel\", rule, instance, p_typing=p_typing)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
