{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "from regraph import Rule, plot_rule\n",
    "\n",
    "\n",
    "from regraph.neo4j.hierarchy import Neo4jHierarchy\n",
    "import regraph.neo4j.cypher_utils as cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f098a5ba860>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# initialize the neo4j driver, wrappped into Neo4jHierarchy object\n",
    "h = Neo4jHierarchy(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"admin\")\n",
    "h._clear()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add the default components to the KAMI hierarchy"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "nodes = [\"gene\", \"region\", \"state\", \"mod\", \"bnd\"]\n",
    "\n",
    "edges = [\n",
    "    (\"gene\", \"mod\"),\n",
    "    (\"gene\", \"bnd\"),\n",
    "    (\"region\", \"gene\"),\n",
    "    (\"region\", \"mod\"),\n",
    "    (\"region\", \"bnd\"),\n",
    "    (\"state\", \"gene\"),\n",
    "    (\"state\", \"region\"),\n",
    "    (\"mod\", \"state\")\n",
    "]\n",
    "h.add_graph('meta_model', nodes, edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// match all typing pairs between 'action_graph' and 'meta_model'\n",
      "MATCH (s:action_graph), (t:meta_model)\n",
      "WITH s, t\n",
      "// match all the predecessors of 's' and successors of 't'\n",
      "MATCH (pred), (suc)\n",
      "WHERE (pred)-[:typing*0..]->(s)\n",
      "\tAND (t)-[:typing*0..]->(suc)\n",
      "WITH s, t, collect(DISTINCT pred) as pred_list, collect(DISTINCT suc) as suc_list\n",
      "// select all the pairs 'pred' 'suc' with a path between\n",
      "UNWIND pred_list as pred\n",
      "UNWIND suc_list as suc\n",
      "OPTIONAL MATCH (pred)-[r:typing*]->(suc)\n",
      "WHERE NONE(rel in r WHERE rel.tmp = 'True')\n",
      "WITH s, t, r, labels(pred)[1] as pred_label, labels(suc)[1] as suc_label\n",
      "WHERE r IS NOT NULL\n",
      "WITH DISTINCT s, t, pred_label, suc_label\n",
      "// return the pairs 's' 't' where there should be a typing edge\n",
      "OPTIONAL MATCH (s)-[new_typing:typing]->(t)\n",
      "WHERE new_typing.tmp IS NOT NULL\n",
      "WITH pred_label, suc_label, s.id as s_id, t.id as t_id, new_typing\n",
      "WHERE new_typing IS NULL\n",
      "RETURN pred_label, suc_label, s_id, t_id\n",
      "\n"
     ]
    }
   ],
   "source": [
    "h.add_graph('action_graph', [], [])\n",
    "h.add_typing(\"action_graph\", \"meta_model\", {})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Aggregation use-case / (controlled) down-propagation"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1) Add two empty nuggets typed by the action graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// match all typing pairs between 'nugget_1' and 'action_graph'\n",
      "MATCH (s:nugget_1), (t:action_graph)\n",
      "WITH s, t\n",
      "// match all the predecessors of 's' and successors of 't'\n",
      "MATCH (pred), (suc)\n",
      "WHERE (pred)-[:typing*0..]->(s)\n",
      "\tAND (t)-[:typing*0..]->(suc)\n",
      "WITH s, t, collect(DISTINCT pred) as pred_list, collect(DISTINCT suc) as suc_list\n",
      "// select all the pairs 'pred' 'suc' with a path between\n",
      "UNWIND pred_list as pred\n",
      "UNWIND suc_list as suc\n",
      "OPTIONAL MATCH (pred)-[r:typing*]->(suc)\n",
      "WHERE NONE(rel in r WHERE rel.tmp = 'True')\n",
      "WITH s, t, r, labels(pred)[1] as pred_label, labels(suc)[1] as suc_label\n",
      "WHERE r IS NOT NULL\n",
      "WITH DISTINCT s, t, pred_label, suc_label\n",
      "// return the pairs 's' 't' where there should be a typing edge\n",
      "OPTIONAL MATCH (s)-[new_typing:typing]->(t)\n",
      "WHERE new_typing.tmp IS NOT NULL\n",
      "WITH pred_label, suc_label, s.id as s_id, t.id as t_id, new_typing\n",
      "WHERE new_typing IS NULL\n",
      "RETURN pred_label, suc_label, s_id, t_id\n",
      "\n",
      "// match all typing pairs between 'nugget_2' and 'action_graph'\n",
      "MATCH (s:nugget_2), (t:action_graph)\n",
      "WITH s, t\n",
      "// match all the predecessors of 's' and successors of 't'\n",
      "MATCH (pred), (suc)\n",
      "WHERE (pred)-[:typing*0..]->(s)\n",
      "\tAND (t)-[:typing*0..]->(suc)\n",
      "WITH s, t, collect(DISTINCT pred) as pred_list, collect(DISTINCT suc) as suc_list\n",
      "// select all the pairs 'pred' 'suc' with a path between\n",
      "UNWIND pred_list as pred\n",
      "UNWIND suc_list as suc\n",
      "OPTIONAL MATCH (pred)-[r:typing*]->(suc)\n",
      "WHERE NONE(rel in r WHERE rel.tmp = 'True')\n",
      "WITH s, t, r, labels(pred)[1] as pred_label, labels(suc)[1] as suc_label\n",
      "WHERE r IS NOT NULL\n",
      "WITH DISTINCT s, t, pred_label, suc_label\n",
      "// return the pairs 's' 't' where there should be a typing edge\n",
      "OPTIONAL MATCH (s)-[new_typing:typing]->(t)\n",
      "WHERE new_typing.tmp IS NOT NULL\n",
      "WITH pred_label, suc_label, s.id as s_id, t.id as t_id, new_typing\n",
      "WHERE new_typing IS NULL\n",
      "RETURN pred_label, suc_label, s_id, t_id\n",
      "\n"
     ]
    }
   ],
   "source": [
    "h.add_graph(\"nugget_1\", [], [])\n",
    "h.add_typing(\"nugget_1\", \"action_graph\", {})\n",
    "h.add_graph(\"nugget_2\", [], [])\n",
    "h.add_typing(\"nugget_2\", \"action_graph\", {})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1) Generation rule for nugget 1 (none of the nodes are typed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAIABJREFUeJzt3Xl8ldW97/HvSnYmyLAhAzNJgAyF\nEBJMNEDFAEEEbETFFhVbuB7p0Vrbe8WjtQ4c0XOK9fS2dag9x4EWrbUXxYKKKCIKImKEMAoNkACC\nCZkImZOd/dw/kF3DmGDy7J3web9eecHez/RbvHg9r+ebtdazjGVZAgAAAAA7+Xm7AAAAAAAXH4II\nAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDtCCLdiDGmyBiTc8p32caY\nL8+w71pjzL984/P9xphCY0yNMeZLY8yrdtQMoGv6+n5T//U9o8QYs9gYE+rtugD4llPuFcXfvFd8\n/fdHT9k/zhhjGWMcX38eaIx5zRhTZoypMsbsMMbM8UJT0AkIIpAx5keSbpGUY1lWqKQMSe97tyoA\nXcD3vr5njNaJ+8YDXq4HgG86ea9Ik5Qu6RftOHaJpEOSYiVF6sTzSkmHVwivcHi7APiETEmrLMva\nJ0mWZRVL+m/vlgSgq7As67AxZqWkFG/XAsB3WZZVbIxZpROBpK0yJf1vy7Jqv/68peMrg7fQIwJJ\n2ijph8aYe4wxGcYYf28XBKDrMMYMkjRNPCAAOAdjzEBJUyXtbcdhGyU9bYyZZYwZ3DmVwVsIIheH\n/saYY9/8kfTdkxsty3pJ0k8lTZH0oaSjxph7vVQrgK7jja/vJ+t14t7xH16uB4BvesMYU60TQ6yO\nSnr4G9vmn/J8su2UY2+QtE7Sg5IKjTH5xphMW6pGpyOIXByOWJbl/OaPTjw4eFiW9bJlWTmSnJL+\nVdJCY8wUbxQLoMuY8fU9JdayrDssy6r3dkEAfNIMy7LCJGVLSpYU9Y1tT5zyfJL6zQMty6q0LOs+\ny7JGSOojKV8ngo2xqXZ0IoIIWrEsq9myrP+nE7+RYLw3AADoEJZlfShpsaQnLvD4sq+P7S+pd8dV\nBm8hiHQ/AcaY4JM/asMLCYwxc4wx040xYcYYP2PMVEkjJH3a6dUCAICLyW8lTTbGjGrLzsaYRcaY\nFGOMwxgTJul2SXstyyrv1CphC96a1f28fcrnj9twzHFJ90t6SZK/pAOSbrcsa/05jwIAAGgHy7JK\njTF/lvSQpOo2HNJD0jJJ/STV68QvSXM7r0LYyViW5e0aAAAAAFxkGJoFAAAAwHYEEQAAAAC2I4gA\nAAAAsB1BBAAAAIDt2vXWrKioKCsuLq6TSgHQXp9//nmZZVnR3q6jvbiXAL6H+wmAjtLW+0m7gkhc\nXJzy8vIuvCoAHcoYc8DbNVwI7iWA7+F+AqCjtPV+wtAsAAAAALYjiAAAAACwHUEEAAAAgO0IIgAA\nAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQAAACA7Qgi\nAAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDt\nCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAA\ngO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQA\nAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAAwHYEEQAAALSLMUY1NTWdfp0F\nCxZo/vz5nXqNOXPm6KmnnjrvfosXL9Y//vEPz+fly5frnnvu6czSuj2HtwsAAAAAOovL5ZLD8e0f\neRcvXqyoqCglJiZKknJzc5Wbm/utz3sxo0cEAAAApzHG6OGHH1ZaWpqSkpL02muvtdr++9//XpmZ\nmRoyZEirbe+8847S09OVmpqqSZMmae/evZKkPXv2aMyYMRo1apRSUlL0xBNPSDrR6/H9739fEydO\nVHJysq6//npVVVV5znf48GFNmzZNycnJmj59uurq6iRJNTU1mjt3rlJSUpSSkqLHH3/cc0x2drZ+\n/vOfKysrS7m5ufrJT36iX//6157tW7ZsUVJSkizLatWm999/X2PGjFF6erpGjhypv/71r5KkF198\nUXl5ebrrrruUlpam1atXa/HixZo5c6bn2EWLFnlqmTt3rqfHaMGCBbrxxhvP2IaLHUEEAAAAZ+Tv\n76/8/HwtX75c8+bN09GjRz3bwsPD9dlnn2nJkiW66667JElHjx7VLbfcopdfflnbtm3TTTfdpJtv\nvlmS9Mwzzyg3N1dbt27Vjh07dOutt3rOtW7dOr3yyivavXu3IiIitHDhQs+2vLw8/eUvf9EXX3yh\n5uZmvfzyy5KkhQsXyu12a/v27dqwYYP+9Kc/aeXKlZ7j9u/fr/Xr1+vtt9/WnXfeqT/+8Y+e4PHU\nU0/pjjvukDGmVXtHjx6t9evXa8uWLVq9erXmz5+vyspKzZ07VxkZGfr973+v/Px85eTktDpu5cqV\nWrJkiTZs2KDt27erpaWlTW242BFEAAAAcEYnw0JSUpJGjx6tjRs3erbNmjVLkpSVlaUjR46ooaFB\nn376qUaNGqXhw4dLkubOnav8/HxVV1dr/Pjxeu655/Tggw9qzZo1cjqdnnNdffXV6tOnj+eaa9as\n8WybMmWKnE6njDG67LLLtG/fPknS6tWrddttt8kYo/DwcN14441avXq157ibbrrJMyTrO9/5joYM\nGaJ33nlHlZWVWr58uebMmXNae0tLSzVz5kylpKRoypQpqqio0J49e87777R69WrNmjVL4eHhMsZo\n3rx5rWo5WxsudgQRAAAAtFtwcLCkE70m0om5GOdy/fXXa926dRo6dKh+9atf6ZZbbmnXdU5e63zX\nOSk0NLTV57vuukvPPPOMXnjhBV133XWKiIg47Zjbb79d2dnZ2r59u/Lz8zVw4EA1NDS06XrncqFt\n6O4IIgAAADijF198UZJUUFCgLVu2KCsr65z7Z2VlaevWrdq9e7ck6U9/+pPS09MVFhamvXv3qm/f\nvpozZ44efvhhbdq0yXPcW2+9pdLSUs81J06ceN7acnJy9Pzzz8uyLFVXV+uvf/2rJk+efNb9p02b\npj179ug3v/mNfvKTn5xxn2PHjikuLk7GGL333nue+S3SiaFo35y7cmotr776qqqrq2VZlp577rlz\n1oITeGsWAAAAzsjlcik9PV11dXX64x//qJiYmHPuHx0drSVLluimm26Sy+VSdHS0XnrpJUnS3/72\nN7388ssKDAyUMUa/+93vPMddfvnlmjVrlg4fPqzhw4frv/7rv85b24MPPqg777xTI0eOlCTdcsst\nuuqqq866v5+fn370ox9p5cqVSk1NPeM+v/rVr3THHXfo4YcfVmZmZqv95s2bp7vvvlu//vWvPRPt\nT5o6daq2bdumMWPGSJIyMjL0wAMPnLcNFztz6tsCziUjI8PKy8vrxHIAtIcx5nPLsjK8XUd7cS8B\nfA/3E5zKGKPq6urThjh1tAULFqimpua0h/vOMHnyZM2bN0833HBDp1/rYtbW+wlDswAAANCt5eXl\naejQoYqIiND111/v7XLwNYZmAQAA4DTtGTXzbSxYsKDTr5GRkcGbqnwQPSIAAAAXuQULFmj+/Pne\nLgMXGYIIAAAAANsRRAAAALoQY4wee+wxZWZmasiQIXr//ff1i1/8Qunp6UpJSdEXX3zh2XfRokVK\nSUlRSkqK5s6dq5qaGklSVVWVZs6cqeTkZGVnZzNsCV5BEAEAAOhinE6nPvvsMy1atEjXXHONxo0b\npy1btuiHP/yhHnvsMUnSypUrtWTJEm3YsEHbt29XS0uLFi5cKEl65JFHFB4ert27d2vp0qX68MMP\nvdkcXKSYrA4AANDF/OAHP5AkjR49WsYYXX311ZKkSy65RK+//rokafXq1Zo1a5bCw8MlnVgH42c/\n+5kk6YMPPtCTTz4pSYqKitJ1111ndxO+NcuytKn0kF7c85l2VpbIT0bpUf01JylTaZH9vV0e2oAg\nAgAA0MUEBwdLkvz9/RUUFOT53t/fXy6Xy1tl2abZ3aL/88kKbSw5qPqWZs/37x/eq/XFRZo2KFkL\nMq6UnzFerBLnw9AsAACAbignJ0evvvqqqqurZVmWnnvuOU2ePFmSNHHiRL344ouSpPLyci1btsyb\npbbbo5vf1yclB1qFEEmyJDW0uLTy0G49vXODd4pDmxFEAAAAuqGpU6dq9uzZGjNmjEaOHClJeuCB\nByRJDz74oCorK5WcnKzrr79e48eP92ap7VLeUKcVB3apoeXsPT/1LS79+R+fq97VfNZ94H0MzQIA\nAOhCvrnQYFxcnMrKyjyfs7OzlZeX5/l877336t577z3tHBEREXrttdc6t9AO1tLSosrKSv1592ey\n3O7z7u9npLVf7dPUQck2VIcLQRABAACAT2lqalJ5ebnKy8tVVlam8vJyVVZWyu12Kz+4Qc0h51/1\nvcntVml9rQ3V4kIRRAAAAOB1brdba9asUVlZmY4fP+75vqmpSTU1NZ6fspggaWiU5HfuGQYO46ee\nAYGdXTa+BYIIAAAAvM4Yo6KiIpWUlKimpka1tbWqqamRZVkKDQ1Vz549FRUVJWd4Tx02brWc53wt\nllvZ/YbaUjsuDEEEAAAAtnK73aqsrPQMuzr55969e1VfX6/Q0FD17dtXoaGhnlcVS1JoaKiioqK0\nvfGg9jUcl0tnHqLlb0mXOfspMriHXU3CBSCIAAAAoNM0NzefNt/j2LFjnlARFRWl2NhYRUZGaseO\nHdq8ebOMMXI6nYqMjFRUVJQiIyMVGRnpCSWZjXW68f2/6Gh9jZrcrftGgvwcGhgSpsyvGpWfn6+0\ntDRvNBttQBABAABAh6ivr28VOMrKylRbW6tevXopMjJS0dHR+s53vqPevXvL4Tj9MTQpKUmDBw8+\n6/aTegX10NLJt+ilgs16qWCz6lzNsiQ5A4P1o8QMzRo2Si0NTVq1apUqKip0xRVXyN/fvxNbjgtB\nEAEAAOhGLFlqlqUmuWVJ8pcUJH/5q2NXGa+urm4VOMrKyuRyuTy9GIMGDVJ6erqcTqf8zjOx/KSw\nsDCFhYW1ad/QgCD96/AxmvedLB1rqpefjCICg2VOrqbeM0C5ublau3atVqxYoSuvvFI9ejBUy5cQ\nRAAAALoJl9yqUUurmRMuSY1yKUBGPeUv085A4na7dezYsdN6OhwOh2doVVJSksaNG9fmENGR/IxR\n76AzBwyHw6GcnBxt3rxZy5Yt05VXXqno6GibK8TZEEQAAAC6gRZZqj7Hu6SaZalGLQo9RxhxuVyq\nqKjw9HCcXL+jZ8+enp6OtLQ0RUZGKiQkpLOa0uFGjx6tXr16aeXKlRo3bpyGDuVtWr6AIAIAANAN\n1J/3hbaSS5ZaZMkho8bGxtOGVtXU1LSaJJ6YmKjIyEgFBATY0ILOFR8fr/DwcK1atUqVlZW65JJL\n/jmMC15BEAEAAOji3F/PCzkfy7JUVHxEmz74SI2NjZ7AMWDAAI0aNUq9evVq83yOrigyMlLXXnut\n3nvvPVVUVGjChAndImR1VQQRAACALs7dxv2MMXJG9tL06dMVHh5+UfYIhISEaPr06Vq/fr3+/ve/\n66qrrlJoaKi3y7oodd/ICwAA4CVxcXFKTk5WWlqa56eoqEjNzc1asGCBkpKSNGLECI0aNUozZ87U\nrl27JEmLFy+W0+lsddyePXsknQgRqampGjVqlFJTU7V8+XLP9c4WJx6cf6/S4hPV2wRq144dkqTA\nwEBFRERclCHkJH9/f11xxRVKSkrSG2+8oeLiYm+XdFGiRwQAAKATLF26VCkpKa2+mz17turq6vTp\np5/K6XTKsiy9/fbb2rNnj4YPHy5JysnJ0dKlS894zg0bNig0NFQrV67U97//fVVWVsrhcMhPJ8LI\nqYOzps/I1Y9/dqemXz7R810Av4f2GDlypJxOp959911deumlSk5O9nZJFxWCCAAAgA0KCgq0bNky\nffnll3I6nZJO9HJMnz693efKzs5WTU2NKisrFR0dLSOjIPmp4ZRBWlnfHXfasUEEkVYGDRqk3Nxc\nzyT2yy67rFvPk/El/CsDAAB0gpkzZ3qGV2VkZGjLli1KSEhQr169znnc6tWrPcdde+21Z9xn2bJl\nmjhxYqs1MYLlJ38ZuVvO/vasHvKTXwcvbNgdOJ1OzZgxQxUVFXrnnXfU1NTk2Wb3MLszKS8v17Rp\n05SUlKSRI0fquuuuU2lpaef9g9iEHhEAAIBOcOrQrL/97W+ttu/atUs33XST6urqNHXqVP3ud7+T\ndO6hWWPHjlV1dbWKi4u1Zs2aVtuMjMLkr/y9/9CA+Fi1tLTIz8/f81aoHvJXkPw7sondSlBQkKZO\nnaqNGzfqjTfe0JQpUxQRESHJ3mF2Z2KM0b/9278pOztbknTPPffovvvu0/PPP99BrfcOgggAAIAN\n0tPTVVBQoGPHjsnpdGr48OHKz8/XU089pby8vDad4+TD6xNPPKFZs2Zpz549Cg4O9mxvbGjUZx+u\n1+svvaJB8XHqP2CAJk+aJD8xN6Qt/Pz8NHbsWO3evVvLly/XhAkTzrhfZw6zO5PevXt7QogkZWVl\n6Q9/+EO7r+Vr+B8JAABgg4SEBF1zzTW67bbbVFVV5fm+tra23ee6++671adPHz377LOtvj/59qfy\n8nIdKytXU22dghysk9FeycnJysnJ0dq1a9Xc3Gz7MLtzcbvd+sMf/qDc3Nx2t8vXEEQAAAA6wTcf\nXtPS0pSXl6fFixcrOTlZmZmZGjFihL773e/q888/11133dWucxtj9MQTT+jxxx9XfX295/vi4mK5\n3W7V1tYqLCxMr7zyigYOHKgvv/xSOTk5GjFiREc3s9vq16+frrnmGjU3N+u+++7T5s2blZ+ff8be\nq127diktLU2JiYn62c9+5vk+JydH+fn5ys/P17Jly1odM3bsWMXHx+vWW2/Vo48+2ua6fvrTnyo0\nNFR33nnnhTfORzA0CwAAoIMVFRWdddvChQu1cOHCM26bM2eO5syZc8ZtltX65bzjx4/XkSNHWn1X\nUlKi6upq9ejRQ/7+/lq0aJGGDBnSrtrxT2FhYerRo4caGxv11ltvafLkyQoODrZlmN2ZzJ8/XwUF\nBVqxYkW3eLNX128BAAAA5HK5VFpaquPHjys8PFyS1LdvXy9X1T2MHTtWffr00bJly1RRUWHLMLtT\n3X///fr888/1xhtvKCgoqN3X8UX0iAAAAHRhjzzyiF5//XW5XC5VVVWpoaFBDodDDz/8sHr06OHt\n8rqFG264QcHBwWpsbNR9992nJ598UosXL9bChQuVmZmpgIAA9erVS/3799d9993XrnOfHGY3a9Ys\n/fjHP1ZISMhp++zcuVP/+Z//qcTERI0dO1aSFB8ff9pwr67GnNrNdy4ZGRlWW7ubAHQ+Y8znlmVl\neLuO9uJeAvge7idd35EjR7Rp0yYtX75co0eP1ogRI8761idcuKNHj+q9997TiBEjlJaW5u1yfFJb\n7yf0iAAAAHQD/fv397wKNicn56xrUuDbiYmJ0YwZM/Tuu++qoqJC48ePl8PhUFNTkwIDA71dXpfC\n/1AAAIBuori4WAMGDGBuSCfr2bOnvve97+nDDz/UihUrlJKSoo8//lgTJkxQbGzsBZ/35DC7U737\n7ruKiYn5NiX7JIIIAACAj3G53Fr1QaFeeGm7jpTUqFdEsG75wQhdOz1BwUFnf3wrLi5Wnz59bKz0\n4uVwODRp0iR99NFHeuKJJ5SYmKhVq1bp0ksvveAhWw899JAeeuihDq7UdxFEAAAAfMjhr6p19U2v\nq7SsTjW1zZ7vt+4q1S8fXac3XrpWqcPPvPhdcXGxUlNT7Sr1oudyuVRcXKzY2Fjt2LFDQ4cO1aZN\nm1RZWanx48fL39/f2yX6NIIIAACAj6irb9ZVNyzVkZIatbS0fqFQbW2zatWsq298TRtW3qyB/cNa\nba+vr1dDQ8N5V/tGx3E4HBoxYoSqqqoUEhKinTt3qq6uTpZlqaqqSldeeSVvLjsH1hEBAADwEUuX\n71H5sYbTQsg31Te49NRzm0/7/uSwLGNMZ5aIU4wYMULTpk1Tr169lJ6erqqqKn3xxRf66quvtGzZ\nMpWVleng4VItffMTvfDKGi17+1MdKanwdtk+gR4RAAAAH/H08/mqq2s+5z7NzW4t+dsu/ccD4+Xn\n98/QUVJSwiR1LxkwYICuvfZarVq1SiNHjtTevXuVn5+vpOQRWvTUMjW5/NTidsuyJD9j9OHGnYof\n1EfzbpmskOCL901b9IgAAAD4iCPFNW3ar6mpRdU1Ta2+Ky4uJoh4UUREhGbMmKHY2FglJiYqpk8/\nFRwxqmu05Go5EUIkyW1Zam5u0f4Dxfq//71CLleLdwv3IoIIAACAjwgKbNvk5ha3peCgf+7rcrlU\nUVGh6OgzT2L3JWlpaaqvrz/r9qKiIkVFRX3r63TUedojMDBQV111lVJTUxUU2l9+jiBJZx4q52px\nq7T8uDZv329rjb6EIAIAAOAjpk8eIof/+ed4xA10aOnSV/Xxxx/ryJEjKikpUe/evbvEIob5+fkK\nCQnxdhmdxhijrKwsHW84ewg5qanJpdUfbbOnMB9EEAEAAPARd9yaLkfAuXtFeoQ49NiDUzR9+nT1\n6NFDGzdu1AsvvKCvvvpKhw4dktvttqnaC2OMUU1Njdxut+644w4lJydr1KhRGjduXKv97r77bqWm\npmrkyJFat26dpH/2cvzyl79Uenq6kpKStH79es8xTz/9tIYNG6bRo0fr+eeft7Vd39TS4lZdQ9P5\nd5R0tLyqk6vxXQQRAAAAH5E0rLce/cU4hQSfuWejR4hDs28YrqmThsjpdCo9PV3XXXedhg8frtjY\nWG3ZskVLlizRmjVrVFRUJJfLZXML2m7r1q364IMPtGvXLm3dulVvvvmmZ1t5eblGjRqlbdu26ckn\nn9SNN96oxsZGz7YxY8Zoy5Yteuihh3TvvfdKkrZt26bHHntMH3/8sTZv3qzy8nKvtEuS2vPiMr+L\n+C1nBBEAAAAf8i+3jNJLz05XWkqMAhxSYIAlf3+3Ip3Swl9cpkUPX9Fqf8uyVF1drQkTJig3N1c3\n3HCD+vbtq507d+qll17Se++9p71796qpqW2/obfLkCFD1NzcrFtvvVVLlixptS0wMFCzZ8+WJGVn\nZyskJER79uyRJIWGhurqq6+WJGVlZWnfvn2SpLVr12r69OmeleXnzZtnV1NaOX78uLZs2aIeQW17\nzB4ad/G+YMD3BxICAABcZCaNj9Wk8bF68U/LtG3HPpUePaTLxw7XlVfEnLZOSGVlpYKDgz3zLnr0\n6KHhw4dr+PDhamho0IEDB7R3716tW7dO/fr1U3x8vGJjYxUcHOyNpnlERERo586dWrt2rVavXq17\n771Xmzefvj7KqYKCgjx/9/f394len4aGBu3fv18FBQWqqqrSsGHDNHXSaC1/N19NzWevLzDQoZzx\nqTZW6lsIIgAAAD4qbrBT1VWBqq9uVHR09BkXKzzX+iHBwcFKSkpSUlKSmpqadOjQIRUWFuqTTz5R\nVFSU4uPjFR8f75XVv0tLS+VwODRlyhTl5OTozTff1P79+9W/f381NTXpL3/5i2bPnq1169apvr5e\nycnJOnLkyFnPl52drUWLFuno0aOKiYnp9DkiLS0tOnjwoAoKCnTkyBENGjRI6enpGjhwoPz8/OR2\nW/rH/lLt3nv4jGEkMMChjFFDlTikf6fW6csIIgAAAD5qzJgxGjdunP785z9rxowZ8vM7fbhPcXGx\n+vXrd95zBQYGaujQoRo6dKhcLpe+/PJLFRYWKi8vT06n0xNKwsLCOqMppzl06JBuu+02uVwuuVwu\nTZ06VVlZWTp48KAiIyOVn5+vxx9/XJZl6ZVXXlFg4LkX/ktNTdX999+vcePGKTw8XNOmTeuUuouL\ni1VQUKD9+/crMjJSCQkJys7OPq0+Pz+jf7k5R2+uztOHG3bJmBPD6IwxMsboyuxRmjx+1BnD5cXC\nWCdXV2mDjIwMKy8vrxPLAdAexpjPLcvK8HYd7cW9BPA93E98T1xcnIKDgxUUFKSKigo98sgjio+P\n1/z583WyzZs2bdLUqVP19NNPa9asWRd0HbfbrcOHD6uwsFBFRUUKDQ1VXFychgw5MSEeUlVVlQoK\nClRQUCB/f38lJiZq2LBhCg0NbdPxzc0u7dl3RLV1jQoPDVHi0P7y9+++U7Xbej+hRwQAAMBHLV26\nVCkpKfrtb3+rO+64o9Wk7jVr1mj27NmaN2+efvCDH1zwNfz8/DRo0CANGjRIl19+uYqLi1VYWKi3\n3npLAQEBnp4SuxcH9LaGhgbt27dPBQUFqq6u1rBhwzR58uQL+ncICHAoJXlwJ1TZtRFEAAAAfFxq\naqp69OihwsJCSdKKFSt0++2365lnnlFwcHCHDe8xxqhfv37q16+fxowZo9LSUhUWFmr16tWyLMsT\nSmJiTp803x20tLTowIEDKigo0FdffaXBgwfrkksu0YABA844LA7fDkEEAADAx+3evVuNjY1KSEhQ\nQUGBbr75Zn3yySeqqqrqtInmxhjFxMQoJiZGl112mcrLy1VYWKiPPvpIjY2NnuFbffv27dIP6ZZl\neeZ9FBYWKioqSgkJCZo4caICAgK8XV63RhABAADwUTNnzlRwcLAcDof+/d//XU6nU/369VNERISe\nffZZTZw4UWPGjLGllsjISEVGRiojI0PHjh1TUVGRPv30U1VXVys2Nlbx8fEaMGCA/P3PvTK8rzh2\n7Jhn3kdgYKASEhI0c+ZM9ezZ09ulXTQIIgAAAD7q5ByRgwcPaseOHZJOLOj37rvvKicnR7t27VJu\nbq7tdTmdTqWlpSktLU01NTUqLCxUfn6+1qxZo8GDBys+Pl6DBg2Sw/HPR83S0lL17t3bq0Glvr7e\nM++jtrZWw4YN05QpUxQZGemRNK0fAAAHEUlEQVS1mi5mBBEAAAAfFxYWppqaGs8wrIiICC1ZskS5\nubn6+c9/rieffNJrtYWGhmrkyJEaOXKk6urqVFRUpC+++EIffvih+vfvr/j4ePXr109///vf5XA4\nzhpUOkp1dbVKSko0bNgwSZLL5fLM+yguLlZsbKwyMzM1YMCAbjnPpSshiAAAAPi40NBQ1dTUKCYm\nxvNdXV2dnn76ad1///366U9/6tUwctI3V3VvbGzUgQMHtH//fr3++us6fPiwoqKiVFtbq71798rh\ncGjQoEGKj4/X4MGDz7hOSFVTo946cED5ZWWSpLSoKE2PjVVEYFCr/RobGz0rmxcXF0s68Tawkws4\nxsTEKCEhQZMmTWLehw8hiAAAAPigoqIiz98DAgLk7++vrKwszxoixcXFGj58uD777DMvVXhuQUFB\nSkxMVGJioizLksvlUllZmfbv36/Q0FBPKCksLJSfn58GDhyouLg4z/opr+3fp2d37pCR1Oh2S5Ly\ny0r14u4v9OPhI3Rd/BDPyuYHDhyQ2+1WbW2tjh49qqNHj6q2tlaTJk1SZmamV1aOx/kRRAAAALqA\nk70iwcHBsixLR48e1cSJE71dVptERERo8ODBio6OVktLiyorK1VeXq4DBw4oJCREkZGRqq2t1cGD\nB7Vu3Tod7ROjtbLUdMrC2ycDybM7tmvzpk2Kq65RU1OTSktLVVJSoqamJvXp00cpKSmKi4tTamqq\nN5qLNiKIAAAAdAEng0hUVJQqKioUEhKi4OBgb5fVJmPGjFFWVpZnscSioiJFRUXJ7XarqqpKZWVl\n2rp1qwIDA9U7OlqfRvaW6xwrjzdL+jQoUMc37lRNVZUiIyMVHx8vp9MpY4z69OmjhIQE+xqIC0IQ\nAQAA6ALCwsJUXV0tSSopKVHfvn29XFH7fHOxxLFjx3oWS9y/f7969eqlYcOG6fjx49pjudXibpHO\nEUQkyW1ZMkOH6rKvh62Fh4crISFBCQkJCg8Pt6lV+DYIIgAAAF3AyR4R6cT8kP79+3u5om8nOjpa\n0dHRuvTSS1VRUaHCwkIVFhbqUGODrDa8Tcvt7y9HTLRGDhykhIQE9enTx4aq0ZEIIgAAAF1AaGio\nSkpKJJ0IIqNHj/ZyRR2nd+/e6t27ty655BLVbN+uHfv3quU8x/gbo8zRo/XdxCRbakTHO3efFwAA\nAHxCaGioqqurVVtbK5fLJafT6e2SOsW4wYPkaMOihw5/f2XSC9Kl0SMCAADgwyy3pa/ym7T7LT/p\n0Bi9t6pGEeGX63Beg/qPDpLx616L8iVEODWgZ08VHj8u6yz7GEkDevZUQkT3DGMXC3pEAAAAfJTb\nZWnD744p7/kqVR1wy7j9ZbUYuSt76vMXq7X+N8fU0ny2x/Wu65HMS9UzIOCMD6pGUs+AAD2Seand\nZaGDEUQAAAB81NaXq1Ve0KyWxtO3tTRaqtjXrPwl1fYX1skGhYbpf66YoEv79FGAn596Ohzq6XAo\nwM9Pl/Xpo/+5YoIGhYZ5u0x8SwzNAgAA8EFNNW4d3Nggd/PZ93E3S19+1qCUG0IVFNa9fr/cv2dP\nLcoaq/KGBu2tqpIkDYuIUGQXWTsF50cQAQAA8EFHNjfKtGH6hzHS4bwGDZnQo/OL8oLI4GDCRzfV\nvaIzAABAN9FY7VbLOXpDTmppkhqPuzu/IKCDEUQAAAB8UGCon/wDzr+fX8CJfYGuhv+1AAAAPqh/\nepCstnR0WFL/S4I6vR6goxFEAAAAfFBQuJ/6XxIkv3P0ivgFSH1HBSnEef4FAAFfQxABAADwUaN/\nFC7nYIf8A0/f5h8ohQ9w6JL/FW5/YUAH4K1ZAAAAPso/0Ojye3rp0KcNKninTtVftUiSQvv4K+Gq\nHho8Jlh+ju61sjouHgQRAAAAH+bnMIodF6LYcSGy3CdWUTd+hA90fQQRAACALoIAgu6EOSIAAAAA\nbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAAgO0IIgAA\nAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQAAACA7Qgi\nAAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDt\nCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAA\ngO0IIgAAAABsZyzLavvOxpRKOtB55QBop1jLsqK9XUR7cS8BfBL3EwAdpU33k3YFEQAAAADoCAzN\nAgAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAAgO0IIgAAAABs\nRxABAAAAYLv/D3kOzrTHbk47AAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "rule1 = Rule.from_transform(nx.DiGraph())\n",
    "# inject node addition\n",
    "rule1.inject_add_nodes_from([\n",
    "    (\"EGFR_1\", {\"uniprotid\": \"P00533\"}),\n",
    "    (\"EGFR_2\", {\"uniprotid\": \"P00533\"}),\n",
    "    (\"isbnd\", {\"type\": \"be\", \"test\": True}),\n",
    "    (\"PK\", {\"name\": \"Protein kinase\"}),\n",
    "    (\"mod\", {\"value\": True}),\n",
    "    (\"phosphorylation\", {\"name\": \"phosphorylation\", \"test\": False})\n",
    "])\n",
    "rule1.inject_add_edges_from([\n",
    "    (\"EGFR_1\", \"isbnd\"),\n",
    "    (\"EGFR_2\", \"isbnd\"),\n",
    "    (\"PK\", \"EGFR_1\", {\"start\": 100, \"end\": 600}),\n",
    "    (\"PK\", \"mod\"),\n",
    "    (\"mod\", \"phosphorylation\"),\n",
    "    (\"phosphorylation\", \"EGFR_2\")\n",
    "])\n",
    "\n",
    "plot_rule(rule1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rhs_typing1 = {\n",
    "    \"meta_model\": {\n",
    "        \"EGFR_1\": \"gene\",\n",
    "        \"EGFR_2\": \"gene\",\n",
    "        \"PK\": \"region\",\n",
    "        \"phosphorylation\": \"state\",\n",
    "        \"isbnd\": \"bnd\",\n",
    "        \"mod\": \"mod\"\n",
    "    }\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Empty instance \n",
      "\n",
      "// Adding node 'isbnd' from the rhs \n",
      "CREATE (rhs_isbnd:nugget_1) \n",
      "SET rhs_isbnd.id = toString(id(rhs_isbnd)) \n",
      "WITH toString(id(rhs_isbnd)) as rhs_isbnd_id , rhs_isbnd\n",
      "\n",
      "\n",
      "// Adding node 'PK' from the rhs \n",
      "CREATE (rhs_PK:nugget_1) \n",
      "SET rhs_PK.id = toString(id(rhs_PK)) \n",
      "WITH toString(id(rhs_PK)) as rhs_PK_id , rhs_isbnd, rhs_isbnd_id, rhs_PK\n",
      "\n",
      "\n",
      "// Adding node 'phosphorylation' from the rhs \n",
      "CREATE (rhs_phosphorylation:nugget_1) \n",
      "SET rhs_phosphorylation.id = toString(id(rhs_phosphorylation)) \n",
      "WITH toString(id(rhs_phosphorylation)) as rhs_phosphorylation_id , rhs_PK_id, rhs_isbnd, rhs_PK, rhs_isbnd_id, rhs_phosphorylation\n",
      "\n",
      "\n",
      "// Adding node 'EGFR_2' from the rhs \n",
      "CREATE (rhs_EGFR_2:nugget_1) \n",
      "SET rhs_EGFR_2.id = toString(id(rhs_EGFR_2)) \n",
      "WITH toString(id(rhs_EGFR_2)) as rhs_EGFR_2_id , rhs_PK_id, rhs_phosphorylation_id, rhs_EGFR_2, rhs_isbnd, rhs_PK, rhs_isbnd_id, rhs_phosphorylation\n",
      "\n",
      "\n",
      "// Adding node 'EGFR_1' from the rhs \n",
      "CREATE (rhs_EGFR_1:nugget_1) \n",
      "SET rhs_EGFR_1.id = toString(id(rhs_EGFR_1)) \n",
      "WITH toString(id(rhs_EGFR_1)) as rhs_EGFR_1_id , rhs_PK_id, rhs_phosphorylation_id, rhs_EGFR_1, rhs_EGFR_2, rhs_isbnd, rhs_PK, rhs_isbnd_id, rhs_EGFR_2_id, rhs_phosphorylation\n",
      "\n",
      "\n",
      "// Adding node 'mod' from the rhs \n",
      "CREATE (rhs_mod:nugget_1) \n",
      "SET rhs_mod.id = toString(id(rhs_mod)) \n",
      "WITH toString(id(rhs_mod)) as rhs_mod_id , rhs_PK_id, rhs_phosphorylation_id, rhs_EGFR_1, rhs_EGFR_1_id, rhs_EGFR_2, rhs_isbnd, rhs_PK, rhs_isbnd_id, rhs_EGFR_2_id, rhs_mod, rhs_phosphorylation\n",
      "\n",
      "\n",
      "// Adding properties to the node 'EGFR_1' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'uniprotid' IN keys(rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_EGFR_1.uniprotid = ['P00533'])\n",
      "FOREACH(dummy IN CASE WHEN 'uniprotid' IN keys(rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['P00533'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_EGFR_1.uniprotid THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_EGFR_1.uniprotid = rhs_EGFR_1.uniprotid + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'EGFR_2' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'uniprotid' IN keys(rhs_EGFR_2) THEN [1] ELSE [] END |\n",
      "\tSET rhs_EGFR_2.uniprotid = ['P00533'])\n",
      "FOREACH(dummy IN CASE WHEN 'uniprotid' IN keys(rhs_EGFR_2) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['P00533'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_EGFR_2.uniprotid THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_EGFR_2.uniprotid = rhs_EGFR_2.uniprotid + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'isbnd' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'type' IN keys(rhs_isbnd) THEN [1] ELSE [] END |\n",
      "\tSET rhs_isbnd.type = ['be'])\n",
      "FOREACH(dummy IN CASE WHEN 'type' IN keys(rhs_isbnd) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['be'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_isbnd.type THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_isbnd.type = rhs_isbnd.type + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'test' IN keys(rhs_isbnd) THEN [1] ELSE [] END |\n",
      "\tSET rhs_isbnd.test = [True])\n",
      "FOREACH(dummy IN CASE WHEN 'test' IN keys(rhs_isbnd) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [True] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_isbnd.test THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_isbnd.test = rhs_isbnd.test + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'PK' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_PK) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK.name = ['Protein kinase'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_PK) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Protein kinase'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK.name = rhs_PK.name + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'mod' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'value' IN keys(rhs_mod) THEN [1] ELSE [] END |\n",
      "\tSET rhs_mod.value = [True])\n",
      "FOREACH(dummy IN CASE WHEN 'value' IN keys(rhs_mod) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [True] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_mod.value THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_mod.value = rhs_mod.value + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'phosphorylation' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tSET rhs_phosphorylation.name = ['phosphorylation'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['phosphorylation'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_phosphorylation.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_phosphorylation.name = rhs_phosphorylation.name + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'test' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tSET rhs_phosphorylation.test = [False])\n",
      "FOREACH(dummy IN CASE WHEN 'test' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [False] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_phosphorylation.test THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_phosphorylation.test = rhs_phosphorylation.test + [val])))\n",
      "\n",
      "\n",
      "// Adding edge 'phosphorylation->EGFR_2' from the rhs \n",
      "MERGE (rhs_phosphorylation)-[rhs_phosphorylation_rhs_EGFR_2:edge]->(rhs_EGFR_2)\n",
      "\n",
      "\n",
      "// Adding edge 'EGFR_2->isbnd' from the rhs \n",
      "MERGE (rhs_EGFR_2)-[rhs_EGFR_2_rhs_isbnd:edge]->(rhs_isbnd)\n",
      "\n",
      "\n",
      "// Adding edge 'mod->phosphorylation' from the rhs \n",
      "MERGE (rhs_mod)-[rhs_mod_rhs_phosphorylation:edge]->(rhs_phosphorylation)\n",
      "\n",
      "\n",
      "// Adding edge 'EGFR_1->isbnd' from the rhs \n",
      "MERGE (rhs_EGFR_1)-[rhs_EGFR_1_rhs_isbnd:edge]->(rhs_isbnd)\n",
      "\n",
      "\n",
      "// Adding edge 'PK->EGFR_1' from the rhs \n",
      "MERGE (rhs_PK)-[rhs_PK_rhs_EGFR_1:edge]->(rhs_EGFR_1)\n",
      "\n",
      "\n",
      "// Adding edge 'PK->mod' from the rhs \n",
      "MERGE (rhs_PK)-[rhs_PK_rhs_mod:edge]->(rhs_mod)\n",
      "\n",
      "\n",
      "// Adding properties to an edge 'PK'->'EGFR_1' from the rhs \n",
      "WITH rhs_PK_id, rhs_phosphorylation_id, rhs_EGFR_1, rhs_EGFR_1_id, rhs_EGFR_2, rhs_PK_rhs_EGFR_1, rhs_isbnd, rhs_PK, rhs_isbnd_id, rhs_EGFR_2_id, rhs_mod, rhs_phosphorylation, rhs_mod_id \n",
      "FOREACH(dummy IN CASE WHEN NOT 'start' IN keys(rhs_PK_rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK_rhs_EGFR_1.start = [100])\n",
      "FOREACH(dummy IN CASE WHEN 'start' IN keys(rhs_PK_rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [100] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK_rhs_EGFR_1.start THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK_rhs_EGFR_1.start = rhs_PK_rhs_EGFR_1.start + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'end' IN keys(rhs_PK_rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK_rhs_EGFR_1.end = [600])\n",
      "FOREACH(dummy IN CASE WHEN 'end' IN keys(rhs_PK_rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [600] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK_rhs_EGFR_1.end THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK_rhs_EGFR_1.end = rhs_PK_rhs_EGFR_1.end + [val])))\n",
      "WITH rhs_PK_id, rhs_phosphorylation_id, rhs_EGFR_1, rhs_EGFR_1_id, rhs_EGFR_2, rhs_PK_rhs_EGFR_1, rhs_isbnd, rhs_PK, rhs_isbnd_id, rhs_EGFR_2_id, rhs_mod, rhs_phosphorylation, rhs_mod_id \n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_PK_id, rhs_phosphorylation_id, rhs_EGFR_1, rhs_EGFR_1_id, rhs_EGFR_2, rhs_PK_rhs_EGFR_1, rhs_isbnd, rhs_PK, rhs_isbnd_id, rhs_EGFR_2_id, rhs_mod, rhs_phosphorylation, rhs_mod_id\n",
      "\n",
      "// Checking consistency of introduced rhs\n",
      "MATCH (G:hierarchyNode)\n",
      "WHERE G.id = 'nugget_1'\n",
      "OPTIONAL MATCH (t_i:hierarchyNode)\n",
      "WHERE (t_i)<-[:hierarchyEdge*1..]-(G)-[:hierarchyEdge*1..]->(t_i)\n",
      "WITH DISTINCT t_i\n",
      "RETURN collect(t_i.id)\n",
      "\n",
      "// Replacing ':tmp_typing' with ':typing'\n",
      "MATCH (n:nugget_1)-[t:tmp_typing]->(m)\n",
      "OPTIONAL MATCH (:hierarchyNode {id: 'nugget_1'})-[skeleton_rel:hierarchyEdge]->(:hierarchyNode {id: labels(m)[0]}) \n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [] ELSE [1] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:typing]->(m)\n",
      ")\n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [1] ELSE [] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:transitive_typing]->(m)\n",
      ")\n",
      "\n",
      "// Addition of nodes and properties in 'action_graph'\n",
      "MATCH (n:nugget_1)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:action_graph)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:nugget_1)-[trans_type:transitive_typing]->(successor_node:action_graph)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:action_graph)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, node_img, nodes_to_merge_props\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, node_img, nodes_to_merge_props\n",
      "SET node_img += new_props\n",
      "\n",
      "\n",
      "// Addition of edges and properties in 'action_graph'\n",
      "MATCH (n:nugget_1)-[rel:edge]->(m:nugget_1), (n)-[:typing]->(x:action_graph), (m)-[:typing]->(y:action_graph)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, y, rel_img, x\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, y, rel_img, x\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, y, rel_img, x\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, y, rel_img, x\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, y, edges_to_merge_props, rel_img, x\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, y, edges_to_merge_props, rel_img, x\n",
      "SET rel_img += new_props\n",
      "\n",
      "// Addition of nodes and properties in 'meta_model'\n",
      "MATCH (n:action_graph)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:meta_model)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:nugget_1)-[trans_type:transitive_typing]->(successor_node:meta_model)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:meta_model)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, node_img, nodes_to_merge_props\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, node_img, nodes_to_merge_props\n",
      "SET node_img += new_props\n",
      "\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "// Addition of edges and properties in 'meta_model'\n",
      "MATCH (n:action_graph)-[rel:edge]->(m:action_graph), (n)-[:typing]->(x:meta_model), (m)-[:typing]->(y:meta_model)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, y, rel_img, x\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, y, rel_img, x\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, y, rel_img, x\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, y, rel_img, x\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, y, edges_to_merge_props, rel_img, x\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, y, edges_to_merge_props, rel_img, x\n",
      "SET rel_img += new_props\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g1 = h.rewrite(\"nugget_1\", rule1, {}, rhs_typing=rhs_typing1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3) Merge two nodes in the action graph (to avoid gene duplication)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAFWZJREFUeJzt3XtwVOd9xvHn1a4ugDBCBmEuDlIS\nGSGBJG4OKDiVDTGWSIzryA5hKM40UCcNlssYA3VaykDHDIkmKYwzgB23susmtU2RS10whDDgOLKJ\nhUMMFsWKuThyzMUgQBd03bd/CDTiIrFLtO/uar+fmZ1BZ99z9nc0nJ/Os+fds8ZaKwAAAABwKSbU\nBQAAAACIPgQRAAAAAM4RRAAAAAA4RxABAAAA4BxBBAAAAIBzBBEAAAAAzhFEAAAAADhHEOlFjDHH\njDHTr1qWb4ypvs7Y3caY+Z1+fsoYc9QYU2eMqTbGvOyiZgCR6VK/uXipZ5w0xpQaYxJDXReA8HJV\nrzjRuVdc+vc/XzU+1RhjjTHeSz+PMMb8lzHmM2PMeWPMQWPMt0OwKwgCgghkjHlE0l9Jmm6tTZQ0\nUdKvQlsVgAjw9Us9Y7za+8Y/hLgeAOHpcq/IlTRO0t8HsO6/S/qjpJGSblX7+crJHq8QIeENdQEI\nC5MkbbfWfiRJ1toTkp4NbUkAIoW19hNjzDZJY0JdC4DwZa09YYzZrvZA4q9JkhZZa+sv/fy7nq8M\nocIVEUjSO5LmGWOeNMZMNMZ4Ql0QgMhhjLldUqE4QQDQDWPMCEkFkv4QwGrvSPqpMWa2MeZzwakM\noUIQiQ7DjDHnOj8kTb38pLX2JUmPSZohaY+kU8aYpSGqFUDkeO1SP3lL7b3j6RDXAyA8vWaMqVX7\nFKtTkv6p03OLrzo/ef+qdR+S9GtJ/yjpqDFmvzFmkpOqEXQEkejwJ2ttUueH2k8cOlhr/8NaO11S\nkqTvSlpljJkRimIBRIwHLvWUkdbav7XWXgx1QQDC0gPW2v6S8iVlSBrU6bmSq85PsjuvaK2tsdYu\ns9ZmSRoiab/ag41xVDuCiCCCK1hrW6y1r6r9HQnmewMAgB5hrd0jqVRSyU2u/9mldYdJSu65yhAq\nBJHeJ9YYk3D5IT9uSGCM+bYxZqYxpr8xJsYYUyApS9LeoFcLAACiyb9I+qoxJsefwcaYNcaYMcYY\nrzGmv6TvSfqDtfZMUKuEE9w1q/fZetXPv/FjnQuSnpL0kiSPpOOSvmetfavbtQAAAAJgrT1tjHlR\n0nJJtX6s0ldSmaShki6q/U3S+4NXIVwy1tpQ1wAAAAAgyjA1CwAAAIBzBBEAAAAAzhFEAAAAADhH\nEAEAAADgXEB3zRo0aJBNTU0NUikAArVv377PrLWDQ11HoOglQPihnwDoKf72k4CCSGpqqioqKm6+\nKgA9yhhzPNQ13Ax6CRB+6CcAeoq//YSpWQAAAACcI4gAAAAAcI4gAgAAAMA5gggAAAAA5wgiAAAA\nAJwjiAAAAABwjiACAAAAwDmCCAAAAADnCCIAAAAAnCOIAAAAAHCOIAIAAADAOYIIAAAAAOcIIgAA\nAACcI4gAAAAAcI4gAgAAAMA5gggAAAAA5wgiAAAAAJwjiAAAAABwjiACAAAAwDmCCAAAAADnCCIA\nAAAAnCOIAAAAAHCOIAIAAADAOYIIAAAAAOcIIgAAAACcI4gAAAAAcI4gAgAAAMA5gggAAAAA5wgi\nAAAAAJwjiAAAAABwjiACAAAAwDmCCAAAAADnCCIAAAAAnCOIAAAAAHCOIAIAAADAOYIIAAAAAOcI\nIgAAAACcI4gAAAAAcI4gAgAAAMA5gggAAAAA5wgiAAAAAJwjiAAAAABwjiACAAAAwDmCCAAAAADn\nCCIAAAAAnCOIAAAAAHCOIAIAAADAOYIIAAAAAOcIIgAAAACcI4gAAAAAcI4gAgAAAMA5gggAAAAA\n5wgiAAAAAJwjiAAAAABwjiACAAAAwDmCCAAAAADnCCIAAAAAnCOIAAAAAHCOIAIAAADAOYIIAAAA\nAOcIIgAAAACcI4gAAAAAcI4gAgAAAMA5gggAAAAA5wgiAAAAAJwjiAAAAABwjiACAAAAwDmCCAAA\nAADnCCIAAAAAnCOIAAAAAHCOIAIAAADAOYIIAAAAAOcIIgAAAACcI4gAAAAAcC7ig0hqaqoyMjKU\nm5vb8Th27JhaWlq0YsUKjRo1SllZWcrJyVFRUZEqKyslSaWlpUpKSrpivcOHD0uSjDHKzs5WTk6O\nsrOztWXLlm5rOHPmjAoLCzVq1CiNHTtWDz74oE6fPh30fQfQs+gnAAC44w11AT1h06ZNGjNmzBXL\n5s6dq4aGBu3du1dJSUmy1mrr1q06fPiwMjMzJUnTp0/Xpk2brrvN8vJyJSYmatu2bXr44YdVU1Mj\nr/f6vy5jjJYsWaL8/HxJ0pNPPqlly5bp+eef77mdBOAE/QQAADd6RRC5WlVVlcrKylRdXa2kpCRJ\n7X/cZ86cGfC28vPzVVdXp5qaGg0ePPi6Y5KTkztOGiRp8uTJWr9+/U3VDiC80E8AAAiOXhFEioqK\nlJCQIEnyer1asmSJ0tPTNXDgwG7X27lzp3JzcyVJaWlpKisru2ZMWVmZ7rnnni5PGq7m8/m0fv16\n3X///QHuBYBwQD8BAMCNXhFErp5K8corr1zxfGVlpebMmaOGhgYVFBRo7dq1krqfSpGXl6fa2lqd\nOHFCu3bt8ruWxx57TImJiVq4cOFN7AmAUKOfAADgRsR/WP16xo0bp6qqKp07d06SlJmZqf3796u4\nuFjnz5/3axvl5eU6evSoVq1apdmzZ6uxsfGG6yxevFhVVVV6+eWXFRPTK3+1QNShnwAAEBy98q9b\nenq6Zs2apQULFlxxolBfXx/wtp544gkNGTJEGzZs6HbcU089pX379um1115TfHx8wK8DIDzRTwAA\nCI5eMTWr85xuSfrZz36m0tJSrVq1SpMmTVJsbKwGDhyoYcOGadmyZQFt2xijkpISzZ49W48++qj6\n9OlzzZgPPvhAq1ev1h133KG8vDxJXc8RBxDe6CcAALhhrLV+D544caKtqKgIYjkAAmGM2WetnRjq\nOgJFLwHCD/0EQE/xt5/0yqlZAAAAAMJbr5ia5crKlSu1efPma5bv2LFDKSkpIagIQKSinwAAoh1T\ns4AIxlQKAD2FfgKgpzA1CwAAAEDYIoh00uprU2Nrc6jLANALNLY2q9XXFuoyAAAIW1H/GRGf9WlL\n5W+17q0tqjz5Rxkj3dq3vx6dXKBHJkzTLQl9Q10igAhxobFBL+z7lTa+s01nGmplrZQ55HYVT71f\n92feqRjDez8AAFwW1UGkzefTd15dqz1HDqqhpUmSZK10uv6CSvZs1r+9u1Nbv7NCt/UfGOJKAYS7\nE7U1Knx+hc40XFBja0vH8g9OfqxFW57Tawff1vMPPS4P35IOAICkKJ+a9aM9m7X7yIGOENJZY2uL\nTtad05yf/0iBfKAfQPSx1upbP/+RTtbVXBFCLmtoadLuIwdU8ua1d8kCACBaRW0QaWpt0XN739DF\nlq4/E9Lqa9PRsye175OPHFYGINJUVP9Bx86eVKvP1+WYiy3Nem7vdjVdJ6gAABCNojaIlB87JGPM\nDcc1tjbr1fd/7aAiAJFq04G3/L7RRfmxQ0GuBgCAyBC1QaSmsc6vKVc+a3W67oKDigBEqtN1F+Tz\no59Ya1XTWOegIgAAwl/UBpHB/Qb4Nc5jYjR8QHKQqwEQyYYPSJbHrztiGaX0Swp6PQAARIKoDSJT\nRmYo1nPjm4bFeb36Vm5+8AsCELFm5/6F4vzpJx6PpozMcFARAADhL2qDiDfGo0V3zVLf2Pgux8R5\nvBo37AvKHHK7w8oARJqsIZ9T7vDPdxtG+sTGa9FdD3D7XgAALonqv4h/86X7NDvnK+obG6+rP7be\nNzZe6YOGqfSbfxeS2gBElhe+uUhfHDTsmjc3jNr7yZzcr2jBl2aEpjgAAMJQVH+hoTFGqwsf0ays\nL+mZ8v/V28cPqc369Pnk2/T9vK/p65l3+jXdAgAGJPTT9vkr9T+Vv9VPy1/XkbMn5DExmjJytBbm\nzdRkpmQBAHAFzrIlTR6ZwUkCgD9bnMerb4zN0zfG5oW6FAAAwl5UT80CAAAAEBoEEYSN1NRUZWRk\nKDc3t+Nx7NgxtbS0aMWKFRo1apSysrKUk5OjoqIiVVZWSpJKS0uVlJR0xXqHDx+W1D79Ljs7Wzk5\nOcrOztaWLVtuWMfixYuVlpYmY4wOHjwY1H0GEBz0EyB6ROrxfr3XX7ZsWcfzFRUVuu+++5SWlqYJ\nEyZo/PjxKikp6XK/Fy1aJElasWKFUlJSlJubq4yMDM2ZM0f19fXd1vLcc88pOztbY8eOVXZ2tl56\n6aUb1t8TmJqFsLJp0yaNGTPmimVz585VQ0OD9u7dq6SkJFlrtXXrVh0+fFiZmZmSpOnTp2vTpk3X\n3WZ5ebkSExO1bds2Pfzww6qpqZHX2/V//QceeECPP/647rrrrp7bMQDO0U+A6BGpx3tXr3/gwAEV\nFBTohRdeUGFhoSTp1KlT+slPfnLD/ZakefPmqaSkRM3NzZo2bZqeeeYZLV26tMs60tPTtXv3biUn\nJ6u6ulq5ubmaOnWqUlNT/d6Xm0EQQVirqqpSWVmZqqurlZTU/kVwxhjNnDkz4G3l5+errq5ONTU1\nGjx4cJfjpk6detP1Aghf9BMgekT68b5mzRrNnz+/I4RIUkpKilavXh3QduLi4pSXl6ePP/6423H5\n+fkd/x4xYoSGDh2q6upqggiiS1FRkRISEiRJXq9XS5YsUXp6ugYOHNjtejt37lRubq4kKS0tTWVl\nZdeMKSsr0z333NNtEwHQe9BPgOgRqcd759eXpIULF2r+/Pl67733VFRUdMP1O+/3mjVrNGPGlbeJ\nr62t1Z49e/T000/7XdPu3bt17tw5TZgwwe91bhZBBGHl6kuMr7zyyhXPV1ZWas6cOWpoaFBBQYHW\nrl0rqftLq3l5eaqtrdWJEye0a9eu4BUPIKzQT4DoEanHe3ev31lxcbHefPNNnTp1Snv37tXtt7d/\n2XZXU7NefPFF/fKXv1RVVZVmzJihu+++2696KisrNW/ePP3iF79Qnz59AtuZm8CH1RHWxo0bp6qq\nKp07d06SlJmZqf3796u4uFjnz5/3axvl5eU6evSoVq1apdmzZ6uxsTGYJQMIU/QTIHpE+vE+btw4\nvfvuux0/r1u3Tvv371dzc7Pa2tpuuP68efP0+9//XkeOHNGBAwe0fv36G65TVVWlwsJCbdy40dm0\nUoIIwlp6erpmzZqlBQsWXNE4bnT3h+t54oknNGTIEG3YsKEnSwQQIegnQPSI9ON9yZIlevbZZ/XG\nG290LGtqavIrhHR22223ae3atVq1apUuXrzY5bgjR45oxowZWrdunQoKCm667kARRBBWioqKrriN\nXUVFhUpLS5WRkaFJkyYpKytLU6dO1b59+1RcXBzQto0xKikp0Q9/+MNuD8bi4mKNGDFC1dXVmj59\nurKysv7c3QIQAvQTIHpE6vF++TMilx/z58+XJOXk5Oj111/Xj3/8Y6WlpenOO+/UtGnT9IMf/EDD\nhg0LqP6ZM2dq9OjR2rhxY5djli5dqjNnzmj58uUdtWzfvj2g17kZxlrr9+CJEyfaioqKIJYDIBDG\nmH3W2omhriNQ9BIg/NBPAPQUf/sJV0QAAAAAOMddsxCVVq5cqc2bN1+zfMeOHUpJSQlBRQAiFf0E\niB6BHu+nTp3Svffee83yBx98UMuXLw9KjV0Jp1ouY2oWEMGYSgGgp9BPAPQUpmYBAAAACFsEEQAA\nAADO8RkR9BrWWjX96bDq/+83ajl3QpLkHTBYiaO+rPjho2ViyN0A/ONradLFo79TQ9VetTXWysR4\nFHfbF9VvVJ7ikoeHujwA6BUIIugVrK9NNb/5TzWfPi61tXQsb635VOff/W95P3pXyXfNlfHwXx5A\n91rrz+nsrn+Vr+Wi1NYqqb3HNFUfUtOnVUocPVWJo78S4ioBRIrWurOq//BtNR5/X7a1WcYbp4SR\n2ep3xxR5E5NDXV5I8RYxeoUL+9+4JoRcZtta1HL2E52v2BKCygBEEmt9qtn9gnyNdR0hpNOzUluL\n6g69pcbqQyGpD0Bkafq0Sp/t2KCLR96TbW2WJNnWZl088p4+27FBTZ9WhbjC0CKIIOL5mht18ej+\n64aQDm2taqyuVFtjnbvCAEScpk+r5GtukNTNHSXbWlR7cJezmgBEpta6s6p5+9X28xPru/JJ65Pa\nWlTz9qtqrTsbmgLDAEEEEa/xk0OSMX6MNGqsrgx6PQAiV8NHFR3vWnanreF8VJ88ALix+g/flnxt\n3Q/ytan+w3fcFBSGCCKIeL6m+hsf6JLka5XvIldEAHTN5+dVUxMTI19jfZCrARDJGo+/f+2VkKtZ\nX/u4KEUQQcSLiesrE+PxY6BHMfF9g18QgIjlb4+wPp9i4voEuRoAkcyfq6uBjOuNCCKIeAnDM2Rt\nN/O5O48dkRnkagBEsr5p42W8cTcc50lIlKf/rQ4qAhCp/OklgYzrjQgiiHgx8X2VcHuW1N2teWM8\nih+aLk/fW9wVBiDixA/PkPHGdzvGeGLVLytfxq/PpgGIVgkjsyVzg1NtE9M+LkoRRNArDJjwNcUm\nDZU8sdc+6YmVd0CKBtz5l+4LAxBRTIxHyfnzZOL6SNeb8umJVZ8vTFLfKD5xAOCffndMuX4f6SzG\no353THZTUBgiiKBXMB6vkvMf0YDxhfL0H9Sx3JOYrFvG3adb7/5rxUTxpU8A/vP2H6TB931f/TKm\ntgcSSTJGcSmf18Avz9YtOV8NbYEAIoI3MVkDpzzU/ibp1VdGTIzkidXAKQ9F9Zca8jXT6DVMjEd9\nUnPVJzW34zMjTJ0AcDNi4vupf1a++mfly/p8kjH0EwABix+arkH3flf1H75znW9WnxzVIUQiiKCX\n4oQBQE8xMUweAHDzvInJGjC+UAPGF4a6lLBDdwUAAADgHEEEAAAAgHMEEQAAAADOEUQAAAAAOEcQ\nAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4RxABAAAA4BxBBAAAAIBzBBEAAAAAzhFEAAAAADhH\nEAEAAADgHEEEAAAAgHMEEQAAAADOEUQAAAAAOEcQAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4\nRxABAAAA4BxBBAAAAIBzBBEAAAAAzhFEAAAAADhHEAEAAADgHEEEAAAAgHMEEQAAAADOEUQAAAAA\nOEcQAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4RxABAAAA4Jyx1vo/2JjTko4HrxwAARpprR0c\n6iICRS8BwhL9BEBP8aufBBREAAAAAKAnMDULAAAAgHMEEQAAAADOEUQAAAAAOEcQAQAAAOAcQQQA\nAACAcwQRAAAAAM4RRAAAAAA4RxABAAAA4BxBBAAAAIBz/w9MnOhzeV3qhQAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\n",
    "    \"EGFR_1\", \"EGFR_2\"\n",
    "])\n",
    "\n",
    "rule2 = Rule.from_transform(pattern)\n",
    "merge_result_id = rule2.inject_merge_nodes([\"EGFR_1\", \"EGFR_2\"])\n",
    "plot_rule(rule2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_EGFR_1:action_graph { id : '102'}) , (lhs_EGFR_2:action_graph { id : '101'})  \n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH lhs_EGFR_1 as p_EGFR_1, lhs_EGFR_2 as p_EGFR_2 \n",
      "\n",
      "// Merging nodes '{'EGFR_2', 'EGFR_1'}' of the preserved part into 'EGFR_1_EGFR_2' \n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, p_EGFR_1, p_EGFR_2\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_EGFR_2) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_EGFR_2[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_EGFR_1, p_EGFR_2\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_EGFR_1) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_EGFR_1[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_EGFR_1, p_EGFR_2\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, p_EGFR_1, p_EGFR_2\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, p_EGFR_1, p_EGFR_2\n",
      "SET p_EGFR_2 = new_props\n",
      "WITH p_EGFR_2 as rhs_EGFR_1_EGFR_2, p_EGFR_1\n",
      "// set appropriate node id\n",
      "SET rhs_EGFR_1_EGFR_2.id = toString(id(rhs_EGFR_1_EGFR_2))\n",
      "SET rhs_EGFR_1_EGFR_2.count = NULL\n",
      "WITH toString(id(rhs_EGFR_1_EGFR_2)) as uid1783805fae294f26b7f3a0b4f60a9cbb, rhs_EGFR_1_EGFR_2, p_EGFR_1\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_maps, [] as pred_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "OPTIONAL MATCH (rhs_EGFR_1_EGFR_2)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(rhs_EGFR_1_EGFR_2)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "OPTIONAL MATCH (p_EGFR_1)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(p_EGFR_1)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN [id(rhs_EGFR_1_EGFR_2),id(p_EGFR_1)] THEN [toString(el['id'])] ELSE [] END) as self_loops, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, rhs_EGFR_1_EGFR_2, self_loops, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, rhs_EGFR_1_EGFR_2, self_loops, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (rhs_EGFR_1_EGFR_2)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(rhs_EGFR_1_EGFR_2)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (rhs_EGFR_1_EGFR_2)-[new_rel:edge]->(rhs_EGFR_1_EGFR_2)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "OPTIONAL MATCH (rhs_EGFR_1_EGFR_2)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "OPTIONAL MATCH (pred)-[:typing]->(rhs_EGFR_1_EGFR_2)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "OPTIONAL MATCH (p_EGFR_1)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "OPTIONAL MATCH (pred)-[:typing]->(p_EGFR_1)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (rhs_EGFR_1_EGFR_2)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(rhs_EGFR_1_EGFR_2))\n",
      "DETACH DELETE (p_EGFR_1)\n",
      "\n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_EGFR_1_EGFR_2, p_EGFR_1, uid1783805fae294f26b7f3a0b4f60a9cbb\n",
      "\n",
      "\n",
      "// Up-propagation to the graph 'meta_model'\n",
      "\n",
      "// Matching of the nodes to merge in 'meta_model'\n",
      "WITH [] as merged_nodes\n",
      "OPTIONAL MATCH (n:action_graph)-[:typing]->(node_to_merge:meta_model)\n",
      "WITH n, collect(node_to_merge) as nodes_to_merge, merged_nodes\n",
      "WHERE n IS NOT NULL AND size(nodes_to_merge) >= 2\n",
      "UNWIND nodes_to_merge as node_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, node_to_merge, n, merged_nodes\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(node_to_merge) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in node_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, node_to_merge, n, merged_nodes\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(new_props) as new_props_col, n, merged_nodes\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge, n, merged_nodes\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, nodes_to_merge, n, merged_nodes\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, nodes_to_merge, n, merged_nodes\n",
      "WITH nodes_to_merge[0] as merged_node, new_props, nodes_to_merge, n, merged_nodes\n",
      "SET merged_node = new_props\n",
      "// set appropriate node id\n",
      "SET merged_node.id = toString(id(merged_node))\n",
      "SET merged_node.count = NULL\n",
      "WITH toString(id(merged_node)) as merged_id, merged_node, nodes_to_merge, n, merged_nodes\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "//create a map from node ids to the id of the merged_node\n",
      "WITH {old_node:node_to_merge.id,  new_node:merged_node} as id_to_merged_id, node_to_merge, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(id_to_merged_id) as ids_to_merged_id, collect(node_to_merge) as nodes_to_merge, n, merged_nodes, merged_id, merged_node\n",
      "WITH apoc.map.groupByMulti(ids_to_merged_id, 'old_node') as ids_to_merged_id, nodes_to_merge, n, merged_nodes, merged_id, merged_node\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(ids_to_merged_id) | \n",
      "\tpairs + [k, REDUCE(values=[], v in ids_to_merged_id[k] | \n",
      "\t\tvalues + CASE WHEN v.new_node IN values THEN [] ELSE v.new_node END)])) as ids_to_merged_id, nodes_to_merge, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect({n:n, nodes_to_merge:nodes_to_merge, merged_node: merged_node, merged_id: merged_id}) as all_n, collect(ids_to_merged_id) as ids_to_merged_id, merged_nodes\n",
      "WITH reduce(acc={}, x in ids_to_merged_id | apoc.map.merge(acc, x)) as ids_to_merged_id, all_n, merged_nodes\n",
      "UNWIND all_n as n_maps\n",
      "WITH n_maps.n as n, n_maps.nodes_to_merge as nodes_to_merge, n_maps.merged_node as merged_node, n_maps.merged_id as merged_id, ids_to_merged_id, merged_nodes\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "OPTIONAL MATCH (node_to_merge)-[out_rel:edge]->(suc)\n",
      "WITH CASE WHEN suc.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[suc.id][0]), neighbor: ids_to_merged_id[suc.id][0], edge: out_rel}\n",
      "\t\tELSE {id: id(suc), neighbor: suc, edge: out_rel} END AS suc_map, node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(suc_map) as suc_maps, node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(node_to_merge)\n",
      "WITH CASE WHEN pred.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[pred.id][0]), neighbor: ids_to_merged_id[pred.id][0], edge: in_rel}\n",
      "\t\tELSE {id: id(pred), neighbor: pred, edge: in_rel} END AS pred_map, node_to_merge, suc_maps, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(pred_map) as pred_maps, suc_maps, node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(node_to_merge.id) as list_ids, collect(suc_maps) as suc_maps_col, collect(pred_maps) as pred_maps_col, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH REDUCE(init=[], maps in suc_maps_col | init + maps) as suc_maps, REDUCE(init=[], maps in pred_maps_col | init + maps) as pred_maps, list_ids, nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN list_ids THEN [toString(el['id'])] ELSE [] END) as self_loops, nodes_to_merge, ids_to_merged_id, list_ids, n, merged_nodes, merged_id, merged_node\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node, self_loops\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node, self_loops\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "WITH nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "OPTIONAL MATCH (node_to_merge)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, node_to_merge, pred_typings, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "OPTIONAL MATCH (pred)-[:typing]->(node_to_merge)\n",
      "WITH pred_typings + collect(pred) as pred_typings, node_to_merge, suc_typings, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(suc_typings) as suc_typings_col, collect(pred_typings) as pred_typings_col, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH REDUCE(init=[], sucs in suc_typings_col | init + sucs) as suc_typings, REDUCE(init=[], preds in pred_typings_col | init + preds) as pred_typings, nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (merged_node)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(merged_node))\n",
      "WITH nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "FOREACH(node in filter(x IN nodes_to_merge WHERE x <> merged_node) |\n",
      "\tDETACH DELETE node)\n",
      "RETURN collect(merged_id) as merged_nodes\n"
     ]
    }
   ],
   "source": [
    "action_graph_EGFR_1 = h.node_type(\"nugget_1\", rhs_g1[\"EGFR_1\"])[\"action_graph\"]\n",
    "action_graph_EGFR_2 = h.node_type(\"nugget_1\", rhs_g1[\"EGFR_2\"])[\"action_graph\"]\n",
    "rhs_g2 = h.rewrite(\n",
    "    \"action_graph\", rule2, \n",
    "    {\"EGFR_1\": str(action_graph_EGFR_1), \"EGFR_2\": str(action_graph_EGFR_2)})\n",
    "action_graph_EGFR = rhs_g2[merge_result_id]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4) Generation rule for nugget 2 (some of the nodes are already in the action graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAIABJREFUeJzt3Xt0FfXd7/HPb+dCrjshQLhDhAIB\ncsVEAREpjRe8gNVgI1SEttJWFD1H7VNbPfIUbRV9+hx91OoRMYLiDQtaBVS8YDCKBBMIIBjUEAQh\nARJyI+Sy5/wR2SXckkgyeyf7/Vora7FnfjPznR3Wb80nM7/fGMuyBAAAAAB2cni6AAAAAAC+hyAC\nAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDtCCIAAAAAbEcQAQAAAGA7gkgnYowpNMaknbBsgjHm\nu1O0/cgY85vjPv/JGPOtMabSGPOdMeYVO2oG0DH90N8c+aHP2G+MyTTGhHm6LgDe5YS+Yt/xfcUP\n/77/hPYxxhjLGOP/w+d+xpjXjTEHjDGHjTFbjDEzPXAqaAcEEcgYc6OkGySlWZYVJilF0vuerQpA\nB3DVD33GKDX2G/d4uB4A3ulYX5EkKVnS3a3Ydomk3ZIGSuqmxuuV/W1eITzC39MFwCukSnrHsqyv\nJcmyrH2S/p9nSwLQUViWtccYs0pSnKdrAeC9LMvaZ4x5R42BpKVSJf0vy7Kqfvic2/aVwVO4IwJJ\n+kzSDGPMXcaYFGOMn6cLAtBxGGP6S7pcXCAAOANjTD9JkyTtbMVmn0l6whiTYYwZ0D6VwVMIIr6h\njzGm7PgfSeOOrbQs6wVJt0q6VNJaScXGmP/wUK0AOo4VP/Qn69TYd/zVw/UA8E4rjDEVanzEqljS\nfcetu/OE65PNJ2w7VVKWpHslfWuMyTPGpNpSNdodQcQ37LUsK/L4HzVeOLhZlvWiZVlpkiIl/U7S\nfGPMpZ4oFkCHcfUPfcpAy7JutizriKcLAuCVrrYsK1zSBEmxkroft+6RE65PEo7f0LKsUsuy/mhZ\n1khJPSXlqTHYGJtqRzsiiKAJy7LqLMt6TY1/keB5bwAA0CYsy1orKVPSIz9y+wM/bNtHUlTbVQZP\nIYh0PgHGmKBjP2rBhATGmJnGmCuMMeHGGIcxZpKkkZLWt3u1AADAl/xfSRcbYxJb0tgY85AxJs4Y\n42+MCZf0e0k7Lcs62K5VwhbMmtX5rDzh8yct2KZc0p8kvSDJT9IuSb+3LGvdGbcCAABoBcuySowx\niyX9H0kVLdgkRNJySb0lHVHjH0knt1+FsJOxLMvTNQAAAADwMTyaBQAAAMB2BBEAAAAAtiOIAAAA\nALAdQQQAAACA7Vo1a1b37t2tmJiYdioFQGtt3LjxgGVZPTxdR2vRlwDeh/4EQFtpaX/SqiASExOj\nnJycH18VgDZljNnl6Rp+DPoSwPvQnwBoKy3tT3g0CwAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA\n2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAA\nAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4II\nAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDtCCIAAAAAbEcQAQAAAGA7\ngggAAAAA2xFEAAAAANiOIAIAAACfUVZWpgULFjRZ9pvf/EZZWVln3G7v3r366U9/6v48b9481dbW\ntkuNvoIgAgAAAJ9xqiCycOFCXXjhhWfcrk+fPvrwww/dn//zP/+TIHKWCCIAAADo0KZPn66UlBTF\nx8fr5z//uUpLSyVJixYtUmJiohITE5Wamqr9+/drzpw5KisrU1JSksaOHStJmjBhgt566y0VFRWp\nV69eqqurc+87PT1dzz//vAoLC9W9e3dJ0pw5cyRJY8eOVVJSkvbu3avevXurpqbGvd3kyZO1dOlS\nu76CDokgAgAAgA7t0UcfVU5OjvLz8zVy5Eg99NBD+uijj/TXv/5V77zzjjZt2qQPP/xQEREReuKJ\nJxQZGam8vDxlZ2c32c+AAQMUFxenVatWSZIOHjyojz76SOnp6U3aPfHEE5Kk7Oxs5eXlqU+fPrro\noov0yiuvSJIKCwuVk5Nz0nZoiiACAACADm3x4sU699xzFR8fr6VLlyovL09vv/22ZsyYoV69ekmS\nwsLCFBQU1Oy+Zs6cqczMTEnS0qVLNXnyZIWGhja73dy5c/Xkk09Kkp566in96le/UmBg4I8/KR9A\nEAEAAECHlZWVpX/84x9avXq18vPzdf/99zd5RKq1rrnmGmVlZengwYPKzMzUrFmzWrTd2LFj1dDQ\noE8++USZmZn67W9/+6Nr8BUEEQAAAHRYZWVlioiIULdu3XT06FEtWrRIknTFFVdo8eLF2r9/vySp\nsrJSNTU1cjqdqq6uVn19/Sn3FxISoilTpujuu+9WeXn5aQexh4eH6/Dhw02W3XrrrcrIyNDYsWPV\nv3//NjzLzokgAgAAgA7rsssu0+DBgzV06FBddNFFGjVqlKTGAeh333230tLSlJiYqIkTJ+rw4cOK\niorS9OnTFR8f7x6sfqKZM2fqmWee0Y033nja495xxx2aOHGikpKSVFZWJknKyMhQaWmpbr755rY/\n0U7IWJbV4sYpKSlWTk5OO5YDoDWMMRsty0rxdB2tRV8CeB/6E+DsrVu3Tr/73e+Un58vY4yny/GY\nlvYn/nYUAwAAAHRmv/71r/Xee+9p8eLFPh1CWoMgAgAAAJylZ5991tMldDiMEQEAAABgO4IIAAAA\nANsRRAAAAADYjjEiAAAA8Gkul0t7d+xR9eFqhUWFq/eQ3gw4twFBBAAAAD7Jsixlv5qt9555VzVV\nNXI4HHI1uBTaNVST5lyulCs73IzWHQpBBAAAAD7Hsiwte2CZNv4rR7U1tU3W1R6p1WvzX1VxYbEu\nv+VyD1XY+TFGBAAAAD5n+yfbtfGtk0PIMXU1dVq75CMVbi60tzAfQhABAACAz3n/2TWqPXLqEHJM\n/dF6ffT8hzZV5HsIIgAAAPApLpdL3+Z922w7y7K0I3uHDRX5JoIIAAAAfIrVYElWy9o21De0bzE+\njCACAAAAn+IX4KeQyNAWtY3sFdnO1fgugggAAAB8zoXXj5N/4JknkA0MDtSEGRPsKcgHEUQAAABs\nVlpaquDgYN12223uZZmZmYqMjFRSUpKSkpI0atQoffDBB+71MTEx2rJly0n7euSRRzRs2DA5HA69\n9dZbttTfGVzwi3EKCg+WcZz6xYUOP4fCuobp3Ct4l0h7IYgAAADYbOnSpRo9erReeukl1db+e+am\ntLQ05eXlKS8vT/fff7/mzJnT7L4uuugirVy5UuPHj2/Pkjud0MhQ3bZ4riJ7RapLSJcm6xwBDnXr\n3023Pj/3pHVoO7zQEAAAwGaLFi3SggUL9Le//U1vvPGGpk6delKbw4cPq2vXrs3uKzU1tT1K9And\n+nXXn9+6R9uzt2v98vWqPFghZ3SEnMOd6jW8lyKiIzxdYqdGEAEAALDR5s2bdfDgQU2cOFH79u3T\nokWL3EFkzZo1SkpKUmVlpUpKSvT22297uNrOz+Hn0IgLR2jEhSPcyyorK/X6668rOTlZQUFBHqyu\nc+PRLAAAABs9++yzmjFjhowxuuaaa7R+/Xrt2bNH0r8fzdq5c6feeOMNZWRkqLq62sMV+56wsDCd\nc8452rp162nbxMTEKDY21j2mJykpSYWFhaqrq9O8efM0bNgwjRw5UomJiUpPT9e2bdsknTwWKCkp\nSTt2NL6rxBijhIQEJSYmKiEhQW+++aYt5+sp3BEBAACwSW1trZYuXaouXbpo8eLFkqS6ujplZmaq\nb9++TdpOmDBBdXV12rp1K49feUBiYqLeeOMNJSQkKCAg4JRtli1bpri4uCbLfvnLX6q6ulrr169X\nZGSkLMvSypUrtWPHDo0Y0XjXJS0tTcuWLTvlPrOzsxUWFqZVq1bpuuuuU2lpqfz9O+cle+c8KwAA\nAC/0xhtvaNiwYVq3bp172aeffqoZM2boz3/+c5O2+fn5qqioUExMjM1VQpIiIiLUt29fbdu2TYmJ\niS3apqCgQMuXL9d3332nyMjG948YY3TFFVe0+vgTJkxQZWWlSktL1aNHj1Zv3xEQRAAAAGyyaNEi\nTZ8+vcmyMWPGyOVyadeuXe4xIpZlybIsZWZmNrkITUtLa/LX8fz8fC1cuFCPPvqoSkpKNHPmTAUF\nBWnbtm1yOp22nVdnlZycrJUrV2rkyJGnvCuRnp7uHkPi7++vP/zhDxoyZEizkwwc+z1L0jnnnKPl\ny5ef1Gb58uWaOHFipw0hEkEEAADANqtWrTrl8q+//lqSdN99951228LCwlMuv+uuu3TXXXeddW04\nWVRUlHr06KGvvvrK/VjV8U58NOvVV19tsn7btm2aNm2aqqurNWnSJD366KOSzvxo1tixY1VRUaF9\n+/Y1eY9MZ8RgdQAAAOA0kpOTlZeXJ5fL1aK2BQUFKisrkySNGDFCeXl5mjt3rg4fPtyi42VnZ+vb\nb7/V/PnzlZGRoZqamrOq35sRRAAAAIDTiI6OltPp1M6dO5ttO2TIEE2ZMkU33XRTk+BRVVXV6uPe\ncccd6tmzp5566qlWb9tREEQAAACAMzh2V8SyrCbL09PTm0zDm5OTo8zMTMXGxio1NVUjR47UuHHj\ntHHjRs2dO7dVxzTG6JFHHtGCBQt05MiRtjwdr2FO/ELPJCUlxcrJyWnHcgC0hjFmo2VZKZ6uo7Xo\nSwDvQ38CnNmKFSuUkJCgQYMGeboUr9fS/oQ7IgAAAEAzjt0VQdshiAAAAHgpy7JUV3dUltX8QGm0\nrwEDBsjlcmn37t2eLqXTYPpeAAAAL1N6aJ/Wf/ovfbnlEzU0NMgYo8FDknX+2Mnq3Wewp8vzScYY\nJSUlKTc3V/379/d0OZ0Cd0QAAAC8SOE3+cpc+Cdt2fSx6uvrZFkuuVwNKtixUS8vuV+bcjv3uyW8\n2eDBg1VdXa3vv//e06V0CgQRAAAAL1FRfkgrlv236k/5OJal+vpaffDuEu3dU+CR+nzd8XdFcPYI\nIgAAAF4id+N7zb44r76+Vp998oZNFeFEQ4cOVWlpqUpKSlq8jWVZKm2oU3H9UR1uqDtpGmBfxRgR\nAAAAL7E1P0sNDXXNtvv2681yuRrkcPjZUBWO53A4lJiYqNzcXF1yySVnbGtZlr6tPaLttVWqsywZ\nSZYsdTEOjegSpgGBwfYU7aW4IwIAAOAlao+2/MV1tbU17VgJziQ2Nlb79+9XaWnpadtYlqXcmgrl\nH61QjeVSgyzVy1KDpGrLpdyacm2rqbSvaC9EEAEAAPASQcFhLWtojAJ9/K/pnuTv76/4+Pgzvldk\nX32tdtcdUcNp1jdIKqit0qH65u+AdVYEEQAAAC+RmDxR/v4BZ2xjjNGw2PPkcHAZ50kjRozQ7t27\nVV5efsr1X9VWnTaEHHMsjPgq/gcDAAB4iYTkifLzO3MQkRxKHX2lLfXg9AIDAzV8+HBt2rTJvSwm\nJkaxsbFKTEzUDaljtW7ZCm3J+kR/uOjfY0kKNn6hm4YnK2f1u5Kk/fW1ttfuLQgiAAAAXiIkJFzX\nTbtbXboEy++EOyOWJbksKTg8VsUlp/4rPOwVHx+vb775RlVV/76rsWzZMuXm5Wnu04/riTm3q+Lg\nIfe6/LXrtGD6r3T7M08o5bLGcOKS786gRRABAADwIr36DNJvfv93jbngaoWFR8nfP1D+/kEKDO6j\nwj1BqqhyaMOGDaqs9O2Bzt4gKChIQ4cOVX5+fpPlDmMUm5SgoLBQ7d9VJEnasOpdPfa7W/UfSzM1\nctxYd9sQH575jOl7AQAAvExIqFNjxl2tMeOuliRVV1fr1VdfVUz9fhUUFCgiIkLZ2dnNTh+L9peQ\nkKBly5YpKSmpyfKS7BzVHT2q3oMH6ftvvtWjN92sv773lgYMj3W38ZP0k4AQmyv2HgQRAAAALxcS\nEqLzzjtP69atk9PpVFFRkfz8/LRr1y4NHDjQ0+X5tNDQUJ1zzjnasmWLJCk9PV1BQUEKczr1pyWL\n5PL3U2TPngp1huvdRYv1m4f/KkkykroYh0+/S4RHswAAADqA4cOHKzo6WoMGDdK+fftUVVWljRs3\nerosSEpKStK2bdskNY4RycvL07qPP9btV/1cXYxDwSEhunf5KyrI+UIL7/yT/GQU5vDTRaFR8jfG\nw9V7DkEEAACgAzDG6MILL1SXLl00cOBAVVdXa9KkSZ4uC5KcTqf69eun2tqmM2CFOfx1XnCEQv38\nFdFg6cHXlqrwizy9efc8pYV2U7APjw+RCCIAAAAdRrdu3TR69GjddNNNGjlypHbt2uXpkvCDpKQk\n1dXVqa6uTvv27XMvN8YowBi58rbpgpCuyl7zvjZ/vkFz5871YLXegTEiAAAAHUh8fLykxhmb3n77\nbQ0cOFDBwb47zsBbOJ1OPfDAA3rvvfcUFRWljIwMhYWFacKECcrJydELL7ygsLAwhYWFacOGDZ4u\n1ytwRwQAAKAD6tatm4YOHarPPvvM06VA0sqVK1VeXq6vvvpK9fX12rx5s3udy+VSTU2NQkJ8d4as\nUyGIAAAAdFDnnnuuvv/+e+3du9fTpfi8oUOHyul0Kjg4WMXFxdq+fbuOHDkiSaqqqlJISIgcDi69\nj8e3AQAA0EEFBAToggsuUFZWlhoaGjxdjk8bMmSIQkND1b9/f+3evVt1dXXuKX0rKysVFhbm4Qq9\nD0EEAACgAxs4cKC6du2qTZs2eboUn+bn56fExERFRkYqICBABw4c0NatW1VbW0sQOQ2CCAAAQAc3\nduxYbdmyRYcPH/Z0KT4tNjZWQUFBGjBggHbv3q3a2lpt3bqVIHIaBBEAAACbGGNUWVnZ5vsNCwtT\nUlKS1q1bJ0maN2+e7rzzzjY/zvFmzpypxx9/vNl2mZmZ+uqrr9yf33zzTd11113tWZrH+Pv7Kz4+\nXlFRUTKWUciOANX/47CCnqlX1PtBqvvuqKdL9CpM3wsAANAJxMXFqaCgQDt37myT/dXX18vf/+wv\nFTMzM9W9e3cNHTpUkjR58mRNnjz5rPfrrUaOHKmvP/xKt++dJUe9URcrsHHFLkvff7pDwec71f2u\nATKB3A/gGwAAAGhDxhjdd999SkpK0rBhw/T66683Wf/YY48pNTVVgwYNarJu9erVSk5OVkJCgn72\ns5+5A8WOHTs0ZswYJSYmKi4uTo888oikxrse1113nSZOnKjY2FhNnTpViYmJ+uyzz1RfX689e/bo\n8ssvV2xsrK644gpVV1dLahw4PWvWLMXFxSkuLk4LFixw1zBhwgTdfvvtGj16tCZPnqw5c+bo4Ycf\ndq/Pzc3VsGHDZFlWk3N6//33NWbMGCUnJys+Pl4vv/yyJOm5555TTk6O5s6dq6SkJK1Zs0aZmZlK\nT093b/vQQw+5a5k1a5b7jtG8efN0/fXXn/IcvJkptpTy0TAF13X5dwiRpAZJtZaOrC9XyQOFJ32H\nvoggAgAA0Mb8/PyUl5enN998U7Nnz1ZxcbF7ndPp1IYNG7RkyRL327WLi4t1ww036MUXX9TmzZs1\nbdo0TZ8+XZL05JNPavLkydq0aZO2bNmiX//61+59ZWVl6aWXXtL27dsVERGhp556SjExMdq7d69y\ncnK0dOlSffnll6qrq9OLL74oSZo/f75cLpfy8/OVnZ2t559/XqtWrXLv85tvvtG6deu0cuVK3XLL\nLXr66afdF82PP/64br75ZhljmpzvqFGjtG7dOuXm5mrNmjW68847VVpaqlmzZiklJUWPPfaY8vLy\nlJaW1mS7VatWacmSJcrOzlZ+fr4aGho0f/589/rTnYM3K8v8Xo46c/oGtZaObqpU7VdH7CvKSxFE\nAAAA2tixsDBs2DCNGjWqyUsHMzIyJEmjR4/W3r17VVNTo/Xr1ysxMVEjRoyQJM2aNUt5eXmqqKjQ\n+PHjtXDhQt1777364IMPFBkZ6d7XlVdeqZ49e7qP+cEHH+i8885TWVmZxo8fr8jISBljdP755+vr\nr7+WJK1Zs0Y33XSTjDFyOp26/vrrtWbNGvc+p02b5n4ka/jw4Ro0aJBWr16t0tJSvfnmm5o5c+ZJ\n51tSUqL09HTFxcXp0ksv1aFDh7Rjx45mv6c1a9YoIyNDTqdTxhjNnj27SS2XXnrpKc/BW7kqG3Rk\nfbnUzM0O66ilin+W2FOUFyOIAAAA2CgoKEhS410TqXEsxplce+21ysrK0uDBg/Xggw/qhhtuOGP7\nwMBA9evXTyUlJXK5XO5jNXecY06c3Wnu3Ll68skntWjRIl1zzTWKiIg4aZvf//73mjBhgvLz85WX\nl6d+/fqppqamRcc7k2PfldS6c/CU+v21MgFnuBtyjCXVFXJHhCACAADQxp577jlJUkFBgXJzczV6\n9Ogzth89erQ2bdqk7du3S5Kef/55JScnKzw8XDt37lSvXr00c+ZM3Xffffr888/d27399tsqKSlx\nH3PixImSpKioKPn7+7tfqHe8tLQ0Pfvss7IsSxUVFXr55Zd18cUXn7a2yy+/XDt27NDf//53zZkz\n55RtysrKFBMTI2OM3nvvvSYD5p1O52mnFU5LS9Mrr7yiiooKWZalhQsXnrEWb2f8jeRqYWP/FgSW\nTo5ZswAAANpYfX29kpOTVV1draefflrR0dFnbN+jRw8tWbJE06ZNU319vXr06KEXXnhBkvTqq6/q\nxRdfVGBgoIwxevTRR93bXXjhhcrIyNCePXs0YsQI/dd//Zd7Xd++fZWXl6dBgwY1Oda9996rW265\nRfHx8ZKkG264QZdddtlpa3M4HLrxxhu1atUqJSQknLLNgw8+qJtvvln33XefUlNTm7SbPXu27rjj\nDj388MPugfbHTJo0SZs3b9aYMWMkSSkpKbrnnnvO+F15M/9+XWQCjKzmbgYFGgWPOfnOkq8xrRmx\nn5KSYuXk5LRjOQBawxiz0bKsFE/X0Vr0JYD3oT9pO8YYVVRUtPsL7ObNm6fKysqTLu6P98UXX+jA\ngQO65JJLzupYF198sWbPnq2pU6ee1X46u5qaGn254AtFrg+WX8MZHjwKNOqbOVx+UQH2FWejlvYn\nPJoFAADQSSUmJqqsrEyFhYU/avucnBwNHjxYERERuvbaa9u2uE5m586deu2111Q70U9B54TIBJ76\n0SvTxSjqlr6dNoS0Bo9mAQAAtCG73g8xb968Ztv4+flp3Lhx+uijj9S3b18FBLTu4jclJcXrZ6ry\ntKqqKmVlZamyslKXXXaZevToIVeqS2XPfq+qdw/9+8/+LsmvW4C6zu6j4POdHq3ZWxBEAAAAOrE+\nffqoT58+2rhxY7OD5n1BSx5pawnLsrR9+3Zt2LBBcXFxuuSSS+RwNKYORxeHom7uq8hf9dbRbVWy\nalzy7xWowEHBbXEKnQZBBAAAoJMbPXq0XnvtNQ0ZMkTdunXzdDkdXnl5uT7++GPV19frqquuUteu\nXU/ZzhHkUPCocJur6zgYIwIAANDJBQUFKTU1VVlZWbY9OtYWjDF64IEHlJqaqkGDBun999/X3Xff\nreTkZMXFxenLL790t33ooYcUFxenuLg4zZo1S5WVlZKkw4cPKz09XbGxsZowYcJZPWpmWZY2b96s\nFStWaODAgZoyZcppQwiaRxABAADwAcOGDZPD4Why8d4RREZGasOGDXrooYc0ZcoUXXDBBcrNzdWM\nGTP0wAMPSJJWrVqlJUuWKDs7W/n5+WpoaND8+fMlSX/5y1/kdDq1fft2LVu2TGvXrv1RdRw6dEgr\nVqxQUVGRrr76asXHx8sY3gVyNng0CwAAwAcYYzRu3Di989YyDW74RIFF/5RqDkkBodLAq6QhGTIh\nvT1d5kl+8YtfSJJGjRolY4yuvPJKSdK5556rf/7zn5KkNWvWKCMjQ05n4yDw2bNn67bbbpMkffjh\nh/qf//kfSVL37t11zTXXtOr4LpdLubm52rp1q8477zzFxsa2yXmBIAIAAOAzujoO6NrgZ+XYViup\nrnFhfZX01RKpYKmssY/I9LnIozWeKCgoSFLjDGBdunRxL/fz81N9fX27HrukpERr165VWFiYrr32\nWoWGhrbr8XwNj2YBAAD4AKu2XPpwlvxdVfI7FkKOcdVKDUek7DtklRV4psCzkJaWpldeeUUVFRWy\nLEsLFy7UxRdfLEmaOHGinnvuOUnSwYMHtXz58mb3V19fr88++0yrV69WUlKSLrvsMkJIOyCIAAAA\n+IJvV0gNR3XGUQ2uWunLZ+yqqM1MmjRJv/zlLzVmzBjFx8dLku655x5J0r333qvS0lLFxsbq2muv\n1fjx48+4r71792rZsmWqrq7W1KlT9ZOf/KTd6/dVpjUzJ6SkpFg5OTntWA6A1jDGbLQsK8XTdbQW\nfQngfehPOj/r7culyqJm27mMvw5PfFddu/XwqcHYtbW1Wr9+vYqKijRu3DgNHDjQ0yV1WC3tTxgj\nAgAA4AuOlraomctl6V/LX5LL36kePXooOjpa0dHR6tmzp4KDO+cL+YqKipSVlaX+/ftr6tSpCgwM\n9HRJPoEgAgAA4Av8Q6W6imabGatBW7Z/q5CwCB06dEjfffed+43h4eHhSk1N7TSPK9XU1Cg7O1vF\nxcX66U9/qj59+ni6JJ9CEAEAAPAFMZOlHZmN40BOw7Kk72r7KjwiShUVFdq3b59qamoUGhoqp9Op\n8PBwJSQk2FdzO/r666+VnZ2tIUOGKD09Xf7+XBbbjW8cAADAF/zkF43T9J6ByxGo/d0mK8aEq6am\nRpLU0NCgiooKVVRUqLi4WJ9++qlyc3Pdj2tFR0erR48eXn0h39DQoF27dmnQoEGqrq5WVlaWysvL\ndemllyo6OtrT5fks7/0fAwAAgDZjQnrKuuC/pU9ub7wrYrmaNvALkl/crTo/9kadL6m8vFzFxcUq\nLi7W/v37dfDgQYWEhGjatGnuULJ//36tX79ehw4dUkREhDuYREdHKyIiwisGu+/bt09r167V4cOH\nNXToUBUVFWnEiBFKS0uTn58zX/qyAAAEtUlEQVSfp8vzaQQRAAAAH2F6j5N1ySvStoXS7nckWY2B\npOdoacRsmR7nuts6nU45nU73eJD6+npVVVVJahwrEh4ersGDB0tqvONw8OBBFRcXa/fu3dq4caNq\na2vdoeTYz/EvJGxvdXV1+vzzz7V161YdOXJEBQUF+vLLL/XHP/5RPXv2tK0OnB5BBAAAwIcY52Bp\n9N9knTe/8a3qfiEyfgHNbufv76+IiIhTrvPz83OHjbi4OElSdXW1+47Kpk2bVFJSotDQ0CbBJCoq\nyj0QvrWO1NdodVGWXv1mtYqPHJSf8dO5PUZq2k+uVNcjIfr4449VUVGhvXv3qqioSP369VPfvn1V\nVFREEPESBBEAAAAfZBz+UuCpg0VbCAkJUUxMjGJiYiRJlmWptLRU+/fvV3FxsbZs2aKqqip17969\nyXiTkJCQZvd9oKZUc7L+otKjh1XT0Dj4vk71yt6Xq8/3bdbQqt4auj9aBQUFMsYoKSlJwcHBGj58\nuBITE9vtnNE6BBEAAAC0O2OMoqKiFBUVpeHDh0tqfIngsbsm27dv19q1axUQENDk3SXdu3dvMpbD\nsiz97+wHVXzkoBpOGOdiyVKd6vVl0HcqLt2j+OhB6t27tyIiIjR+/Him5/UyBBEAAAB4RGBgoPr1\n66d+/fq5l5WXl7vvmuzcuVNlZWXq2rWr+47JvoBS7a8+cFIIOZ7Lz1JVYoD6HOqjhPgEpaSkePWs\nXr6K3wgAAAC8xrFB8kOGDJHUOEj+wIEDKi4uVmFhoV4se0dH/I9KzUzIVefXoMS0VJ1/TrINVePH\nIIgAAADAa/n7+6tXr17q1auXJGlF1qfSoe+b3S4wIFAmlOl5vdmPm6YAAAAA8ICooJYNsHdZlpwB\nYe1cDc4GQQQAAAAdxhUDLlKwX1Cz7UL8gzQ0Mqb9C8KPRhABAABAh5EaHa+uXZxynGGQSJBfF80Y\ndrUchktdb8ZvBwAAAB2Gwzj03xfcrcguTgU6Tn4RY5BfF13a7wJdHfMzD1SH1mCwOgAAADqU3iE9\ntGTiAq0oXKNl37yjsqPlkowSug3T9CFX6fzoBBnTzLRa8DiCCAAAADqc8MBQ3TB0im4YOkUNlksO\nGcJHB0MQAQAAQIfmx1iQDonfGgAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQA\nAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1B\nBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACw\nHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAA\nALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsZy7Ja3tiYEkm72q8cAK000LKsHp4uorXo\nSwCvRH8CoK20qD9pVRABAAAAgLbAo1kAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADA\ndgQRAAAAALYjiAAAAACwHUEEAAAAgO0IIgAAAABs9/8B6iB2qKdKJpkAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Rule that merges two EGFR nodes from the action graph\n",
    "rule3 = Rule.from_transform(nx.DiGraph())\n",
    "rule3.inject_add_nodes_from([\n",
    "    (\"EGFR\", {\"uniprotid\": \"P00533\", \"hgnc_symbol\": \"EGFR\"}),\n",
    "    (\"PK\", {\"name\": \"Protein kinase\"}),\n",
    "    (\"activity\", {\"name\": \"activity\", \"test\": True}),\n",
    "    (\"mod\", {\"value\": True}),\n",
    "    (\"phosphorylation\", {\"name\": \"phosphorylation\", \"test\": False}),\n",
    "    (\"ABL1\", {\"uniprotid\": \"P00519\", \"hgnc_symbol\": \"ABL1\"})\n",
    "])\n",
    "rule3.inject_add_edges_from([\n",
    "    (\"PK\", \"EGFR\", {\"start\": 300, \"end\": 500}),\n",
    "    (\"activity\", \"PK\"),\n",
    "    (\"PK\", \"mod\"),\n",
    "    (\"mod\", \"phosphorylation\"),\n",
    "    (\"phosphorylation\", \"ABL1\")\n",
    "])\n",
    "plot_rule(rule3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'action_graph': {'EGFR': '101', 'PK': '66'}, 'meta_model': {'activity': 'state', 'mod': 'mod', 'phosphorylation': 'state', 'ABL1': 'gene'}}\n"
     ]
    }
   ],
   "source": [
    "action_graph_PK = h.node_type(\"nugget_1\", rhs_g1[\"PK\"])[\"action_graph\"]\n",
    "\n",
    "rhs_typing3 = {\n",
    "    \"action_graph\": {\n",
    "        \"EGFR\": action_graph_EGFR,\n",
    "        \"PK\": action_graph_PK\n",
    "    },\n",
    "    \"meta_model\": {\n",
    "        \"activity\": \"state\",\n",
    "        \"mod\": \"mod\",\n",
    "        \"phosphorylation\": \"state\",\n",
    "        \"ABL1\": \"gene\"\n",
    "    }\n",
    "}\n",
    "print(rhs_typing3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Empty instance \n",
      "\n",
      "// Adding node 'PK' from the rhs \n",
      "CREATE (rhs_PK:nugget_2) \n",
      "SET rhs_PK.id = toString(id(rhs_PK)) \n",
      "WITH toString(id(rhs_PK)) as rhs_PK_id , rhs_PK\n",
      "\n",
      "\n",
      "// Adding node 'ABL1' from the rhs \n",
      "CREATE (rhs_ABL1:nugget_2) \n",
      "SET rhs_ABL1.id = toString(id(rhs_ABL1)) \n",
      "WITH toString(id(rhs_ABL1)) as rhs_ABL1_id , rhs_PK_id, rhs_PK, rhs_ABL1\n",
      "\n",
      "\n",
      "// Adding node 'phosphorylation' from the rhs \n",
      "CREATE (rhs_phosphorylation:nugget_2) \n",
      "SET rhs_phosphorylation.id = toString(id(rhs_phosphorylation)) \n",
      "WITH toString(id(rhs_phosphorylation)) as rhs_phosphorylation_id , rhs_PK_id, rhs_ABL1_id, rhs_phosphorylation, rhs_PK, rhs_ABL1\n",
      "\n",
      "\n",
      "// Adding node 'activity' from the rhs \n",
      "CREATE (rhs_activity:nugget_2) \n",
      "SET rhs_activity.id = toString(id(rhs_activity)) \n",
      "WITH toString(id(rhs_activity)) as rhs_activity_id , rhs_PK_id, rhs_ABL1_id, rhs_phosphorylation_id, rhs_phosphorylation, rhs_PK, rhs_activity, rhs_ABL1\n",
      "\n",
      "\n",
      "// Adding node 'EGFR' from the rhs \n",
      "CREATE (rhs_EGFR:nugget_2) \n",
      "SET rhs_EGFR.id = toString(id(rhs_EGFR)) \n",
      "WITH toString(id(rhs_EGFR)) as rhs_EGFR_id , rhs_PK_id, rhs_ABL1_id, rhs_phosphorylation_id, rhs_phosphorylation, rhs_PK, rhs_activity, rhs_EGFR, rhs_ABL1, rhs_activity_id\n",
      "\n",
      "\n",
      "// Adding node 'mod' from the rhs \n",
      "CREATE (rhs_mod:nugget_2) \n",
      "SET rhs_mod.id = toString(id(rhs_mod)) \n",
      "WITH toString(id(rhs_mod)) as rhs_mod_id , rhs_PK_id, rhs_ABL1_id, rhs_phosphorylation_id, rhs_phosphorylation, rhs_PK, rhs_activity, rhs_EGFR, rhs_mod, rhs_ABL1, rhs_activity_id, rhs_EGFR_id\n",
      "\n",
      "\n",
      "// Adding properties to the node 'EGFR' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'uniprotid' IN keys(rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tSET rhs_EGFR.uniprotid = ['P00533'])\n",
      "FOREACH(dummy IN CASE WHEN 'uniprotid' IN keys(rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['P00533'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_EGFR.uniprotid THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_EGFR.uniprotid = rhs_EGFR.uniprotid + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'hgnc_symbol' IN keys(rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tSET rhs_EGFR.hgnc_symbol = ['EGFR'])\n",
      "FOREACH(dummy IN CASE WHEN 'hgnc_symbol' IN keys(rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['EGFR'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_EGFR.hgnc_symbol THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_EGFR.hgnc_symbol = rhs_EGFR.hgnc_symbol + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'PK' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_PK) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK.name = ['Protein kinase'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_PK) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Protein kinase'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK.name = rhs_PK.name + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'activity' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_activity) THEN [1] ELSE [] END |\n",
      "\tSET rhs_activity.name = ['activity'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_activity) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['activity'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_activity.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_activity.name = rhs_activity.name + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'test' IN keys(rhs_activity) THEN [1] ELSE [] END |\n",
      "\tSET rhs_activity.test = [True])\n",
      "FOREACH(dummy IN CASE WHEN 'test' IN keys(rhs_activity) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [True] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_activity.test THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_activity.test = rhs_activity.test + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'mod' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'value' IN keys(rhs_mod) THEN [1] ELSE [] END |\n",
      "\tSET rhs_mod.value = [True])\n",
      "FOREACH(dummy IN CASE WHEN 'value' IN keys(rhs_mod) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [True] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_mod.value THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_mod.value = rhs_mod.value + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'phosphorylation' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tSET rhs_phosphorylation.name = ['phosphorylation'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['phosphorylation'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_phosphorylation.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_phosphorylation.name = rhs_phosphorylation.name + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'test' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tSET rhs_phosphorylation.test = [False])\n",
      "FOREACH(dummy IN CASE WHEN 'test' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [False] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_phosphorylation.test THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_phosphorylation.test = rhs_phosphorylation.test + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'ABL1' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'uniprotid' IN keys(rhs_ABL1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_ABL1.uniprotid = ['P00519'])\n",
      "FOREACH(dummy IN CASE WHEN 'uniprotid' IN keys(rhs_ABL1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['P00519'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_ABL1.uniprotid THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_ABL1.uniprotid = rhs_ABL1.uniprotid + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'hgnc_symbol' IN keys(rhs_ABL1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_ABL1.hgnc_symbol = ['ABL1'])\n",
      "FOREACH(dummy IN CASE WHEN 'hgnc_symbol' IN keys(rhs_ABL1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['ABL1'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_ABL1.hgnc_symbol THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_ABL1.hgnc_symbol = rhs_ABL1.hgnc_symbol + [val])))\n",
      "\n",
      "\n",
      "// Adding edge 'PK->EGFR' from the rhs \n",
      "MERGE (rhs_PK)-[rhs_PK_rhs_EGFR:edge]->(rhs_EGFR)\n",
      "\n",
      "\n",
      "// Adding edge 'phosphorylation->ABL1' from the rhs \n",
      "MERGE (rhs_phosphorylation)-[rhs_phosphorylation_rhs_ABL1:edge]->(rhs_ABL1)\n",
      "\n",
      "\n",
      "// Adding edge 'activity->PK' from the rhs \n",
      "MERGE (rhs_activity)-[rhs_activity_rhs_PK:edge]->(rhs_PK)\n",
      "\n",
      "\n",
      "// Adding edge 'mod->phosphorylation' from the rhs \n",
      "MERGE (rhs_mod)-[rhs_mod_rhs_phosphorylation:edge]->(rhs_phosphorylation)\n",
      "\n",
      "\n",
      "// Adding edge 'PK->mod' from the rhs \n",
      "MERGE (rhs_PK)-[rhs_PK_rhs_mod:edge]->(rhs_mod)\n",
      "\n",
      "\n",
      "// Adding properties to an edge 'PK'->'EGFR' from the rhs \n",
      "WITH rhs_PK_id, rhs_ABL1_id, rhs_phosphorylation_id, rhs_phosphorylation, rhs_PK, rhs_PK_rhs_EGFR, rhs_activity, rhs_mod_id, rhs_EGFR, rhs_mod, rhs_ABL1, rhs_activity_id, rhs_EGFR_id \n",
      "FOREACH(dummy IN CASE WHEN NOT 'start' IN keys(rhs_PK_rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK_rhs_EGFR.start = [300])\n",
      "FOREACH(dummy IN CASE WHEN 'start' IN keys(rhs_PK_rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [300] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK_rhs_EGFR.start THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK_rhs_EGFR.start = rhs_PK_rhs_EGFR.start + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'end' IN keys(rhs_PK_rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK_rhs_EGFR.end = [500])\n",
      "FOREACH(dummy IN CASE WHEN 'end' IN keys(rhs_PK_rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [500] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK_rhs_EGFR.end THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK_rhs_EGFR.end = rhs_PK_rhs_EGFR.end + [val])))\n",
      "WITH rhs_PK_id, rhs_ABL1_id, rhs_phosphorylation_id, rhs_phosphorylation, rhs_PK, rhs_PK_rhs_EGFR, rhs_activity, rhs_mod_id, rhs_EGFR, rhs_mod, rhs_ABL1, rhs_activity_id, rhs_EGFR_id \n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_PK_id, rhs_ABL1_id, rhs_phosphorylation_id, rhs_phosphorylation, rhs_PK, rhs_PK_rhs_EGFR, rhs_activity, rhs_mod_id, rhs_EGFR, rhs_mod, rhs_ABL1, rhs_activity_id, rhs_EGFR_id\n",
      "\n",
      "// Checking consistency of introduced rhs\n",
      "MATCH (G:hierarchyNode)\n",
      "WHERE G.id = 'nugget_2'\n",
      "OPTIONAL MATCH (t_i:hierarchyNode)\n",
      "WHERE (t_i)<-[:hierarchyEdge*1..]-(G)-[:hierarchyEdge*1..]->(t_i)\n",
      "WITH DISTINCT t_i\n",
      "RETURN collect(t_i.id)\n",
      "\n",
      "// Replacing ':tmp_typing' with ':typing'\n",
      "MATCH (n:nugget_2)-[t:tmp_typing]->(m)\n",
      "OPTIONAL MATCH (:hierarchyNode {id: 'nugget_2'})-[skeleton_rel:hierarchyEdge]->(:hierarchyNode {id: labels(m)[0]}) \n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [] ELSE [1] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:typing]->(m)\n",
      ")\n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [1] ELSE [] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:transitive_typing]->(m)\n",
      ")\n",
      "\n",
      "// Addition of nodes and properties in 'action_graph'\n",
      "MATCH (n:nugget_2)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:action_graph)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:nugget_2)-[trans_type:transitive_typing]->(successor_node:action_graph)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:action_graph)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, node_img, nodes_to_merge_props\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, node_img, nodes_to_merge_props\n",
      "SET node_img += new_props\n",
      "\n",
      "\n",
      "// Addition of edges and properties in 'action_graph'\n",
      "MATCH (n:nugget_2)-[rel:edge]->(m:nugget_2), (n)-[:typing]->(x:action_graph), (m)-[:typing]->(y:action_graph)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, y, rel_img, x\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, y, rel_img, x\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, y, rel_img, x\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, y, rel_img, x\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, y, edges_to_merge_props, rel_img, x\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, y, edges_to_merge_props, rel_img, x\n",
      "SET rel_img += new_props\n",
      "\n",
      "// Addition of nodes and properties in 'meta_model'\n",
      "MATCH (n:action_graph)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:meta_model)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:nugget_2)-[trans_type:transitive_typing]->(successor_node:meta_model)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:meta_model)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, node_img, nodes_to_merge_props\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, node_img, nodes_to_merge_props\n",
      "SET node_img += new_props\n",
      "\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "// Addition of edges and properties in 'meta_model'\n",
      "MATCH (n:action_graph)-[rel:edge]->(m:action_graph), (n)-[:typing]->(x:meta_model), (m)-[:typing]->(y:meta_model)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, y, rel_img, x\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, y, rel_img, x\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, y, rel_img, x\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, y, rel_img, x\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, y, edges_to_merge_props, rel_img, x\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, y, edges_to_merge_props, rel_img, x\n",
      "SET rel_img += new_props\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g3 = h.rewrite(\"nugget_2\", rule3, {}, rhs_typing=rhs_typing3)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5) Merge two modification actions of a protein kinase region in the action graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAFLFJREFUeJzt3X9w1PWdx/HXZzdhkwCBYoggwQBB\nyUmIIYQpCGKKIANF4CI9mGq5gpVrO9JpT6zgAEeh6GSmTju9djoqA1pwHK4UsN6IcqEQ7DkyEEIB\nAYdERdIWCDnFAPm1u5/7gx+DoGTTZj/f/bLPx0xm3N3P7r7WmX3zfe1+dtdYawUAAAAALgW8DgAA\nAAAg+VBEAAAAADhHEQEAAADgHEUEAAAAgHMUEQAAAADOUUQAAAAAOEcRAQAAAOAcReQmYoz5yBgz\n4ZrzSo0xdV+wdqcx5jtXnX7aGPOhMeacMabOGLPBRWYA/nRp3jRdmhmnjDEvGWO6eZ0LQGK5Zlac\nvHpWXPrvn16zfoAxxhpjUi6dzjHG/N4Yc8YYc9YYc8gY820PHgrigCICGWP+VdK3JE2w1naTVCJp\nu7epAPjAg5dmRrEuzo0lHucBkJguz4oiScMlLe7AdddJOiEpV9Ituni8cqrTE8ITKV4HQEIYKekt\na22tJFlrT0p6wdtIAPzCWvsXY8xWSQVeZwGQuKy1J40xb+liIYnVSEk/staev3S6uvOTwSu8IwJJ\nelfSHGPMk8aYEmNM0OtAAPzDGNNf0hRxgADgBowxOZImS6rpwNXelfRrY8xsY8zt8UkGr1BEksNt\nxphPr/6TNPbyhdba9ZIWSJokqVLSaWPMUx5lBeAfWy7Nkz/p4ux4xuM8ABLTFmNMoy5usTot6T+u\numzhNccnB6657jckvS1pqaQPjTH7jTEjnaRG3FFEksNfrbU9r/7TxQOHK6y1r1hrJ0jqKem7klYa\nYyZ5ERaAb8y4NFNyrbXft9Y2eR0IQEKaYa3tLqlUUr6krKsu+9k1xyeFV1/RWvuJtXaRtXaopFsl\n7dfFYmMcZUccUUTwOdbaNmvt73TxFQn2ewMAgE5hra2U9JKkn/2d1z9z6bq3SerVecngFYrIzSfV\nGJN2+U8xfCGBMebbxpivG2O6G2MCxpjJkoZK2h33tAAAIJn8QtJEY8zdsSw2xpQbYwqMMSnGmO6S\nviepxlrbENeUcIJvzbr5vHHN6f+N4TqfSXpa0npJQUnHJX3PWvunG14LAACgA6y19caY30paJqkx\nhqtkSNosqa+kJl18kXRa/BLCJWOt9ToDAAAAgCTD1iwAAAAAzlFEAAAAADhHEQEAAADgHEUEAAAA\ngHMd+tasrKwsO2DAgDhFAdBRVVVVZ6y1vb3O0VHMEiDxME8AdJZY50mHisiAAQO0d+/evz8VgE5l\njDnudYa/B7MESDzMEwCdJdZ5wtYsAAAAAM5RRAAAAAA4RxEBAAAA4BxFBAAAAIBzFBEAAAAAzlFE\nAAAAADhHEQEAAADgHEUEAAAAgHMUEQAAAADOUUQAAAAAOEcRAQAAAOAcRQQAAACAcxQRAAAAAM5R\nRAAAAAA4RxEBAAAA4BxFBAAAAIBzFBEAAAAAzlFEAAAAADhHEQEAAADgHEWkHcuXL9fChQtvuGbh\nwoUaOHCgjDE6dOiQo2QA/IRZAiQnPz33jTE6d+7cl17+4osvqrCwUMOGDVNhYaHWr1/vMB1uRhSR\nTjBjxgzt2rVLubm5XkcB4GPMEiA5+eW5f8cdd2jnzp06ePCg3njjDf3whz/URx995HUs+NhNVUSM\nMVq1apVGjhypQYMGafv27Vq8eLGGDx+ugoICHTly5Mra8vJyFRQUqKCgQHPnzr3yCsDZs2c1c+ZM\n5efnq7S0VLW1te3e79ixY9W/f/+4PS4AbjFLgOTkl+f+8uXLNXv2bE2ZMkWDBw/WrFmzVF1drfHj\nxysvL09PPvnklbU1NTW6//77VVhYqOLiYr355ptXLtu0aZPy8/NVVFSklStXtnu/paWl6tWrlyQp\nJydHffv2VV1dXcy5gWvdVEVEknr27Kk9e/aovLxc06dP15gxY1RdXa05c+Zo1apVkqStW7dq3bp1\neuedd3Tw4EFFIpErT8AVK1YoMzNTR48e1caNG1VZWenlwwHgEWYJkJz88tyvqqrSq6++qvfff19H\njx7VokWLtHXrVh04cEAvv/yyjh07Jkl6+OGH9c1vflMHDhzQ+vXr9cgjj6i+vl6nTp3SY489ptde\ne0379+9XKBTq0P3v3LlTn376qUaMGBGPh4ckcdMVkVmzZkmSiouLZYzR1KlTJUkjRoxQTU2NJKmi\nokKzZ89WZmamjDGaP3++KioqJEk7duzQo48+KknKyspSWVmZB48CgNeYJUBy8stzf9KkSerRo4eC\nwaAKCws1ceJEhUIhde3aVUOGDFFtba0aGxu1f/9+zZ07V5J01113qaioSO+++652796t4uJiDRky\nRJI0f/78mO/78OHDmjNnjl599VWlp6fH5fEhOdx0RSQtLU2SFAwGP9fug8GgwuGwV7EA+AyzBEhO\nfnnuX84pXcx27el4ZT127JimTJmi559/XmPHjo3LfSB53HRFJBYTJkzQhg0b1NjYKGutVq9erYkT\nJ0qSxo8fr7Vr10qSGhoatHnzZi+jAkhgzBIgOfnlud+9e3cVFRXp5ZdfliQdOXJEf/7znzVq1CiN\nGjVK1dXVV7ZwrV69ut3b++CDDzRp0iT98pe/1OTJk+OaHckhKYvI5MmT9cgjj2j06NEaNmyYJGnJ\nkiWSpKVLl+qTTz5Rfn6+HnroIY0bN67d2/vBD36gnJwc1dXVacKECRo6dGhc8wNIDMwSIDn56bn/\nyiuvaP369SosLNTDDz+sdevWqXfv3srOztYLL7ygBx98UMOHD1dzc3O7t/XUU0+poaFBy5YtU1FR\nkYqKivTWW291WlYkH2OtjXlxSUmJ3bt3bxzjAOgIY0yVtbbE6xwdxSwBEg/zBEBniXWeJOU7IgAA\nAAC8leJ1AL9YsWKFNm3adN3527ZtU3Z2tgeJAPgRswRITh197p8+fVoPPPDAdeeXlZVp2bJlccno\n5f0iObE1C/AxtlIA6CzMEwCdha1ZAAAAABIWRQQAAACAc3xGRJK1Vsf2f6z3dtcqHI6o/x19VDL+\nLqWkBr2OBsBn2lrDqvrjYZ2oOaWUlKCGfjVPdxTdLmOM19EAAEgoSV9EPjr6Vz23YJ3+7+RZtbWG\nFY1GlZYRUiBgNG/ZDJX+s++2ywLwyM5Ne7Vm5RZFo1bNF1oUCASU2iVFvfr00BP/+S0NyL/N64gA\nfOTk8TP6w5pKvb1ln5ovtCgtI6R7ZxRr2rz71Cc3y+t4wD8sqbdmnTh2Uktm/Vp/+7BeLU2tikai\nkpWaz7foQmOzXlj6e1Vs2O11TAA+ULFht15Y9ntdaGxW8/kWyUrRSFQtTa3624f1WjLr1zpx7KTX\nMQH4xL7KI3pi6nPavmG3ms63yFqp6XyLtm/YrSemPqd9lUe8jgj8w5K6iDy/ZKNaLrR86eWtzW1a\ns3KLms61/2ujAJJX07lmrVm5Ra3NbV+6puVCi55fstFhKgB+dfL4GT33+G/V0tSmSDj6ucsi4aha\nmtr03OO/1cnjZzxKCHSOpC0ipz5uUO2hOrX37cUmYLTrtX1uQgHwpcotVe1+BsRaqfZQnU593OAo\nFQC/+sOaSoXbIjdcE26L6PU1uxwlAuIjaYtI7aG6mD6M3nKhVYf3fOAgEQC/OrLnQ7U0tba7LiU1\nqA/eq3OQCICfvb1l33XvhFwrEo7yQil8L2mLSEfwXTcAAMCV5htsG//cuvOxrQMSVdIWkcGF/dt9\n21OS0jK66K6v5jlIBMCvhn51kEIZXdpdF26LKG9YfweJAPhZWkYotnVdY1sHJKqkLSLZOb00uLC/\n2vtqf2ut7p1W7CYUAF+6d/oItfeBM2OM7rj7dmXn9HKUCoBf3TujWMGUGx+iBVMCGjed4xP4W9IW\nEUn67qpvKK1r6EvLSJe0VH1neZnSecUBwA2kdw3pO8vL1CUt9QsvN0ZK69pF//bTmY6TAfCjafPu\na/dzrCmpQT04b5yjREB8JHUR6TcoW8/81wLlDL5VofRUpaQGFQgGlNY1pG49M/T9Z/9FX3topNcx\nAfjA1x4aqe898w1165mh9K4hBYIBpaQGFUpPVc7gPnrmdwvUb1C21zEB+ECf3Cw98as5CqWnXvfO\nSDAloFB6qp741Rx+1BC+l/S/rN7/zj76+dYnVXuoTu+9W6NIJKr+g2/V8PvyFUxp/1u1AOCye6cV\n654pd6u68qhO1JxSMBhQwajBGlSQ43U0AD5TfN8/6bn/fkKvr9mlXa/tU/P5FqV1DWnc9GI9OG8c\nJQQ3haQvIpflFeQoj4MFAP+gYEpQJfcPVcn9Q72OAsDn+uRm6bGflOmxn5R5HQWIi6TemgUAAADA\nGxQRAAAAAM5RRAAAAAA4RxEBAAAA4BxFBAAAAIBzFBEAAAAAzlFEAAAAADhHEQEAAADgHEUEAAAA\ngHMUEQAAAADOUUQAAAAAOEcRAQAAAOAcRQQAAACAcxQRAAAAAM5RRAAAAAA4RxEBAAAA4BxFBAAA\nAIBzFBEAAAAAzlFEAAAAADhHEQEAAADgHEUEAAAAgHMUEQAAAADOUUQAAAAAOEcRAQAAAOAcRQQA\nAACAcxQRAAAAAM5RRAAAAAA4RxEBAAAA4BxFBAAAAIBzFBEAAAAAzlFEAAAAADhHEQEAAADgHEUE\nAAAAgHMUEQAAAADOUUQAAAAAOEcRAQAAAOAcRQQAAACAcxQRAAAAAM5RRAAAAAA4RxEBAAAA4BxF\nBAAAAIBzFBEAAAAAzlFEAAAAADhHEQEAAADgHEUEAAAAgHMUEQAAAADOUUQAAAAAOEcRAQAAAOAc\nRQQAAACAcxQRAAAAAM5RRAAAAAA4RxEBAAAA4BxFBAAAAIBzFBEAAAAAzlFEAAAAADhHEUlQy5cv\n18KFC7/08oaGBk2ZMkVDhgzRsGHDVFZWpvr6eocJAfgF8wQAkIgoIj5ljNGPf/xjvf/++zp48KDy\n8vK0aNEir2MB8CHmCQDACxSRTmCM0apVqzRy5EgNGjRI27dv1+LFizV8+HAVFBToyJEjV9aWl5er\noKBABQUFmjt3rs6dOydJOnv2rGbOnKn8/HyVlpaqtrb2hvfZq1cvlZaWXjk9atQoHT9+PC6PD4A7\nzBMAQLKgiHSSnj17as+ePSovL9f06dM1ZswYVVdXa86cOVq1apUkaevWrVq3bp3eeecdHTx4UJFI\nRCtXrpQkrVixQpmZmTp69Kg2btyoysrKmO87Go3qN7/5jaZNmxaXxwbALeYJACAZUEQ6yaxZsyRJ\nxcXFMsZo6tSpkqQRI0aopqZGklRRUaHZs2crMzNTxhjNnz9fFRUVkqQdO3bo0UcflSRlZWWprKws\n5vtesGCBunXrpscff7wzHxIAjzBPAADJIMXrADeLtLQ0SVIwGFQoFLpyfjAYVDgcjtv9Lly4UMeO\nHdPrr7+uQIBeCdwMmCcAgGTAvzQOTZgwQRs2bFBjY6OstVq9erUmTpwoSRo/frzWrl0r6eI32Gze\nvLnd23v66adVVVWlLVu2fO5gBcDNj3kCAPA73hFxaPLkyTpw4IBGjx4tSSopKdGSJUskSUuXLtW8\nefOUn5+vPn36aNy4cTe8rffee0/PPvus7rzzTt1zzz2SpIEDB8Z0wAHA/5gnAAC/M9bamBeXlJTY\nvXv3xjEOgI4wxlRZa0u8ztFRzBIg8TBPAHSWWOcJW7MAAAAAOMfWrAS3YsUKbdq06brzt23bpuzs\nbA8SAfAr5gkAIJGwNQvwMbZSAOgszBMAnYWtWQAAAAASFkUEAAAAgHN8RsRDFyJt+lPDX/XHMx/r\nbLhVKSaguzOzNLF3rnIzMr2OB8BHTrWc1//Uf6y9n55SSzSijGCq7u3VT6VZOeqZyu+CAAASD0XE\nI6dbLqi8Zq+aI2G12agkKWIj2vPpKe0/W6/pffI0MTvX45QA/GDvJyf10onDCtuoopfOawy3alv9\ncf3xzMf6UV6xBmb08DQjAADXYmuWB8LRqH5WW6Vz4dYrJeQyK6nVRvXayVod/OyMNwEB+MaJpkat\nPXFYrVeVkMvCNqrmaEQ/r92nxnCrJ/kAAPgyFBEPVJ89raZIWDf6vrJWG9UfTtY6ywTAn9449aHC\n9toK8nkRa/V2w18cJQIAIDYUEQ/sbKhTSzTS7rq/NJ/XJ23NDhIB8KOIjWr/Z/U3fFFDktpslCIC\nAEg4FBEPfBbjFokUY9TYxnYKAF+sOdL+CxqXnY+0xTEJAAAdRxHxQLdgakzrItaqa0qXOKcB4Feh\nYFCx/iZtepDvJgEAJBaKiAfG3dJPoUCw3XXZoXTd0iXNQSIAfpRiAirIvEWmnXWpJqAxX7nNSSYA\nAGJFEfFASc9b1cXc+H99FxPQtD55jhIB8Kuv3zpQqe3Mk4AxGpeV4ygRAACxoYh4IDUQ1L/njVBG\nMEUpX3AA0cUE9EB2rob3yPYgHQA/GZjRQ7P7DVEXE7junZGgjEKBoB4feDc/aggASDhsGvZIv/Ru\n+smQ0dpx5oR2NtTpQiSsgKS7ut+iSdkDNKTbV7yOCMAnxt7ST7end9eb9ce1/+xpha1VKBDU6K/0\n1cTet6t3KMPriAAAXIci4qEeqSHN6DtYM/oOVsRGFZCRMe3t9gaA692ekan5ucMkXfxa32A727UA\nAPAaRSRBcNAAoLMwTwAAfsC/VgAAAACco4gAAAAAcI4iAgAAAMA5iggAAAAA5ygiAAAAAJyjiAAA\nAABwjiICAAAAwDmKCAAAAADnKCIAAAAAnKOIAAAAAHCOIgIAAADAOYoIAAAAAOcoIgAAAACco4gA\nAAAAcI4iAgAAAMA5iggAAAAA5ygiAAAAAJyjiAAAAABwjiICAAAAwDmKCAAAAADnKCIAAAAAnKOI\nAAAAAHCOIgIAAADAOYoIAAAAAOcoIgAAAACco4gAAAAAcI4iAgAAAMA5iggAAAAA5ygiAAAAAJyj\niAAAAABwjiICAAAAwDmKCAAAAADnKCIAAAAAnDPW2tgXG1Mv6Xj84gDooFxrbW+vQ3QUswRISMwT\nAJ0lpnnSoSICAAAAAJ2BrVkAAAAAnKOIAAAAAHCOIgIAAADAOYoIAAAAAOcoIgAAAACco4gAAAAA\ncI4iAgAAAMA5iggAAAAA5ygiAAAAAJz7f+NO8xTyRP2aAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"mod_1\", \"mod_2\"])\n",
    "rule4 = Rule.from_transform(pattern)\n",
    "merged_mod = rule4.inject_merge_nodes([\"mod_1\", \"mod_2\"])\n",
    "plot_rule(rule4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_mod_1:action_graph { id : '109'}) , (lhs_mod_2:action_graph { id : '40'})  \n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH lhs_mod_1 as p_mod_1, lhs_mod_2 as p_mod_2 \n",
      "\n",
      "// Merging nodes '{'mod_2', 'mod_1'}' of the preserved part into 'mod_1_mod_2' \n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, p_mod_1, p_mod_2\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_mod_2) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_mod_2[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_mod_1, p_mod_2\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_mod_1) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_mod_1[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_mod_1, p_mod_2\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, p_mod_1, p_mod_2\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, p_mod_1, p_mod_2\n",
      "SET p_mod_2 = new_props\n",
      "WITH p_mod_2 as rhs_mod_1_mod_2, p_mod_1\n",
      "// set appropriate node id\n",
      "SET rhs_mod_1_mod_2.id = toString(id(rhs_mod_1_mod_2))\n",
      "SET rhs_mod_1_mod_2.count = NULL\n",
      "WITH toString(id(rhs_mod_1_mod_2)) as uid639e16f733de478ab38e98423437650b, p_mod_1, rhs_mod_1_mod_2\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_maps, [] as pred_maps, p_mod_1, rhs_mod_1_mod_2, uid639e16f733de478ab38e98423437650b\n",
      "OPTIONAL MATCH (rhs_mod_1_mod_2)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, p_mod_1, rhs_mod_1_mod_2, uid639e16f733de478ab38e98423437650b\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(rhs_mod_1_mod_2)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, p_mod_1, rhs_mod_1_mod_2, uid639e16f733de478ab38e98423437650b\n",
      "OPTIONAL MATCH (p_mod_1)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, p_mod_1, rhs_mod_1_mod_2, uid639e16f733de478ab38e98423437650b\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(p_mod_1)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, p_mod_1, rhs_mod_1_mod_2, uid639e16f733de478ab38e98423437650b\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN [id(rhs_mod_1_mod_2),id(p_mod_1)] THEN [toString(el['id'])] ELSE [] END) as self_loops, p_mod_1, rhs_mod_1_mod_2, uid639e16f733de478ab38e98423437650b\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, uid639e16f733de478ab38e98423437650b, rhs_mod_1_mod_2, p_mod_1, self_loops\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, uid639e16f733de478ab38e98423437650b, rhs_mod_1_mod_2, p_mod_1, self_loops\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (rhs_mod_1_mod_2)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(rhs_mod_1_mod_2)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (rhs_mod_1_mod_2)-[new_rel:edge]->(rhs_mod_1_mod_2)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, uid639e16f733de478ab38e98423437650b, rhs_mod_1_mod_2, p_mod_1\n",
      "OPTIONAL MATCH (rhs_mod_1_mod_2)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, uid639e16f733de478ab38e98423437650b, rhs_mod_1_mod_2, p_mod_1\n",
      "OPTIONAL MATCH (pred)-[:typing]->(rhs_mod_1_mod_2)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, uid639e16f733de478ab38e98423437650b, rhs_mod_1_mod_2, p_mod_1\n",
      "OPTIONAL MATCH (p_mod_1)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, uid639e16f733de478ab38e98423437650b, rhs_mod_1_mod_2, p_mod_1\n",
      "OPTIONAL MATCH (pred)-[:typing]->(p_mod_1)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, uid639e16f733de478ab38e98423437650b, rhs_mod_1_mod_2, p_mod_1\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (rhs_mod_1_mod_2)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(rhs_mod_1_mod_2))\n",
      "DETACH DELETE (p_mod_1)\n",
      "\n",
      "\n",
      "// Return statement \n",
      "RETURN uid639e16f733de478ab38e98423437650b, rhs_mod_1_mod_2, p_mod_1\n",
      "\n",
      "\n",
      "// Up-propagation to the graph 'meta_model'\n",
      "\n",
      "// Matching of the nodes to merge in 'meta_model'\n",
      "WITH [] as merged_nodes\n",
      "OPTIONAL MATCH (n:action_graph)-[:typing]->(node_to_merge:meta_model)\n",
      "WITH n, collect(node_to_merge) as nodes_to_merge, merged_nodes\n",
      "WHERE n IS NOT NULL AND size(nodes_to_merge) >= 2\n",
      "UNWIND nodes_to_merge as node_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, node_to_merge, n, merged_nodes\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(node_to_merge) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in node_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, node_to_merge, n, merged_nodes\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(new_props) as new_props_col, n, merged_nodes\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge, n, merged_nodes\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, nodes_to_merge, n, merged_nodes\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, nodes_to_merge, n, merged_nodes\n",
      "WITH nodes_to_merge[0] as merged_node, new_props, nodes_to_merge, n, merged_nodes\n",
      "SET merged_node = new_props\n",
      "// set appropriate node id\n",
      "SET merged_node.id = toString(id(merged_node))\n",
      "SET merged_node.count = NULL\n",
      "WITH toString(id(merged_node)) as merged_id, merged_node, nodes_to_merge, n, merged_nodes\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "//create a map from node ids to the id of the merged_node\n",
      "WITH {old_node:node_to_merge.id,  new_node:merged_node} as id_to_merged_id, node_to_merge, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(id_to_merged_id) as ids_to_merged_id, collect(node_to_merge) as nodes_to_merge, n, merged_nodes, merged_id, merged_node\n",
      "WITH apoc.map.groupByMulti(ids_to_merged_id, 'old_node') as ids_to_merged_id, nodes_to_merge, n, merged_nodes, merged_id, merged_node\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(ids_to_merged_id) | \n",
      "\tpairs + [k, REDUCE(values=[], v in ids_to_merged_id[k] | \n",
      "\t\tvalues + CASE WHEN v.new_node IN values THEN [] ELSE v.new_node END)])) as ids_to_merged_id, nodes_to_merge, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect({n:n, nodes_to_merge:nodes_to_merge, merged_node: merged_node, merged_id: merged_id}) as all_n, collect(ids_to_merged_id) as ids_to_merged_id, merged_nodes\n",
      "WITH reduce(acc={}, x in ids_to_merged_id | apoc.map.merge(acc, x)) as ids_to_merged_id, all_n, merged_nodes\n",
      "UNWIND all_n as n_maps\n",
      "WITH n_maps.n as n, n_maps.nodes_to_merge as nodes_to_merge, n_maps.merged_node as merged_node, n_maps.merged_id as merged_id, ids_to_merged_id, merged_nodes\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "OPTIONAL MATCH (node_to_merge)-[out_rel:edge]->(suc)\n",
      "WITH CASE WHEN suc.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[suc.id][0]), neighbor: ids_to_merged_id[suc.id][0], edge: out_rel}\n",
      "\t\tELSE {id: id(suc), neighbor: suc, edge: out_rel} END AS suc_map, node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(suc_map) as suc_maps, node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(node_to_merge)\n",
      "WITH CASE WHEN pred.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[pred.id][0]), neighbor: ids_to_merged_id[pred.id][0], edge: in_rel}\n",
      "\t\tELSE {id: id(pred), neighbor: pred, edge: in_rel} END AS pred_map, node_to_merge, suc_maps, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(pred_map) as pred_maps, suc_maps, node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(node_to_merge.id) as list_ids, collect(suc_maps) as suc_maps_col, collect(pred_maps) as pred_maps_col, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH REDUCE(init=[], maps in suc_maps_col | init + maps) as suc_maps, REDUCE(init=[], maps in pred_maps_col | init + maps) as pred_maps, list_ids, nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN list_ids THEN [toString(el['id'])] ELSE [] END) as self_loops, nodes_to_merge, ids_to_merged_id, list_ids, n, merged_nodes, merged_id, merged_node\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node, self_loops\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node, self_loops\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "WITH nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, node_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "OPTIONAL MATCH (node_to_merge)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, node_to_merge, pred_typings, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "OPTIONAL MATCH (pred)-[:typing]->(node_to_merge)\n",
      "WITH pred_typings + collect(pred) as pred_typings, node_to_merge, suc_typings, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(suc_typings) as suc_typings_col, collect(pred_typings) as pred_typings_col, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "WITH REDUCE(init=[], sucs in suc_typings_col | init + sucs) as suc_typings, REDUCE(init=[], preds in pred_typings_col | init + preds) as pred_typings, nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (merged_node)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(merged_node))\n",
      "WITH nodes_to_merge, ids_to_merged_id, n, merged_nodes, merged_id, merged_node\n",
      "FOREACH(node in filter(x IN nodes_to_merge WHERE x <> merged_node) |\n",
      "\tDETACH DELETE node)\n",
      "RETURN collect(merged_id) as merged_nodes\n"
     ]
    }
   ],
   "source": [
    "action_graph_mod_1 = h.node_type(\"nugget_1\", rhs_g1[\"mod\"])[\"action_graph\"]\n",
    "action_graph_mod_2 = h.node_type(\"nugget_2\", rhs_g3[\"mod\"])[\"action_graph\"]\n",
    "rhs_g4 = h.rewrite(\n",
    "    \"action_graph\", rule4, \n",
    "    {\"mod_1\": str(action_graph_mod_1), \"mod_2\": str(action_graph_mod_2)})\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Instantiation use-case / up-propagation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAHoNJREFUeJzt3X9wXOW93/HPsz+k1Q9LK1kry7Ks\nnytbkmXJxrIxNiGEmCaUEG5yfcEF0mZuykDuNMx0uJfS2yYldSczbZlMmUxnmA5/eMKNw6W+EYYU\nEkMMDsFgR8Y2MQahXa1sC1uWbEuypJWs1e7pH8J7beMfKyKd3dW+XzOaQdJzlu+C9NX5POc5zzGW\nZQkAAAAA7ORIdgEAAAAAMg9BBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIA\nAADAdgSRecQY02OM2XTF1243xvReZexbxph/e8nnf2+MCRljRo0xvcaYf7SjZgDp6bN+M/5Zzzht\njNlmjMlPdl0AUssVvaLv0l7x2T//tyvGVxtjLGOM67PPK4wx/2SMOWOMGTbGHDHGfDcJbwVzgCAC\nGWP+jaTvSNpkWVa+pDZJv0tuVQDSwD2f9YybNN03/nOS6wGQmi72ilWSVkv6jzM49nlJJyRVSVqo\n6fOV07NeIZLClewCkBLWSvqtZVlBSbIsq0/S/0luSQDShWVZnxpjXpPUnOxaAKQuy7L6jDG/1XQg\nSdRaSf/esqyxzz4/OPuVIVm4IgJJek/SvzbG/J0xps0Y40x2QQDShzFmqaR/KU4QAFyHMaZC0l2S\nAjM47D1J/9sYs8UYUzk3lSFZCCKZodwYM3Tph6RbL37Tsqx/kPQDSV+TtEdSvzHmPySpVgDp46XP\n+skfNN07fpLkegCkppeMMSOaXmLVL+m/XPK9v73i/OSDK479K0lvS/qhpJAx5pAxZq0tVWPOEUQy\nw0nLsryXfmj6xCHOsqxfWJa1SZJX0qOSthpjvpaMYgGkjb/4rKdUWZb1N5ZljSe7IAAp6S8sy1og\n6XZJDZJKLvne01ecn7RceqBlWYOWZT1pWdYKSYskHdJ0sDE21Y45RBDBZSzLiliW9X81PSPBem8A\nADArLMvaI2mbpKe/4PFnPju2XFLx7FWGZCGIzD9uY4zn4ocS2JDAGPNdY8zdxpgFxhiHMeYuSSsk\n7ZvzagEAQCb5X5LuNMa0JjLYGPPfjTHNxhiXMWaBpO9LCliWdXZOq4Qt2DVr/nn1is/fSeCY85L+\nXtI/SHJKOibp+5Zl/eG6RwEAAMyAZVkDxpifS/qRpJEEDsmV1C5psaRxTU+SfnPuKoSdjGVZya4B\nAAAAQIZhaRYAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALab0a5ZJSUlVnV19RyVAmCmDhw4cMay\nLF+y65gpegmQeugnAGZLov1kRkGkurpaHR0dX7wqALPKGHMs2TV8EfQSIPXQTwDMlkT7CUuzAAAA\nANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQA\nAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsR\nRAAAAADYjiACAAAAwHYEEQAAAAC2m9dBpLq6Wg0NDVq1alX8o6enR5FIRE899ZSWL1+uFStWqLW1\nVZs3b9bRo0clSdu2bZPX673suM7OTkmSMUYtLS1qbW1VS0uLXn755WS+RQA2oJcAmC30E+CfuZJd\nwFzbsWOHmpubL/vaQw89pHA4rH379snr9cqyLL366qvq7OxUU1OTJGnTpk3asWPHVV9z7969ys/P\n12uvvab77rtPg4ODcrnm/X9KIKPRSwDMFvoJMC3jfkK7urrU3t6u3t5eeb1eSdMzCXffffeMX+v2\n22/X6OioBgcH5fP5ZrtUACmMXgJgttBPkKnmfRDZvHmzPB6PJMnlcumJJ55QfX29ioqKrnvcG2+8\noVWrVkmSampq1N7e/rkx7e3tuuOOO/hFBzIAvQTAbKGfANPmfRC58vLniy++eNn3jx49qgceeEDh\ncFh33XWXnnnmGUnXv/y5YcMGjYyMqK+vT7t375674gGkDHoJgNlCPwGmzeub1a9m9erV6urq0tDQ\nkCSpqalJhw4d0mOPPabh4eGEXmPv3r0KhULaunWrtmzZoomJibksGUAKopcAmC30E2SqjAsi9fX1\nuvfee/Xwww9f9ss9NjY249d6/PHHtWjRIj377LOzWSKANEAvATBb6CfIVPN+adal6zAl6bnnntO2\nbdu0detWrV27Vm63W0VFRSovL9eTTz45o9c2xujpp5/Wli1b9MgjjygnJ2e2yweQIuglAGYL/QSY\nZizLSnhwW1ub1dHRMYflAJgJY8wBy7Lakl3HTNFLgNRDPwEwWxLtJxm3NAsAAABA8hFEAAAAANiO\nIAIAAADAdgQRAAAAALYjiAAAAACw3bzfvjcRlmXp/KlTGjxxQlY0qrySEpXU1cnhdCa7NABpJhaN\n6kwgoLGzZ2WcThUtXaqCxYtljEl2aQDSTGR8XKc7OzU5NiaXx6PS+np5CgqSXRYwazI+iIz09+tP\nL7+sC6Ojik1NSZYlp9st43Bo2Ve/qsUrViS7RABp4tSRI/pk925ZsZiikYhkjBwul7Lz87Xym9/U\ngtLSZJcIIA3EolF98rvf6dSRI5Ixik1NyTidCu7Zo+Lqaq24+265srOTXSbwZ8vopVmjZ87owC9/\nqfHBQcUiEemzZ6pEIxFNXbigj3ft0qeHDye5SgDp4NPDh/Xx669r6sKF6RAiSZalWCSi8cFBHfjl\nLzV65kxyiwSQ8izL0gc7d+rUhx8qFo1OT5JKsqJRxaJRne3pUcf27f/cZ4A0ltFB5ONduxSdnLzm\n92NTU/pk925NXWcMAExNTuqT3bvjJwxXE52c1Me7dtlYFYB0dK6nR0PHj1+zn1jRqMaHhpgoxbyQ\nsUFkfGhII319Nx5ojPo+/HDuCwKQtk59+KGUwD0gI319Gh8asqEiAOnq2P79N7zaEZua0vE//lHW\nZys5gHSVsUHk/OnTMgncjB6LRHTyk08Ui8VsqApAOhrq7Z1e3nkDMUkng8G5LwhA2ho5fTqhcRfG\nxjQ2MjLH1QBzK+NvVk/EyVOn9Itf/EK1tbXy+/1atGhRsksCkIai0ajee+89HQyFVFdXp7q6OhWw\nAw6AL8CyLL3wwgsqr6hQXV2dampqlJWVleyygBnJ2CsiBWVlshK4yhGJRtXd36/jx4/rgw8+0M6d\nO7V9+3bt379fZ8+etaHS2VddXa2Ghga1traqublZL7zwgt566y21tbXFx+zfv18VFRX69a9/ncRK\ngfRQtHSpHG73DcdZsZg6T5xQKBTS/v379cILL+ill17SkSNHFA6Hbah09tFPgNm1oKwsoXHhSEQ9\nx4+rq6tLe/bs0c9//nPt2rVL3d3dmrrO/Wqpil6SmTL2ikhOYaEKyso01Nt73XFOp1Nhj0en+/rU\n1dWlhQsXyufz6fz58zp06JC8Xq/8fr/q6upUWFhoU/V/vh07dqi5uVkHDx7Uhg0b9Pzzz8e/t3v3\nbn3nO9/R9u3b9eUvfzmJVQLpoaypSV1vvnndMZakC06nYi6XAoGAotGofD6fRkdH1d/fr3fffVeL\nFy+W3+9XTU2NstNoa076CTB7qtau1fmTJ697n0hM0jm3W5OTkzp8+LCys7NVWlqqiYkJ9fT0yO12\nq6qqSn6/XxUVFXI40mPemV6SeTI2iEhSw9e+pj8+//w1d84yTqecS5eqYmxMpWVlmpyc1JkzZ3T8\n+HF1dnaqpKREpaWlGhwcVEdHh0pKSnTbbbeppKTE5nfyxa1evVoLFixQKBSSJL3yyiv6/ve/r507\nd142CwHg2lxZWVp+553qfP31a+5043C55K6uVtWZM6qsrNTY2JgGBgZ09OhRORwO+Xw+hcNhnTx5\nUn/4wx+0dOlSbdq0Sc40erAq/QT48xVXV6u4ulpnQ6Gr9hPjdMqdm6v84mL5CwtVW1ur4eFhDQwM\n6Pjx48rLy4v3k0AgoOzsbDU3N2vNmjVJeDdfDL0kc2R0EMkrLlbbgw/qyMsva3x4WFYsJsuy5HS5\n5HA6tWzTJpU1NioajerEiRMKBAI6duyYysvLNTExoYGBAQWDQU1OTsZnNr/+9a8n+23NyJtvvqmJ\niQnV19erq6tLDz74oN59912t4EGOwIyUNzfL4XSq84034g80NMbIOBzK8XrVfM89yi8p0fj4uEKh\nkAKBgPLy8lRdXa3z589rYGBAhw8fVlZWlnw+n3JyctIqhEj0E2A2GGPU/M1vquvNN3Xygw/iDzR0\nOJ2SZWlhXZ2a7rpLrqwsDQ4OKhgMKhAIqKioSLFYTOfOndPAwIBCoZAKCgrk8/m0bNmyZL+tGaGX\nZA4zk63f2trarI6OjjksJ3nO9/Vp8MQJWbGY8hYu1MLa2qteyoxEIjp27JgCgYB6e3sVi8UUDofV\n39+vqakp3XTTTfGlWkVFRUl4JzdWXV0tj8cjj8ejgoIC/fCHP5Tb7dajjz6qwsJCrVu3Tj/72c+S\nXSYSYIw5YFlW2k0PzedeEovFdLa7W2Nnz8o4HCqqrFTBNTa4GB0dVTAYVDAY1JkzZ2RZloaHh9Xf\n3y+v16uWlhb5/X7V1tbK4/HY/E4SQz+ZP+gnqScyMaGBri5Njo3JlZ0tX329svPzrzp2YGBAgUBA\nwWBQ4XBY0WhUZ8+eVX9/v5YtW6aGhgb5/X4tXbo0JSc56CXzS6L9JKOviFyqoKxMBQncIOZ2u+X3\n++X3+zUxMaFQKKRgMKjc3Nz4sqxAIKBXX31V2dnZ8VCyYMECG95F4i6uw7zorbfeUn5+vnbt2qU7\n77xTP/jBD/iFB74Ah8Mhn98vn99/w7H5+flqbW1Va2urhoaG4qHE6/Vqy5YtGhoaUiAQ0P79+1Va\nWiq/36/q6uqU2xmHfgLMDbfHo/KVKxMa6/P55PP5tH79ep06dUrBYFDd3d1qaGjQPffco1AopCNH\njmjPnj3x+0fKy8tT6v4ReknmIYj8GTwejxobG9XY2KixsTFlZWXJ7XarpKREN998s/r6+hQMBtXe\n3q6CgoL4zGZubm6yS7+mwsJCvf766/zCAzbzer1as2aN1qxZo+HhYRUUFKigoECVlZWamprSsWPH\nFAwGtXfvXpWXl8vv96uyslIuV+q2cfoJYD9jjMrLy1VeXq6NGzdqdHRU2dnZamhoUENDg8LhsILB\noDo6OjQyMqKampr4owlMAg9mTQZ6yfyVun/B0kxeXt5lnxtjtHjxYi1evFgbNmzQp59+qkAgoI6O\nDvl8vvie36m4M05hYSGzD0ASXbkDn8vlij93ZHJyUqFQSB999JF+//vfq6qqSnV1dSm7Mw79BEge\nh8PxuWcV5ebmauXKlVq5cqXOnz+vYDCot99+W5FIJN5nUnHTHXrJ/MQ9IjabmprS8ePHFQwG9emn\nn8a366yqqkrpmU2kJtZ0Z7ZwOKzu7m4Fg0ENDw/HZzbLyspSdmYTqYt+ktnOnTsXv8fE6XSqrq5O\nfr8/rR5NgNTBPSIpyuVyqba2VrW1tZqcnFRPT48++eQTvf3226qsrFRdXZ2WLl2akjObAFJLbm6u\nmpub1dzcrJGRkfjSrYmJifjMps/nS3aZANJAcXGx1q1bp3Xr1qm/v1+BQECvvPKKcnNz40vL869x\nozzwRXFFJEVMTEyou7tbgUBAg4ODqqmpUV1dncrLy5nZxDUxg4mruXRLT0kpv5MfUgP9BFeyLEun\nTp1SIBBQKBRSUVFRyu/kh9TAFZE04/F41NTUpKamJo2Ojqq7u1v79u1TOBxWbW2t/H6/SktLk10m\ngDRQVFSktrY2tbW1xZ93lOo7+QFIPZfe+H7rrbfqxIkTCgaDKb+TH9IHQSQF5efnq6WlRS0tLRoe\nHlYgENBbb72laDQaX7NZXFyc7DIBpIGLW3pe3MkvEAiovb1dhYWF8eVbOTk5yS4TQIpzOByqqqpS\nVVVVfCe/QCCgvXv3asmSJaqrq0v5nfyQevhpSXGFhYXxLT3PnDmjYDCo3/zmN/HnmdTV1X1uRwwA\nuNKlO/lt3LhRvb298S08fT5ffGYzFXfyA5BaLt3J78KFC5/byc/v92vJkiXc74obIoikkZKSEpWU\nlGjdunU6ffq0gsGgdu7cqfz8/HgoSeVnlABIDQ6HQ5WVlfFnlFzcye/dd99lJz8AM3LlM0q6u7v1\n/vvv680332QnP9wQf2XSkDFGZWVlKisr0y233KKTJ08qEAjo/fff18KFC+PPKLnRjWSxaEw9B8/q\ng998qpEzE8rKdanxtjI13FamrFx+NIBMcLWd/Do7O2e8k9+F8JQ+3nNKH//+tCbHp1Tg86jl6xWq\nWr1QDgcnIEAmuNpOfu+8844uXLgwo538hvvGdfi3vTrxwTnJkhb5F2jV3ZUqqWLXrvmGXbPmkWg0\nqhMnTigQCKi3t1dlZWXxmU23233Z2LHBC2r/rwc1NjipyEQ0/nVXtkPGYfSNJ1q0pNFr91vADLHL\nDebK+Pi4QqHQZTv5+f1+LV68+HMzm70fDur//c8/ybIsTV2Ixb/u9jiVX5ytb/1otXK93Mya6ugn\nmCtX28nP7/fL6/38ecb+fwrpwEvHZVmWYlPT56jGITldDvnX+3THo41MbqSBRPsJQWSeikQi6unp\nUTAYVF9fnyoqKuT3+7V06VLJMtr+t/t1vn9cVuzqx7uyHbr/J20qWpJ39QFICZw4wA6jo6MKBoMK\nBoOf28nvXO+YXvxPHZcFkEsZp1S4KEf/6n+sk9PFevFURj+BHQYGBuIPTszJyYlvwpOfn68Pftur\nvduD1+wnriyHmu5YrNu+u8zmqjFTbN+b4dxut+rr61VfX6+JiQmFQiEdOXJEe/bsUWGkUqPnzDVD\niCRFIzH98Vc9+hc/WGFf0QBSUn5+vlpbW9Xa2qqhoSEFg8H4Tn6xj5ZoavLazcSKSmPnJhU6cEb+\nm9mCHMh0F3fyW79+vU6dOqVgMKhf/epXKlhQqL6dhZq6cO0J8qnJmD783Umt/Xa1cgq4yjofMD2V\nATwejxobG/WNb3xDmzdv1vBRl6KT178SZsWk4P4BTU1GrzsOQGbxer1as2aN7rvvPn3ltq9qKBiV\nbnBhPTIR1eFXe+0pEEBauPiMki996Ut66KGHtCR3mWLRBFbpGKPOd07PfYGwBUEkw+Tl5SkaTux/\nu3EYjZ+PzHFFANJVjmuBXC5nQmPPD0zMcTUA0pXD4ZDHFMiYG5+fRCdjGu4bt6Eq2IEgkoFcWYn9\nb49FLbmyEzvJAJB53NlOxaLXWeN5iUT7DoDM5Mp2JHYTupGycjg3mS/4y5CB6jeUyuG+8S970eJc\n5Sxw33AcgMyU681SQemNn8rudDu0fOMiGyoCkK4qW4sTmthwZTlUu/bGWwAjPRBEMtDKO5fIcYMH\nC7myHVrzrSqbKgKQrtq+XSVX9vX/lBgjrbiz3KaKAKSjPG+2qlYtlMN17fMTY6SC0hwtqiuwsTLM\nJYJIBspf6NFX/6bhmkslXNkOLdu4SPW3sMMNgOtbtnGR/OtLrxlGXFkO3fnvGpXnzba5MgDp5o5H\nGrSgxCPnVVZtGKeUne/WN/5uZRIqw1xh+94MVb9+kfKLPHrvH7vV1zUsh8shK2opryhbbd+uUsNt\nZZ97aBkAXMkYo68+2qDyhkJ1tB9TeGhSxmkUm4pp8XKv1t9fo7L6wmSXCSANePLduv8nbfpje48+\nfOOkLEuSkayopWW3LtLNf1WjvCImNeYTgkgGW7y8UN/60WqNn5/U2OCksnKcWuDzEEAAzIgxRk1f\nKVfj7Ys1MjChyfGo8oqy2OcfwIxl5bq08UG/1t9fq+HT0w9eLij1yM3mOfMSQQTKKeCEAcCfzxiT\n0M3rAHAjTpdDxUvykl0G5hj3iAAAAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQA\nAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsR\nRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA\n2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAA\nAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAEASVFdXq6GhQatWrYp/9PT0KBKJ6KmnntLy5cu1\nYsUKtba2avPmzTp69Kgkadu2bfJ6vZcd19nZKUkyxqilpUWtra1qaWnRyy+/HP/3HTp0SBs3blRu\nbq42b96clPcMYG7QT5CuXMkuAAAy1Y4dO9Tc3HzZ1x566CGFw2Ht27dPXq9XlmXp1VdfVWdnp5qa\nmiRJmzZt0o4dO676mnv37lV+fr5ee+013XfffRocHJTL5VJpaal++tOf6tChQ3r99dfn/L0BsBf9\nBOmIIAIAKaKrq0vt7e3q7e2V1+uVND0reffdd8/4tW6//XaNjo5qcHBQPp9P5eXlKi8v10cffTTb\nZQNIQfQTpAOCCAAkyebNm+XxeCRJLpdLTzzxhOrr61VUVHTd49544w2tWrVKklRTU6P29vbPjWlv\nb9cdd9whn883+4UDSDn0E6QjgggAJMmVSylefPHFy75/9OhRPfDAAwqHw7rrrrv0zDPPSLr+UooN\nGzZoZGREfX192r1799wVDyCl0E+QjrhZHQBSxOrVq9XV1aWhoSFJUlNTkw4dOqTHHntMw8PDCb3G\n3r17FQqFtHXrVm3ZskUTExNzWTKAFEU/QTogiABAiqivr9e9996rhx9++LIThbGxsRm/1uOPP65F\nixbp2Wefnc0SAaQJ+gnSAUuzACBJLl3TLUnPPfectm3bpq1bt2rt2rVyu90qKipSeXm5nnzyyRm9\ntjFGTz/9tLZs2aJHHnlEp0+f1q233qpwOKyJiQlVVFToxz/+sb73ve/N9tsCkAT0E6QjY1lWwoPb\n2tqsjo6OOSwHwEwYYw5YltWW7Dpmil4CpB76CYDZkmg/YWkWAAAAANsRRAAAAADYjiACAAAAwHYE\nEQAAAAC2I4gAAAAAsB1BBAAAAIDteI4IAKQJy7J0NhTSsf37df7UKcmylFtcrKp161S6fLkcTmey\nSwSQJqKTkzr14Yc63tGhiZERGYdDxZWVqlq3Tt6KimSXhwxBEAGANGDFYvrTK6/oXCikaCQS//ro\nwIA+3rVLxw8c0E333y9XVlYSqwSQDi6Mjqpj+3ZNjo0pNjUlSbKiUZ0JBnXu2DFV3HST6r/85SRX\niUzA0iwASAPBt9/W2e7uy0LIRdFIRKMDAzryyitJqAxAOrEsSwdffFEXRkbiIeRSsakp9R48qJN/\n+lMSqkOmIYgAQIqLRiI6cfDgVU8aLrKiUQ0eO6bxoSEbKwOQboZOnNDE+fOyYrFrjolFIup+5x1Z\nlmVjZchEBBEASHFnu7tljLnhOMuy1PfRRzZUBCBdfXr48FWvrF5pamJCI/39NlSETEYQAYAUNxkO\nX3f28iIrFtOF0VEbKgKQrhLtEcbhUCQcnuNqkOkIIgCQ4tw5OQldETEOh7Jyc22oCEC6ysrLS2ic\nFYvJ7fHMcTXIdAQRAEhxC2trE1qrbRwOLWpstKEiAOmqfOVKOd3uG45zZmVpQVmZDRUhkxFEACDF\nubKyVL5ypRyua++4bpxOFZaXK6+42MbKAKSb4urq6asi17nK6nC7VXPLLQldiQX+HAQRAEgD9V/5\nirwVFXJcZSbT4XIp1+vVynvvTUJlANKJMUar77tPWbm5V30IqsPtVlljo5asWpWE6pBpeKAhAKQB\nh9OpVX/5lzrd2alj+/ZpdGBAkuQpLFTl2rUqb25OaLkFAOQUFmr9X/+1eg8d0okDB6ZvSjdG3iVL\nVHXzzVpYU8PVENiCIAIAacI4HCprbFRZY+P0PSOWJePgwjaAmXN7PKpZv14169dP78pnDOEDtiOI\nAEAaMsZcd403ACSKCQ0kCz95AAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAAwHYEEQAA\nAAC2I4gAAAAAsB1BBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQR\nAAAAALYjiAAAAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2\nBBEAAAAAtiOIAAAAALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAA\nwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDtCCIAAAAAbGcsy0p8sDEDko7NXTkAZqjKsixfsouYKXoJ\nkJLoJwBmS0L9ZEZBBAAAAABmA0uzAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAAgO0I\nIgAAAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2O7/A3uxOZg3FekGAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"EGFR\", \"PK\"])\n",
    "pattern.add_edges_from([(\"PK\", \"EGFR\")])\n",
    "rule5 = Rule.from_transform(pattern)\n",
    "_, cloned_node = rule5.inject_clone_node(\"EGFR\")\n",
    "rule5.inject_remove_edge(\"PK\", cloned_node)\n",
    "\n",
    "plot_rule(rule5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_EGFR:action_graph { id : '101'}) , (lhs_PK:action_graph { id : '66'})  , (lhs_PK)-[lhs_PK_lhs_EGFR:edge]->(lhs_EGFR)\n",
      "\n",
      "// Cloning node 'EGFR' of the lhs \n",
      "// Create clone corresponding to 'EGFR1' of the preserved part\n",
      "// create a node corresponding to the clone\n",
      "CREATE (p_EGFR1:action_graph) \n",
      "WITH p_EGFR1, toString(id(p_EGFR1)) as p_EGFR1_id, lhs_EGFR.id as original_old, lhs_EGFR, lhs_PK, lhs_PK_lhs_EGFR \n",
      "// set the id property of the original node to NULL\n",
      "SET lhs_EGFR.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET p_EGFR1 = lhs_EGFR\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET p_EGFR1.id = toString(id(p_EGFR1)), p_EGFR1.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET lhs_EGFR.id = original_old\n",
      "WITH p_EGFR1, toString(id(p_EGFR1)) as p_EGFR1_id, lhs_EGFR, lhs_PK, lhs_PK_lhs_EGFR \n",
      "WITH [] as sucIgnore, ['66'] as predIgnore, lhs_PK_lhs_EGFR, p_EGFR1, p_EGFR1_id, lhs_EGFR, lhs_PK \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_EGFR)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, lhs_PK_lhs_EGFR, p_EGFR1, p_EGFR1_id, lhs_EGFR, lhs_PK \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(lhs_EGFR) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, lhs_PK_lhs_EGFR, suc_maps, p_EGFR1, p_EGFR1_id, lhs_EGFR, lhs_PK \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_EGFR1)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(p_EGFR1) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = lhs_EGFR THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (p_EGFR1)-[new_edge:edge]->(p_EGFR1) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1, p_EGFR1_id, lhs_EGFR, lhs_PK \n",
      "OPTIONAL MATCH (lhs_EGFR)-[out_typ_edge:typing]->(suc_typ)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, lhs_PK_lhs_EGFR, p_EGFR1, p_EGFR1_id, lhs_EGFR, lhs_PK \n",
      "OPTIONAL MATCH (pred_typ)-[in_typ_edge:typing]->(lhs_EGFR) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, lhs_PK_lhs_EGFR, p_EGFR1, p_EGFR1_id, suc_typ_maps, lhs_EGFR, lhs_PK \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_EGFR1)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(p_EGFR1) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1, p_EGFR1_id, lhs_EGFR, lhs_PK \n",
      "\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1, p_EGFR1_id, lhs_EGFR, lhs_PK // Renaming vars to correspond to the vars of P\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1, p_EGFR1_id , lhs_EGFR as p_EGFR, lhs_PK as p_PK \n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1_id , p_EGFR as rhs_EGFR, p_PK as rhs_PK, p_EGFR1 as rhs_EGFR1 \n",
      "\n",
      "// Return statement \n",
      "RETURN lhs_PK_lhs_EGFR, p_EGFR1_id, rhs_PK, rhs_EGFR, rhs_EGFR1\n",
      "\n",
      "// Matching of the nodes to clone in 'nugget_2'\n",
      "OPTIONAL MATCH (node_to_clone:nugget_2)-[t:typing]->(n:action_graph)\n",
      "WITH node_to_clone, collect(n) as sucs, collect(t) as typ_sucs, count(n) as number_of_img\n",
      "WHERE number_of_img >= 2 AND node_to_clone IS NOT NULL\n",
      "FOREACH(t IN typ_sucs | DELETE t)\n",
      "WITH node_to_clone, sucs, number_of_img-1 as number_of_clone\n",
      "UNWIND range(1, number_of_clone) as clone_number\n",
      "// create a node corresponding to the clone\n",
      "CREATE (cloned_node:nugget_2) \n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, node_to_clone.id as original_old, node_to_clone, sucs, clone_number \n",
      "// set the id property of the original node to NULL\n",
      "SET node_to_clone.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET cloned_node = node_to_clone\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET cloned_node.id = toString(id(cloned_node)), cloned_node.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET node_to_clone.id = original_old\n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, node_to_clone, sucs, clone_number \n",
      "\n",
      "//create a map from original node id to the clone\n",
      "WITH {original_node:node_to_clone.id, clones:collect(cloned_node)+[node_to_clone]} as orig_id_to_clone, collect({clone_id:clone_id, clone:cloned_node}) as clone_maps, node_to_clone, sucs\n",
      "WITH collect(orig_id_to_clone) as orig_ids_to_clone, collect({orig:node_to_clone, clone_maps:clone_maps}) as all_orig, sucs\n",
      "WITH apoc.map.groupByMulti(orig_ids_to_clone, 'original_node') as orig_ids_to_clone, all_orig, sucs\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(orig_ids_to_clone) | \n",
      "\tpairs + [k, REDUCE(values=[], v in orig_ids_to_clone[k] | \n",
      "\t\tvalues + CASE WHEN v.clones IN values THEN [] ELSE v.clones END)])) as orig_ids_to_clone, all_orig, sucs\n",
      "UNWIND all_orig as original_map\n",
      "WITH original_map.orig as node_to_clone, original_map.clone_maps as clone_maps, sucs, orig_ids_to_clone\n",
      "UNWIND clone_maps as clone_map\n",
      "WITH clone_map.clone_id as clone_id, clone_map.clone as cloned_node, node_to_clone, sucs, orig_ids_to_clone\n",
      "WITH [] as sucIgnore, [] as predIgnore, cloned_node, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (node_to_clone)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, id: suc.id, edge: out_edge}) as suc_maps, predIgnore, cloned_node, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(node_to_clone) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, id: pred.id, edge: in_edge}) as pred_maps, cloned_node, suc_maps, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE\n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL AND suc_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[suc_map.id] \n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE\n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL AND pred_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[pred_map.id] \n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = node_to_clone THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH cloned_node, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "OPTIONAL MATCH (node_to_clone)-[out_typ_edge:typing]->(suc_typ)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, cloned_node, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "OPTIONAL MATCH (pred_typ)-[in_typ_edge:typing]->(node_to_clone) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, cloned_node, suc_typ_maps, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH collect(cloned_node)+[node_to_clone] as nodes_to_typ, collect(clone_id) as clone_ids, sucs, orig_ids_to_clone, node_to_clone\n",
      "FOREACH (i IN range(0, size(sucs)-1) |\n",
      "\tFOREACH(source in [nodes_to_typ[i]] |\n",
      "\t\tFOREACH(target in [sucs[i]] |\n",
      "\t\t\tMERGE (source)-[restored_typing:typing]->(target)\n",
      ")))\n",
      "RETURN clone_ids\n",
      "// Removal of edges attributes in 'nugget_2'\n",
      "MATCH (n:nugget_2)-[rel_pred:edge]->(m:nugget_2)\n",
      "OPTIONAL MATCH (x:action_graph)-[rel:edge]->(y:action_graph)WHERE (n)-[:typing]->(x) AND (m)-[:typing]->(y)\n",
      "FOREACH(dummy IN CASE WHEN rel IS NULL THEN [1] ELSE [] END |\n",
      "\tDELETE rel_pred\n",
      ")\n",
      "WITH rel, rel_pred\n",
      "WHERE rel IS NOT NULL AND REDUCE(invalid = 0, k in filter(k in keys(rel_pred) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel_pred[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH rel, rel_pred, [rel_pred, rel] as edges_to_merge_props\n",
      "\n",
      "//Perform the intersection of the properties of edges_to_merge_props\n",
      "WITH [] as new_props, rel_pred, rel, edges_to_merge_props\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(edges_to_merge_props[0]) | pairs +\n",
      "\tCASE WHEN ALL(other in edges_to_merge_props WHERE k in keys(other))\n",
      "\tTHEN\n",
      "\t\tREDUCE(inner_pairs = [], v in edges_to_merge_props[0][k] | inner_pairs +\n",
      "\t\t\tCASE WHEN ALL(other in edges_to_merge_props WHERE v in other[k])\n",
      "\t\t\tTHEN\n",
      "\t\t\t\t{key: k, value: v}\n",
      "\t\t\tELSE\n",
      "\t\t\t\t[]\n",
      "\t\t\tEND)\n",
      "\tELSE\n",
      "\t\t[]\n",
      "\tEND) as new_props, rel_pred, rel, edges_to_merge_props\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, rel_pred, rel, edges_to_merge_props\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, rel_pred, rel, edges_to_merge_props\n",
      "SET rel_pred = new_props\n",
      "\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Matching of the nodes to clone in 'nugget_1'\n",
      "OPTIONAL MATCH (node_to_clone:nugget_1)-[t:typing]->(n:action_graph)\n",
      "WITH node_to_clone, collect(n) as sucs, collect(t) as typ_sucs, count(n) as number_of_img\n",
      "WHERE number_of_img >= 2 AND node_to_clone IS NOT NULL\n",
      "FOREACH(t IN typ_sucs | DELETE t)\n",
      "WITH node_to_clone, sucs, number_of_img-1 as number_of_clone\n",
      "UNWIND range(1, number_of_clone) as clone_number\n",
      "// create a node corresponding to the clone\n",
      "CREATE (cloned_node:nugget_1) \n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, node_to_clone.id as original_old, node_to_clone, sucs, clone_number \n",
      "// set the id property of the original node to NULL\n",
      "SET node_to_clone.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET cloned_node = node_to_clone\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET cloned_node.id = toString(id(cloned_node)), cloned_node.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET node_to_clone.id = original_old\n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, node_to_clone, sucs, clone_number \n",
      "\n",
      "//create a map from original node id to the clone\n",
      "WITH {original_node:node_to_clone.id, clones:collect(cloned_node)+[node_to_clone]} as orig_id_to_clone, collect({clone_id:clone_id, clone:cloned_node}) as clone_maps, node_to_clone, sucs\n",
      "WITH collect(orig_id_to_clone) as orig_ids_to_clone, collect({orig:node_to_clone, clone_maps:clone_maps}) as all_orig, sucs\n",
      "WITH apoc.map.groupByMulti(orig_ids_to_clone, 'original_node') as orig_ids_to_clone, all_orig, sucs\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(orig_ids_to_clone) | \n",
      "\tpairs + [k, REDUCE(values=[], v in orig_ids_to_clone[k] | \n",
      "\t\tvalues + CASE WHEN v.clones IN values THEN [] ELSE v.clones END)])) as orig_ids_to_clone, all_orig, sucs\n",
      "UNWIND all_orig as original_map\n",
      "WITH original_map.orig as node_to_clone, original_map.clone_maps as clone_maps, sucs, orig_ids_to_clone\n",
      "UNWIND clone_maps as clone_map\n",
      "WITH clone_map.clone_id as clone_id, clone_map.clone as cloned_node, node_to_clone, sucs, orig_ids_to_clone\n",
      "WITH [] as sucIgnore, [] as predIgnore, cloned_node, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (node_to_clone)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, id: suc.id, edge: out_edge}) as suc_maps, predIgnore, cloned_node, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(node_to_clone) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, id: pred.id, edge: in_edge}) as pred_maps, cloned_node, suc_maps, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE\n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL AND suc_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[suc_map.id] \n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE\n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL AND pred_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[pred_map.id] \n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = node_to_clone THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH cloned_node, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "OPTIONAL MATCH (node_to_clone)-[out_typ_edge:typing]->(suc_typ)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, cloned_node, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "OPTIONAL MATCH (pred_typ)-[in_typ_edge:typing]->(node_to_clone) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, cloned_node, suc_typ_maps, sucs, clone_id, orig_ids_to_clone, node_to_clone \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH collect(cloned_node)+[node_to_clone] as nodes_to_typ, collect(clone_id) as clone_ids, sucs, orig_ids_to_clone, node_to_clone\n",
      "FOREACH (i IN range(0, size(sucs)-1) |\n",
      "\tFOREACH(source in [nodes_to_typ[i]] |\n",
      "\t\tFOREACH(target in [sucs[i]] |\n",
      "\t\t\tMERGE (source)-[restored_typing:typing]->(target)\n",
      ")))\n",
      "RETURN clone_ids\n",
      "// Removal of edges attributes in 'nugget_1'\n",
      "MATCH (n:nugget_1)-[rel_pred:edge]->(m:nugget_1)\n",
      "OPTIONAL MATCH (x:action_graph)-[rel:edge]->(y:action_graph)WHERE (n)-[:typing]->(x) AND (m)-[:typing]->(y)\n",
      "FOREACH(dummy IN CASE WHEN rel IS NULL THEN [1] ELSE [] END |\n",
      "\tDELETE rel_pred\n",
      ")\n",
      "WITH rel, rel_pred\n",
      "WHERE rel IS NOT NULL AND REDUCE(invalid = 0, k in filter(k in keys(rel_pred) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel_pred[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH rel, rel_pred, [rel_pred, rel] as edges_to_merge_props\n",
      "\n",
      "//Perform the intersection of the properties of edges_to_merge_props\n",
      "WITH [] as new_props, rel_pred, rel, edges_to_merge_props\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(edges_to_merge_props[0]) | pairs +\n",
      "\tCASE WHEN ALL(other in edges_to_merge_props WHERE k in keys(other))\n",
      "\tTHEN\n",
      "\t\tREDUCE(inner_pairs = [], v in edges_to_merge_props[0][k] | inner_pairs +\n",
      "\t\t\tCASE WHEN ALL(other in edges_to_merge_props WHERE v in other[k])\n",
      "\t\t\tTHEN\n",
      "\t\t\t\t{key: k, value: v}\n",
      "\t\t\tELSE\n",
      "\t\t\t\t[]\n",
      "\t\t\tEND)\n",
      "\tELSE\n",
      "\t\t[]\n",
      "\tEND) as new_props, rel_pred, rel, edges_to_merge_props\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, rel_pred, rel, edges_to_merge_props\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, rel_pred, rel, edges_to_merge_props\n",
      "SET rel_pred = new_props\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g5 = h.rewrite(\n",
    "    \"action_graph\", rule5, \n",
    "    {\"EGFR\": action_graph_EGFR, \"PK\": action_graph_PK})"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
