{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "from regraph import Rule, plot_rule\n",
    "\n",
    "\n",
    "from regraph.neo4j.hierarchy import Neo4jHierarchy\n",
    "import regraph.neo4j.cypher_utils as cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f8b30f75080>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# initialize the neo4j driver, wrappped into Neo4jHierarchy object\n",
    "h = Neo4jHierarchy(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"admin\")\n",
    "h._clear()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add the default components to the KAMI hierarchy"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "nodes = [\"gene\", \"region\", \"state\", \"mod\", \"bnd\"]\n",
    "\n",
    "edges = [\n",
    "    (\"gene\", \"mod\"),\n",
    "    (\"gene\", \"bnd\"),\n",
    "    (\"region\", \"gene\"),\n",
    "    (\"region\", \"mod\"),\n",
    "    (\"region\", \"bnd\"),\n",
    "    (\"state\", \"gene\"),\n",
    "    (\"state\", \"region\"),\n",
    "    (\"mod\", \"state\")\n",
    "]\n",
    "h.add_graph('meta_model', nodes, edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// match all typing pairs between 'action_graph' and 'meta_model'\n",
      "MATCH (s:action_graph), (t:meta_model)\n",
      "WITH s, t\n",
      "// match all the predecessors of 's' and successors of 't'\n",
      "MATCH (pred), (suc)\n",
      "WHERE (pred)-[:typing*0..]->(s)\n",
      "\tAND (t)-[:typing*0..]->(suc)\n",
      "WITH s, t, collect(DISTINCT pred) as pred_list, collect(DISTINCT suc) as suc_list\n",
      "// select all the pairs 'pred' 'suc' with a path between\n",
      "UNWIND pred_list as pred\n",
      "UNWIND suc_list as suc\n",
      "OPTIONAL MATCH (pred)-[r:typing*]->(suc)\n",
      "WHERE NONE(rel in r WHERE rel.tmp = 'True')\n",
      "WITH s, t, r, labels(pred)[1] as pred_label, labels(suc)[1] as suc_label\n",
      "WHERE r IS NOT NULL\n",
      "WITH DISTINCT s, t, pred_label, suc_label\n",
      "// return the pairs 's' 't' where there should be a typing edge\n",
      "OPTIONAL MATCH (s)-[new_typing:typing]->(t)\n",
      "WHERE new_typing.tmp IS NOT NULL\n",
      "WITH pred_label, suc_label, s.id as s_id, t.id as t_id, new_typing\n",
      "WHERE new_typing IS NULL\n",
      "RETURN pred_label, suc_label, s_id, t_id\n",
      "\n"
     ]
    }
   ],
   "source": [
    "h.add_graph('action_graph', [], [])\n",
    "h.add_typing(\"action_graph\", \"meta_model\", {})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Aggregation use-case / (controlled) down-propagation"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1) Add two empty nuggets typed by the action graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// match all typing pairs between 'nugget_1' and 'action_graph'\n",
      "MATCH (s:nugget_1), (t:action_graph)\n",
      "WITH s, t\n",
      "// match all the predecessors of 's' and successors of 't'\n",
      "MATCH (pred), (suc)\n",
      "WHERE (pred)-[:typing*0..]->(s)\n",
      "\tAND (t)-[:typing*0..]->(suc)\n",
      "WITH s, t, collect(DISTINCT pred) as pred_list, collect(DISTINCT suc) as suc_list\n",
      "// select all the pairs 'pred' 'suc' with a path between\n",
      "UNWIND pred_list as pred\n",
      "UNWIND suc_list as suc\n",
      "OPTIONAL MATCH (pred)-[r:typing*]->(suc)\n",
      "WHERE NONE(rel in r WHERE rel.tmp = 'True')\n",
      "WITH s, t, r, labels(pred)[1] as pred_label, labels(suc)[1] as suc_label\n",
      "WHERE r IS NOT NULL\n",
      "WITH DISTINCT s, t, pred_label, suc_label\n",
      "// return the pairs 's' 't' where there should be a typing edge\n",
      "OPTIONAL MATCH (s)-[new_typing:typing]->(t)\n",
      "WHERE new_typing.tmp IS NOT NULL\n",
      "WITH pred_label, suc_label, s.id as s_id, t.id as t_id, new_typing\n",
      "WHERE new_typing IS NULL\n",
      "RETURN pred_label, suc_label, s_id, t_id\n",
      "\n",
      "// match all typing pairs between 'nugget_2' and 'action_graph'\n",
      "MATCH (s:nugget_2), (t:action_graph)\n",
      "WITH s, t\n",
      "// match all the predecessors of 's' and successors of 't'\n",
      "MATCH (pred), (suc)\n",
      "WHERE (pred)-[:typing*0..]->(s)\n",
      "\tAND (t)-[:typing*0..]->(suc)\n",
      "WITH s, t, collect(DISTINCT pred) as pred_list, collect(DISTINCT suc) as suc_list\n",
      "// select all the pairs 'pred' 'suc' with a path between\n",
      "UNWIND pred_list as pred\n",
      "UNWIND suc_list as suc\n",
      "OPTIONAL MATCH (pred)-[r:typing*]->(suc)\n",
      "WHERE NONE(rel in r WHERE rel.tmp = 'True')\n",
      "WITH s, t, r, labels(pred)[1] as pred_label, labels(suc)[1] as suc_label\n",
      "WHERE r IS NOT NULL\n",
      "WITH DISTINCT s, t, pred_label, suc_label\n",
      "// return the pairs 's' 't' where there should be a typing edge\n",
      "OPTIONAL MATCH (s)-[new_typing:typing]->(t)\n",
      "WHERE new_typing.tmp IS NOT NULL\n",
      "WITH pred_label, suc_label, s.id as s_id, t.id as t_id, new_typing\n",
      "WHERE new_typing IS NULL\n",
      "RETURN pred_label, suc_label, s_id, t_id\n",
      "\n"
     ]
    }
   ],
   "source": [
    "h.add_graph(\"nugget_1\", [], [])\n",
    "h.add_typing(\"nugget_1\", \"action_graph\", {})\n",
    "h.add_graph(\"nugget_2\", [], [])\n",
    "h.add_typing(\"nugget_2\", \"action_graph\", {})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1) Generation rule for nugget 1 (none of the nodes are typed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAIABJREFUeJzt3XlcV3Wi//H3hy+byOaWG5o7KAhI\naKjV8DPN3DWtbJsWJ++U5XRvttymrMnp1zLN/d0Za5q51ybnOi2aqVlpGeNyNUKFQFIQScVcMjdQ\nkO0L3/P7g2JEEcHgfIHv6/l4fB8F53PO933Mx3mcd+dzzjGWZQkAAAAA7OTl7gAAAAAAPA9FBAAA\nAIDtKCIAAAAAbEcRAQAAAGA7iggAAAAA21FEAAAAANiOIgIAAADAdhSRVsQYk2eMGX3e7xKNMYdq\nGbvRGPOLc35+yhiz3xhTZIw5ZIxZakdmAC3TD8ebkh+OGd8bYxYbYwLdnQtA83LeseLouceKH/79\nt+eN72WMsYwx3j/8HGaM+cAYc8IYc9oYs9MYc48bdgVNgCICGWPulnSXpNGWZQVKipf0D/emAtAC\nTPrhmBGnquPG027OA6B5+vFYEStpiKR/b8C6SyQdlHSlpA6qOl/5vtETwi283R0AzcJQSZ9ZlrVX\nkizLOirpv9wbCUBLYVnWYWPMWklR7s4CoPmyLOuoMeYzVRWS+hoq6V8tyzr7w8/pjZ8M7sIVEUhS\niqSfG2MeM8bEG2Mc7g4EoOUwxvSQNF6cIACogzEmTNI4Sd80YLUUSa8bY2YaY3o2TTK4C0XEM3Qz\nxhSc+5F0zY8LLcv6u6SHJY2VtEnSMWPME27KCqDlWPXD8WSLqo4d/9fNeQA0T6uMMYWqmmJ1TNKz\n5yybd975SeZ5694sabOkZyTtN8ZkGGOG2pIaTY4i4hmOWJYVeu5HVScO1SzLetuyrNGSQiX9UtIC\nY8xYd4QF0GJM/eGYcqVlWQ9allXi7kAAmqWplmUFSUqUFCGp4znLXj3v/CT63BUty8q3LOtJy7Ii\nJXWWlKGqYmNsyo4mRBFBDZZlOS3Lel9V/0eC+d4AAKBRWJa1SdJiSa9e5vonfli3m6T2jZcM7kIR\naX18jDH+P35UjwcSGGPuMcZMMMYEGWO8jDHjJEVK2trkaQEAgCf5T0ljjDEx9RlsjHnZGBNljPE2\nxgRJekDSN5ZlnWzSlLAFT81qfdac9/MX9VjnjKSnJP1dkkPSAUkPWJa1pc61AAAAGsCyrOPGmP+R\nNF9SYT1WCZC0UlJXSSWq+p+kk5suIexkLMtydwYAAAAAHoapWQAAAABsRxEBAAAAYDuKCAAAAADb\nUUQAAAAA2K5BT83q2LGj1atXryaKAqCh0tLSTliW1cndORqKYwnQ/HA8AdBY6ns8aVAR6dWrl1JT\nUy8/FYBGZYw54O4Ml4NjCdD8cDwB0FjqezxhahYAAAAA21FEAAAAANiOIgIAAADAdhQRAAAAALaj\niAAAAACwHUUEAAAAgO0oIgAAAABsRxEBAAAAYDuKCAAAAADbUUQAAAAA2I4iAgAAAMB2FBEAAAAA\ntqOIAAAAALAdRQQAAACA7SgiAAAAAGxHEQEAAABgO4oIAAAAANtRRAAAAADYjiICAAAAwHYUEQAA\nAA/Wq1cvRUREKDY2tvqTl5cnp9Op5557TuHh4YqMjFRMTIxmzJihrKwsSdLixYsVGhpaY72cnBxJ\nkjFG0dHRiomJUXR0tFavXl1nhpMnT2r8+PEKDw/X4MGDddNNN+n48eNNvu9wL293BwAAAIB7LV++\nXFFRUTV+d+edd6q4uFhbt25VaGioLMvSmjVrlJOTo0GDBkmSRo8ereXLl9e6zeTkZAUGBmrt2rW6\n5ZZblJ+fL2/v2k89jTF6/PHHlZiYKEl67LHH9OSTT+rNN99svJ1Es0MRAQAAQA25ublauXKlDh06\npNDQUElVZWHChAkN3lZiYqKKioqUn5+vTp061Tqmffv21SVEkhISEvTGG29cVna0HBQRAAAADzdj\nxgz5+/tLkry9vfX444+rf//+ateuXZ3rJSUlKTY2VpLUu3dvrVy58oIxK1eu1KhRoy5aQs7ncrn0\nxhtvaPLkyQ3cC7Q0FBEAAAAPd/7UrGXLltVYnpWVpdtvv13FxcUaN26c/vCHP0iqe2rWiBEjVFhY\nqKNHj2r9+vX1zvLwww8rMDBQDz300GXsCVoSblYHAABADUOGDFFubq4KCgokSYMGDVJGRobmzp2r\n06dP12sbycnJ2r9/vxYsWKCZM2eqtLT0kuvMmzdPubm5Wrp0qby8OE1t7fgvDAAAgBr69++vKVOm\n6P77769RPM6ePdvgbT366KPq3Lmz/vznP9c57qmnnlJaWppWrVolPz+/Bn8PWh6mZgEAAHi4c+8R\nkaRFixZp8eLFWrBggYYOHSofHx+1a9dO3bp105NPPtmgbRtj9Oqrr2rmzJn6l3/5F7Vp0+aCMbt2\n7dKLL76oAQMGaMSIEZIufs8JWg9jWVa9B8fHx1upqalNGAdAQxhj0izLind3jobiWAI0PxxPADSW\n+h5PmJoFAAAAwHZMzQIAAIAtnn/+ea1YseKC369bt05XXHGFGxLBnSgiAAAAsMX8+fM1f/58d8dA\nM8HULAAAAAC2o4gAAAAAsB1TswAAAPCTWGcK5fr0M+m776S2beU1ZrTMlT3dHQvNHEUEAAAAl8Vy\nuVT58qty/c8SyeGQioslX19V/v7/ycQNkfcf/1OmQ3t3x0QzxdQsAAAAXJbKJ56S6+9vS2VlVSVE\nksrLpbIyWalpck6bIevMGfeGRLNFEQEAAECDuXZkyrVmrVRSUvsAp1M6dkyV/7XI3mBoMSgiAAAA\naLDKN/9adSWkLuXlcv39bVkVFfaEQotCEQEAAECDWV+lSy7XpQc6K6TvjzV9ILQ4FBEAAAA0GZfL\nJUuWu2OgGaKIAAAAoMFMfLzkdelTSaeRVn/5pU6cOGFDKrQkFBEAAAA0mGPWvbJ8fesc4zRGm3v2\n0KGjR7VixQpt2bJFZZe6rwQegyICAACABstrG6C9kQPl8verdbnf/lwdC2yr7YMjlZaWpsOHD2vn\nzp1aunSp9uzZ02g5nnvuOc2bN6/Rtlebe+65R6+99tolxy1evLjGvq1evVqPPfZYU0Zr0SgiAAAA\naJD09HSlpKToitcXynvWfZK/vxQQUDVVy8+v6iMp+4l56tq/v2JiYnTq1Cmlp6fr+++/16ZNm1RQ\nUODmvfinikZ6qtf5RWTy5Mn63e9+1yjbbo0oIgAAAKiXyspKbdiwQXl5eZo6dao6de6sBWcKNMxb\nGpx/XB/+n+vk+PfH5ZP0qSQpIy9Pr7/+ul588UU5nU717NlT2dnZysjIUGJioqKjo3X99dfrm2++\nkSTl5ORo+PDhiomJUVRUlF599VVJVVc9brnlFo0aNUoRERGaPn26Tp8+XZ3r8OHDGj9+vCIiIjRh\nwgQV//ByxaKiIt17772KiopSVFSUXnnllep1EhMT9cgjjyghIUGTJ0/WnDlzapSG9PR0hYeHy7Jq\n3mj/j3/8Q8OHD9eQIUM0ePBgvffee5Kkt956S6mpqZo7d65iY2OVlJSkxYsXa8aMGdXrvvzyy9VZ\n7r33XhUVFVXv32233VbrPrRmFBEAAABcUklJiT7++GNVVlZq0qRJCggIkCQ5HA5lZGZq9fr1+uWK\nD3TyxrEy3btLkoKDg7Vjxw69//77WrFihbp06aLY2Fi9/fbbuvXWW7V06VLddtttuuOOOyRJf/rT\nnzR58mTt2LFDO3fu1KxZs6q/f/PmzXr33Xe1e/duhYSEaMGCBdXLUlNT9c477yg7O1tOp1Nvv/22\nJGnBggVyuVz6+uuvlZycrL/97W9au3Zt9Xr79u3Tli1btGbNGj300EP6y1/+Ul08XnvtNT344IMy\nxtT4c4iLi9OWLVuUnp6upKQkzZs3T/n5+br33nsVHx+vP/7xj8rIyNDo0aNrrLd27VotWbJEycnJ\n+vrrr1VZWVmvfWjNKCIAAACoU35+vlatWqXu3bvr+uuvl7e3d/WyH8tCeHi44uLilJKSUr1s5syZ\nkqSRI0fq+PHjmjRpkoKDgxUfH6/Zs2drz549at++vTIyMlRYWKjrrrtOixYt0jPPPKP169crNDS0\nelsTJ05U586dq79z/fr11cvGjh2r0NBQGWN09dVXa+/evZKkpKQk3X///TLGKDg4WLfddpuSkpKq\n17v99tur92XgwIHq06ePPv30U+Xn52v16tW65557LvizOH78uGbMmKGoqCiNHTtWp06dUk5OziX/\nDJOSkjRz5kwFBwfLGKPZs2fXyHKxfWjNKCIAAAC4qIMHD+qjjz5SfHy84uPjL7hCUBd/f39JVVdN\nJCkgIEAdOnSQJHXo0EGTJ0/WwIED5XK5lJKSokmTJmnz5s3q27evXnrpJd11110N+p4fv6u+93wE\nBgbW+Hnu3Ln605/+pL/+9a+66aabFBIScsE6DzzwgBITE/X1118rIyNDYWFhKi0trdf31eVy96El\no4gAAACgVrt27dKmTZt0ww03qH///rWOeeuttyRJubm5Sk9PV0JCQp3bTEhI0I4dO7R7924ZY5SS\nkqK4uDj5+/tr4cKFOnPmjO655x49++yz2rZtW/V6n3zyiY4fP179naNGjbpk/tGjR+vNN9+UZVkq\nLCzUe++9pzFjxlx0/Pjx45WTk6P/+I//0Jw5c2odU1BQoF69eskYo88//7z6/hapairaufeunJ9l\n6dKlKiwslGVZWrRoUZ1ZPIH3pYcAAADAk7hcLn355Zc6cuSIpkyZoqCgoIuOraio0JAhQ1RcXKy/\n/OUvuuKKK+rcdqdOnbRkyRLdfvvtqqioUKdOnfT222+rX79+Wrt2rcaMGSMfHx8FBQXpD3/4Q/V6\n1157rWbOnKnDhw9r0KBB+v3vf3/J/XjmmWf00EMPafDgwZKku+66SzfeeONFx3t5eenuu+/W2rVr\nFR0dXeuYl156SQ8++KCeffZZDR06tMa42bNn69FHH9Xvfve76hvtfzRu3DhlZmZq+PDhkqT4+Hg9\n/fTTl9yH1syc/ySAusTHx1upqalNGAdAQxhj0izLind3jobiWAI0PxxP8KPy8nIlJSXJGKPrr79e\nvnW8tNAYo8LCwgumOP0UlmUpOztbqampGjBggK666iq98MILKioquuDkvimMGTNGs2fP1s0339zk\n39Va1fd4wtQsAAAASJLOnDmjVatWKTQ0VGPHjq2zhDQVY4wGDRqkm2++WaWlpVq2bJny8/Ob/HtT\nU1PVt29fhYSEaPr06U3+fWBqFgAAACQdPXpUSUlJiouL06BBg+q1TkNm1jRUmzZtlJiYqO+++06+\nvr5q27atTp8+XesN5I0hPj7eI55U1ZxwRQQAAMDD7dmzR+vWrVNiYmK9S4hdunbtqunTpyssLEwf\nfvihUlNTPeKJUp6AIgIAAOChLMvStm3b9NVXX2nSpEkKCwtzd6RaeXl5KTo6WtOnT1dBQYHef/99\nffvtt+6OhZ+IIgIAAGCT2NhYlZSUXHR5Xl6eOnbs+JO/pz7bqaioUFJSko4ePaqpU6eqXbt2P/l7\nm1rbtm01evRoXXvttUpOTta6detUVFTk7li4TBQRAAAAm2RkZKhNmzbujqHi4mKtXr1aPj4+mjBh\nQo2X6bUEYWFhuvnmm9WxY0etWLFCGRkZcrlc7o6FBqKIAAAA2MQYo6KiIrlcLj344IOKiIhQTEyM\nRo4cWWPco48+qujoaA0ePFibN2+W9M+rHL/+9a81ZMgQhYeHa8uWLdXrvP766+rXr5/i4uL05ptv\nXjTDiRMntHLlSvXp00eJiYnVbz1vaRwOh+Li4jR16lQdPXpUy5cv15EjR2qM2b2vWHN+843Crt2q\nDkOT1ff67Vrw+gF9f6LcTalxLooIAACAzXbs2KENGzYoKytLO3bs0Mcff1y97OTJk4qJiVFmZqYW\nLlyo2267TWVlZdXLhg8frvT0dM2fP19PPPGEJCkzM1MvvPCCvvjiC3311Vc6efJkrd+bl5enNWvW\naMSIEYqNjW36HbVBcHCwbrzxRg0bNkwbN27U+vXrVVxcrPc+OabEOzP17sfHVHi2UhWV0ol8pxYu\nOaL4m9L1VRZTutyNIgIAAGCzPn36yOl0atasWVqyZEmNZb6+vrrzzjslSYmJiWrTpo1ycnIkSYGB\ngZo4caIkKSEhofpxsxs3btSECRPUuXNnSVVv+D5fRkaGvvjiC40fP169e/dusn1zl169eumWW25R\nYGCgfv/aR5q74BuVlLpUWVlzXFm5pTNFlZryy106ddrpnrCQRBEBAACwXUhIiHbt2qWZM2cqMzNT\nkZGROnr06CXX8/Pzq/53h8NRr8fYulwubdy4Ufv27dPUqVMb5Wb45srb21vDhg1TxoGBKiuv+x0n\nzgpLf//wmE3JUBuKCAAAgM2OHz+u4uJijR07Vi+99JJCQkK0b98+SVJ5ebneeecdSdLmzZtVUlKi\niIiIOreXmJioNWvW6NixqhPrH+8RKS0t1SeffKLy8nJNnjxZbdu2bcK9ah5Ky1zatP2sJFPnuJJS\nl9764Ht7QqFWvFkdAADAZgcPHtT999+viooKVVRUaNy4cUpISNC3336rDh06KCMjQ6+88oosy9K7\n774rX1/fOrcXHR2tp556SiNHjlRwcLDGjx8vy7K0atUq9enTR0OHDpUxdZ+YtxZniirkcEjOerzz\nkKlZ7kURAQAAsIllVU0XiouLU1pa2gXLe/XqpRMnTtS67vnLzv95zpw5mjNnjiTp8OHDGjBggOLi\n4jRgwIDG3IVmL6it44L7Qi4mNJhTYXdiahYAAEALV1FRofLyqkfSZmVlaf369Ro9erTHlRBJauPv\n0M+GhehSF4Da+BndPbWzPaFQK2ogAABAC3b27Fl99tln8vPzU0hIiI4cOaIpU6YoODjY3dHc5on7\ne+iLr86opPTiLzn09vbS3dMoIu7EFREAAIAW6seXEx49elSfffaZvvzyS48vIZI0LCZIL8/rrTb+\nXvI672zXy1TKz6dSixZ0UYd2Pu4JCEkUEQAAgBZp//79Wr16tU6dOqUdO3bIz89PQUFB+vbbb90d\nrVm4+6bO+uyvUZo2poP8fI0kS/4+FerTYZcemb5b/trv7ogej6lZAAAALUxGRoa2bdumM2fOKCsr\nSz169FD37t3Vs2dP9erVy93xmo2YiED99cVwSVJe3gGtW/eZsrNzVF4cor17vZSQkCB/f383p/Rc\nFBEAAIBm6vujx3Xs+5MKCQ1Szyu7q7KyUps3b9aePXt07Ngx7d27V+Hh4Wrfvr2io6N19dVXe8xj\nehvqyit7KigoSF27dtXevXsVFxen0tJSiogbUUQAAACamY0bvtSCZ/9TGelZ8vXzlbPcqZ5XdtPY\n8SPUq09nHThwQMeOHVN0dLSCgoJ0zTXXXPKlh57OGKPo6Gj16NFDHTt21NChQxUaGuruWB6NIgIA\nANCM/O2t9zXvkd+qpKRUklRWVvVY3j05+7V//0FFDOqhIfF9FBsbq8DAQN1www3q1q2bOyO3GJGR\nkZKkdu3aadeuXerataubE3k2blYHAABoJvbk7KtRQs7nLK9Q9s5v5eMdpI4dO2ratGmUkMvQv39/\nHTp0SMXFxe6O4tEoIgAAAM3E6wv/Jqezos4xFRWV+mLTDk2dOlUhISE2JWtdfH191bdvX+3evbtR\ntvfcc89p3rx5jbItT0IRAQAAaCY+XLlOFRV1FxFJyt1zQF7nvyADDRIZGans7Gy5XBd/6SGaFveI\nAAAANBNlpeX1Gufl5aWSkjL5+vo2caLWxxij3/72t1q1apUOHjwoSdq5c6c+/fRTOZ1Ovf/++xo4\ncKAk6eWXX9aSJUskSUOHDtXChQsVGBio06dPa9asWdq5c6e6dOmiHj16qHNn3tLeUFRpAACAZqJr\ntyvqNc7Hx0dBQW2bOE3rFRoaqu3bt+vXv/61fvGLX2jkyJFKT0/Xz3/+c73wwguSpLVr12rJkiVK\nTk7W119/rcrKSi1YsECS9Pzzzys4OFi7d+/W8uXLtWnTJnfuTotFEQEAAGgm5jz8c7Vt26bOMT4+\n3rrr7puYmvUT3HrrrZKksWPHSpKuueYaSdJVV12lb775RpKUlJSkmTNnKjg4WMYYzZ49W0lJSZKk\nDRs2aNasWZKkjh076qabbrJ7F1oF/gYDAAA0EzPvmKLQ0OA6S4a3j7d+9W+zbEzV+vz4EkNfX1/5\n+fkpKytLkuRwOOp1jw4aB0UEAACgmWjbNkCfb3xX3cO6KDCw5tQrb2+H/Px99Ms50xXQ1s9NCVsf\nh8Oh3NzcCwrI6NGjtXTpUhUWFsqyLC1atEhjxoyRJI0aNUpvvfWWJOnkyZNauXKl7blbA25WBwAA\naEZ6Xtldmdnr9PHqf+i/3nhb3313TC5XhWLi+kleJerctb1SUlI0ceJEd0dtFYwx6tKlS/WUrB+N\nGzdOmZmZGj58uCQpPj5eTz/9tCTpmWee0X333aeIiAh16dJF1113ne25WwNjWVa9B8fHx1upqalN\nGAdAQxhj0izLind3jobiWAI0PxxPmrdDhw5pzZo12rt3ryzLUr9+/TR27FhdeeWV7o7WKhw6dEhb\nt27V9OnT3R2lVajv8YSpWQAAAM1cWFiYwsLC1LNnTx0/flzFxcXaunUr78BoJN27d5fT6dSxY8fc\nHcWjUEQAAABagISEBPn6+qpHjx7av3+/CgoKGu3N4J7OGKNBgwZp165d7o7iUSgiAAAALUD79u0V\nHh6ubt266ezZsyooKFBqaqrKy+v3EkTULTw8XAcOHFBpaam7o3gMiggAAEALER8fL19fX/Xu3Vv7\n9u1TSUmJ8vLy3B2rVfDz81Pv3r25ymQjiggAAEALERAQoJiYGHXq1EkhISGKjIzUgAED3B2r1Rg0\naJCys7PVkIc54fLx+F4AAIAWJCYmRiEhIZo0aZI2bNigiooKeXtzStcYOnXqJH8/Px1N3aTO5ack\nyyXTbYDUe7CMMe6O1+rwtxYAAKAF8fb2Vr9+/SRVnTjv3LlTsbGxbk7VOliH9ujGPSvk9VW+LCNJ\nliyHj9QmUF7T58n0G+LuiK0KU7MAAABaqKuvvlqZmZkqKSlxd5QWzzq0R67/niffM8fk7XJKlU6p\nskIqL5FOH5dryXxZua3/nTV2oogAAAC0UMHBwerfv7/S0tLcHaXFc73/suSs44lZzjK5lr0sy1Vp\nX6hWjiICAADQgg0ZMkT79u1TQUGBu6O0WNahPVLB8UsPdJZLe7Y3fSAPQREBAABowfz9/RUbG6ut\nW7e6O0qLZR3cLVn1eEt9eYlcB7KaPpCHoIgAAAC0cJGRkTp16pSOHDni7igtlPXDpz5DebRvY6GI\nAAAAtHAOh0PDhg1TSkoK78C4DKZbP7lUj8fz+raRV1h40wfyEBQRAACAVqBv377y8vLSN9984+4o\nLc6eEoeK5HPpgQ6HNHB40wfyEBQRAACAViIhIUHbt29XRUWFu6O0GNnZ2dr0v/+rj33DVeaq46qI\nj5+8bvo3GYfDvnCtHEUEAACglejSpUv1Sw5bk169eikiIkIxMTGKiorSe++9p40bNyo+Pr56zLZt\n2xQWFqaPP/643ts9dOiQNm/erJMnT2r93u+1OuQqFTv85fL2++cg3zZSmyB53fqkTOQ1jblbHo83\nqwMAALQiV199tVatWqWIiAj5+/u7O06jWb58uaKiopSenq4RI0ZoyZIl1cvWr1+vu+66S++8845+\n9rOf1Xub3bt3V0BAgFJSUhQVFaWikBCdvP4XutJ5Sta32bIsl7y695PCE7gS0gQoIgAAAK1IcHCw\n+vXrp7S0NI0cOdLdcRrdkCFDFBQUpP3790uSPvroIz3wwAP68MMPa1whqY+9e/fK5XJpwoQJKigo\n0JgxY9SzZ09JfWQGNGxbaDiKCAAAQCsTFxenZcuWKTIyUqGhoe6O06g2bNig0tJS9e/fX7m5ubrj\njjv05ZdfKjIyskHb2bNnj7Zt26aJEycqNDRUJ0+eVKdOnZooNWrDPSIAAAAt0I/3TcTGxlZ/8vLy\n5HQ69dJLL2n+/PmKiYlRTEyMZsyYoaysqhfxLV68WKGhoTXWy8nJkSQZYxQdHa2YmBhFR0dr9erV\nl8wxb9489e7dW8aYJr03ZcaMGYqNjdWzzz6rDz74QKGhoeratasGDhyoP//5zw3aVnZ2trZv366J\nEyeqffv28vLyooS4AVdEAAAAWqgf75s415133qni4mKlpaVp3bp1uu6665SRkaGcnBwNGjRIkjR6\n9GgtX7681m0mJycrMDBQa9eu1S233KL8/Hx5e1/8lHHq1Kn61a9+pWuvvbbxdqwW5+/rxo0bFRgY\nqHXr1mnMmDF6+OGHtXDhwktuZ+fOncrMzNSkSZMUHBzclJFxCRQRAACAViI3N1crV67UoUOH1K5d\nOw0bNkxbt27VtGnTZEw9Xth3jsTERBUVFSk/P7/OqwXXXOPeJ0mFhITo888/r1cZyczMVFZWliZP\nnqzAwEAbU6I2TM0CAABooX6crhQbG6v4+Hilp6erf//+ateunaR/vuRw7969NdZLSkqqXm/atGm1\nbnvlypUaNWpUi5iyFBISonXr1iklJUUPP/xwrWO++uorZWdna9KkSZSQZoIrIgAAAC3U+dOVli1b\nVmN5VlaWnn76aZ08eVIzZsyovlpQ19SsESNGqLCwUEePHtX69eubLnwD5OXlXfC7xMREpaamVv8c\nGhqq7du317p+amqq9u/fr0mTJikgIKCpYqKBuCICAADQSgwZMkS5ubkqKCiQJA0aNEg7d+7U9OnT\ndeDAgXptIzk5Wfv379eCBQs0c+ZMlZaWNmXkJrd161bl5eVRQpohiggAAEAr0b9/f02ZMkX333+/\nTp8+Xf37Tp06KT8/v0Gl4tFHH1Xnzp0b/ESq5iQ5OVmHDx/WxIkTW9XLHVsLiggAAEALde49IrGx\nsUpNTdXixYsVERGhoUOHKjIyUtdcc4127dql++67T2lpafXetjFGr776ql555RWVlJRcdNzcuXMV\nFhamQ4cOafTo0Q1+n0dTsCzhgdS9AAAF1UlEQVRLmzdv1rFjxyghzZixLKveg+Pj461z5+IBcC9j\nTJplWS3u1a8cS4Dmh+NJ61daWqply5Zp8uTJre4lh+eyLEubNm3SmTNnNG7cOPn4+Lg7ksep7/GE\nKyIAAAAewN/fXzExMdq2bZu7ozQZl8ulDRs2qKioSOPHj6eENHM8NQsAAMBDREVFKSsrS9999526\ndu1a7/Wef/55rVix4oLfr1u3TldccUVjRrwky1Uoq3yfZJVLXsEyvn1ljLdcLpfWr18vp9OpG2+8\nsc6XMKJ54L8QAACAh3A4HBo2bJhSUlI0derUer/kcP78+Zo/f34Tp6ub5SqVq+hjWc79qprU45Lk\nqFroP1z/2HJaktENN9wgh8PhvqCoN6ZmAQAAeJC+ffvKGHPBSw6bM8tVpsrTf/uhhFRKcv7wz3JJ\n5ao4u1n9wr7TmDFjKCEtCEUEAADAwyQkJGjbtm2qqKhwd5R6cZV8KbnOqKp8XMjb4dKVXU7KWPn2\nBsNPwtQsAAAAD9OlSxe1979C//vvOTq7uq3KjlfKy8+o27i2Cn8kVO2i/dwdsZplVcoqS9fFSsg/\nueQq2S5H4I12xEIj4IoIAACAhynMLVfJv/bR8UU+KjlcKVe5VFFo6eAHRVp//WHlvlHg7ojVrMoC\nWZarHiNdspzfNnkeNB6uiAAAAHiQyjJLG248IucpS8aqeT+FVSlVlljKnH9KQQN81eX6ALlcLpWV\nlam0tFSlpaVyOByX/aQsy7JUXl5eva1zt3uxj59PsSaPqpBPvc5a6/9+PLgfRQQAAMCDHFpVpIqz\nrjrP2StLLG16JFclj6arvLy8xrKuXbtq0qRJkiSn03nJInHup6ysTN7e3vL396/1ExwcfMHvfH0d\ncuX/UVU3qNfFyHh3+2l/OLAVRQQAAMCDfPPfp1VRdOkrB9a3bXRw53cq8S1URUWFnE6nnE6ncnJy\ndPr0aZWWlsrLy+uipaJDhw61/t7Lq+F3Blh+g2WVZajqkb0X45BXm6EN3jbchyICAADgQcqOXeqm\n7yourwpV5BuZLkYBAQHy8fGRt7e3goODNW3aNPn7+9v2qFyvgJGqLM+RrGLVfinHW8Y3Qsa7iy15\n0DgoIgAAAB7Et71D2nfpx/Y6LG+FhXeVFdpe/v7+8vPzk7+/v9q0aaO2bdvakPSfjFdbOULuVmXh\nCqnyhKqeoGWp6lTWkvGPlVfAKFsz4aejiAAAAHiQPvcF60z2CVWcrXt6VnC4r6bMvVV+fn71fgN7\nUzKOYHmH3iOr4phc5Xskq1zGESrjO1DGq4274+EyUEQAAAA8SM8Zgcp85qRURxFxBBhFz+8kf39/\nG5PVj/G+Qg7vy3tqF5oX3iMCAADgQbwDvJT4STf5hHjJ6/z3FpqqEhLxb6HqPsHe6VfwPBQRAAAA\nDxMa5acb03powEOh8gn1koxkvKUuNwToupVdFflke3dHhAdgahYAAIAHatPFW9G/6aDo33SQq8KS\ncahZ3AsCz0ERAQAA8HBe3hQQ2I+pWQAAAABsRxEBAAAAYDuKCAAAAADbUUQAAAAA2I4iAgAAAMB2\nFBEAAAAAtqOIAAAAALAdRQQAAACA7SgiAAAAAGxHEQEAAABgO4oIAAAAANtRRAAAAADYjiICAAAA\nwHYUEQAAAAC2o4gAAAAAsB1FBAAAAIDtKCIAAAAAbEcRAQAAAGA7iggAAAAA21FEAAAAANiOIgIA\nAADAdhQRAAAAALajiAAAAACwHUUEAAAAgO0oIgAAAABsRxEBAAAAYDuKCAAAAADbUUQAAAAA2I4i\nAgAAAMB2FBEAAAAAtqOIAAAAALAdRQQAAACA7SgiAAAAAGxnLMuq/2Bjjks60HRxADTQlZZldXJ3\niIbiWAI0SxxPADSWeh1PGlREAAAAAKAxMDULAAAAgO0oIgAAAABsRxEBAAAAYDuKCAAAAADbUUQA\nAAAA2I4iAgAAAMB2FBEAAAAAtqOIAAAAALAdRQQAAACA7f4/7DIKrQBbi3IAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "rule1 = Rule.from_transform(nx.DiGraph())\n",
    "# inject node addition\n",
    "rule1.inject_add_nodes_from([\n",
    "    (\"EGFR_1\", {\"uniprotid\": \"P00533\"}),\n",
    "    (\"EGFR_2\", {\"uniprotid\": \"P00533\"}),\n",
    "    (\"isbnd\", {\"type\": \"be\", \"test\": True}),\n",
    "    (\"PK\", {\"name\": \"Protein kinase\"}),\n",
    "    (\"mod\", {\"value\": True}),\n",
    "    (\"phosphorylation\", {\"name\": \"phosphorylation\", \"test\": False})\n",
    "])\n",
    "rule1.inject_add_edges_from([\n",
    "    (\"EGFR_1\", \"isbnd\"),\n",
    "    (\"EGFR_2\", \"isbnd\"),\n",
    "    (\"PK\", \"EGFR_1\", {\"start\": 100, \"end\": 600}),\n",
    "    (\"PK\", \"mod\"),\n",
    "    (\"mod\", \"phosphorylation\"),\n",
    "    (\"phosphorylation\", \"EGFR_2\")\n",
    "])\n",
    "\n",
    "plot_rule(rule1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rhs_typing1 = {\n",
    "    \"meta_model\": {\n",
    "        \"EGFR_1\": \"gene\",\n",
    "        \"EGFR_2\": \"gene\",\n",
    "        \"PK\": \"region\",\n",
    "        \"phosphorylation\": \"state\",\n",
    "        \"isbnd\": \"bnd\",\n",
    "        \"mod\": \"mod\"\n",
    "    }\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Empty instance \n",
      "\n",
      "// Adding node 'PK' from the rhs \n",
      "CREATE (rhs_PK:nugget_1) \n",
      "SET rhs_PK.id = toString(id(rhs_PK)) \n",
      "WITH toString(id(rhs_PK)) as rhs_PK_id , rhs_PK\n",
      "\n",
      "\n",
      "// Adding node 'phosphorylation' from the rhs \n",
      "CREATE (rhs_phosphorylation:nugget_1) \n",
      "SET rhs_phosphorylation.id = toString(id(rhs_phosphorylation)) \n",
      "WITH toString(id(rhs_phosphorylation)) as rhs_phosphorylation_id , rhs_phosphorylation, rhs_PK, rhs_PK_id\n",
      "\n",
      "\n",
      "// Adding node 'EGFR_1' from the rhs \n",
      "CREATE (rhs_EGFR_1:nugget_1) \n",
      "SET rhs_EGFR_1.id = toString(id(rhs_EGFR_1)) \n",
      "WITH toString(id(rhs_EGFR_1)) as rhs_EGFR_1_id , rhs_PK, rhs_phosphorylation, rhs_EGFR_1, rhs_phosphorylation_id, rhs_PK_id\n",
      "\n",
      "\n",
      "// Adding node 'EGFR_2' from the rhs \n",
      "CREATE (rhs_EGFR_2:nugget_1) \n",
      "SET rhs_EGFR_2.id = toString(id(rhs_EGFR_2)) \n",
      "WITH toString(id(rhs_EGFR_2)) as rhs_EGFR_2_id , rhs_EGFR_2, rhs_PK, rhs_EGFR_1_id, rhs_phosphorylation, rhs_EGFR_1, rhs_phosphorylation_id, rhs_PK_id\n",
      "\n",
      "\n",
      "// Adding node 'isbnd' from the rhs \n",
      "CREATE (rhs_isbnd:nugget_1) \n",
      "SET rhs_isbnd.id = toString(id(rhs_isbnd)) \n",
      "WITH toString(id(rhs_isbnd)) as rhs_isbnd_id , rhs_EGFR_2, rhs_PK, rhs_EGFR_1_id, rhs_phosphorylation, rhs_EGFR_1, rhs_isbnd, rhs_phosphorylation_id, rhs_PK_id, rhs_EGFR_2_id\n",
      "\n",
      "\n",
      "// Adding node 'mod' from the rhs \n",
      "CREATE (rhs_mod:nugget_1) \n",
      "SET rhs_mod.id = toString(id(rhs_mod)) \n",
      "WITH toString(id(rhs_mod)) as rhs_mod_id , rhs_EGFR_2, rhs_PK, rhs_EGFR_1_id, rhs_phosphorylation, rhs_EGFR_1, rhs_isbnd, rhs_isbnd_id, rhs_mod, rhs_phosphorylation_id, rhs_PK_id, rhs_EGFR_2_id\n",
      "\n",
      "\n",
      "// Adding properties to the node 'EGFR_1' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'uniprotid' IN keys(rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_EGFR_1.uniprotid = ['P00533'])\n",
      "FOREACH(dummy IN CASE WHEN 'uniprotid' IN keys(rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['P00533'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_EGFR_1.uniprotid THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_EGFR_1.uniprotid = rhs_EGFR_1.uniprotid + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'EGFR_2' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'uniprotid' IN keys(rhs_EGFR_2) THEN [1] ELSE [] END |\n",
      "\tSET rhs_EGFR_2.uniprotid = ['P00533'])\n",
      "FOREACH(dummy IN CASE WHEN 'uniprotid' IN keys(rhs_EGFR_2) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['P00533'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_EGFR_2.uniprotid THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_EGFR_2.uniprotid = rhs_EGFR_2.uniprotid + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'isbnd' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'type' IN keys(rhs_isbnd) THEN [1] ELSE [] END |\n",
      "\tSET rhs_isbnd.type = ['be'])\n",
      "FOREACH(dummy IN CASE WHEN 'type' IN keys(rhs_isbnd) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['be'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_isbnd.type THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_isbnd.type = rhs_isbnd.type + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'test' IN keys(rhs_isbnd) THEN [1] ELSE [] END |\n",
      "\tSET rhs_isbnd.test = [True])\n",
      "FOREACH(dummy IN CASE WHEN 'test' IN keys(rhs_isbnd) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [True] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_isbnd.test THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_isbnd.test = rhs_isbnd.test + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'PK' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_PK) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK.name = ['Protein kinase'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_PK) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Protein kinase'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK.name = rhs_PK.name + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'mod' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'value' IN keys(rhs_mod) THEN [1] ELSE [] END |\n",
      "\tSET rhs_mod.value = [True])\n",
      "FOREACH(dummy IN CASE WHEN 'value' IN keys(rhs_mod) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [True] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_mod.value THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_mod.value = rhs_mod.value + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'phosphorylation' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tSET rhs_phosphorylation.name = ['phosphorylation'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['phosphorylation'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_phosphorylation.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_phosphorylation.name = rhs_phosphorylation.name + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'test' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tSET rhs_phosphorylation.test = [False])\n",
      "FOREACH(dummy IN CASE WHEN 'test' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [False] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_phosphorylation.test THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_phosphorylation.test = rhs_phosphorylation.test + [val])))\n",
      "\n",
      "\n",
      "// Adding edge 'EGFR_2->isbnd' from the rhs \n",
      "MERGE (rhs_EGFR_2)-[rhs_EGFR_2_rhs_isbnd:edge]->(rhs_isbnd)\n",
      "\n",
      "\n",
      "// Adding edge 'PK->EGFR_1' from the rhs \n",
      "MERGE (rhs_PK)-[rhs_PK_rhs_EGFR_1:edge]->(rhs_EGFR_1)\n",
      "\n",
      "\n",
      "// Adding edge 'mod->phosphorylation' from the rhs \n",
      "MERGE (rhs_mod)-[rhs_mod_rhs_phosphorylation:edge]->(rhs_phosphorylation)\n",
      "\n",
      "\n",
      "// Adding edge 'EGFR_1->isbnd' from the rhs \n",
      "MERGE (rhs_EGFR_1)-[rhs_EGFR_1_rhs_isbnd:edge]->(rhs_isbnd)\n",
      "\n",
      "\n",
      "// Adding edge 'phosphorylation->EGFR_2' from the rhs \n",
      "MERGE (rhs_phosphorylation)-[rhs_phosphorylation_rhs_EGFR_2:edge]->(rhs_EGFR_2)\n",
      "\n",
      "\n",
      "// Adding edge 'PK->mod' from the rhs \n",
      "MERGE (rhs_PK)-[rhs_PK_rhs_mod:edge]->(rhs_mod)\n",
      "\n",
      "\n",
      "// Adding properties to an edge 'PK'->'EGFR_1' from the rhs \n",
      "WITH rhs_mod_id, rhs_EGFR_2, rhs_PK, rhs_EGFR_1_id, rhs_phosphorylation, rhs_EGFR_1, rhs_isbnd, rhs_isbnd_id, rhs_mod, rhs_phosphorylation_id, rhs_PK_id, rhs_EGFR_2_id, rhs_PK_rhs_EGFR_1 \n",
      "FOREACH(dummy IN CASE WHEN NOT 'start' IN keys(rhs_PK_rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK_rhs_EGFR_1.start = [100])\n",
      "FOREACH(dummy IN CASE WHEN 'start' IN keys(rhs_PK_rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [100] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK_rhs_EGFR_1.start THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK_rhs_EGFR_1.start = rhs_PK_rhs_EGFR_1.start + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'end' IN keys(rhs_PK_rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK_rhs_EGFR_1.end = [600])\n",
      "FOREACH(dummy IN CASE WHEN 'end' IN keys(rhs_PK_rhs_EGFR_1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [600] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK_rhs_EGFR_1.end THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK_rhs_EGFR_1.end = rhs_PK_rhs_EGFR_1.end + [val])))\n",
      "WITH rhs_mod_id, rhs_EGFR_2, rhs_PK, rhs_EGFR_1_id, rhs_phosphorylation, rhs_EGFR_1, rhs_isbnd, rhs_isbnd_id, rhs_mod, rhs_phosphorylation_id, rhs_PK_id, rhs_EGFR_2_id, rhs_PK_rhs_EGFR_1 \n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_mod_id, rhs_EGFR_2, rhs_PK, rhs_EGFR_1_id, rhs_phosphorylation, rhs_EGFR_1, rhs_isbnd, rhs_isbnd_id, rhs_mod, rhs_phosphorylation_id, rhs_PK_id, rhs_EGFR_2_id, rhs_PK_rhs_EGFR_1\n",
      "\n",
      "// Checking consistency of introduced rhs\n",
      "MATCH (G:hierarchyNode)\n",
      "WHERE G.id = 'nugget_1'\n",
      "OPTIONAL MATCH (t_i:hierarchyNode)\n",
      "WHERE (t_i)<-[:hierarchyEdge*1..]-(G)-[:hierarchyEdge*1..]->(t_i)\n",
      "WITH DISTINCT t_i\n",
      "RETURN collect(t_i.id)\n",
      "\n",
      "// Replacing ':tmp_typing' with ':typing'\n",
      "MATCH (n:nugget_1)-[t:tmp_typing]->(m)\n",
      "OPTIONAL MATCH (:hierarchyNode {id: 'nugget_1'})-[skeleton_rel:hierarchyEdge]->(:hierarchyNode {id: labels(m)[0]}) \n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [] ELSE [1] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:typing]->(m)\n",
      ")\n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [1] ELSE [] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:transitive_typing]->(m)\n",
      ")\n",
      "\n",
      "// Addition of nodes and properties in 'action_graph'\n",
      "MATCH (n:nugget_1)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:action_graph)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:nugget_1)-[trans_type:transitive_typing]->(successor_node:action_graph)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:action_graph)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, nodes_to_merge_props, node_img\n",
      "SET node_img += new_props\n",
      "\n",
      "\n",
      "// Addition of edges and properties in 'action_graph'\n",
      "MATCH (n:nugget_1)-[rel:edge]->(m:nugget_1), (n)-[:typing]->(x:action_graph), (m)-[:typing]->(y:action_graph)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, x, y, rel_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, x, y, rel_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, x, edges_to_merge_props, y, rel_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, x, edges_to_merge_props, y, rel_img\n",
      "SET rel_img += new_props\n",
      "\n",
      "// Addition of nodes and properties in 'meta_model'\n",
      "MATCH (n:action_graph)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:meta_model)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:nugget_1)-[trans_type:transitive_typing]->(successor_node:meta_model)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:meta_model)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, nodes_to_merge_props, node_img\n",
      "SET node_img += new_props\n",
      "\n",
      "\n",
      "// Addition of edges and properties in 'meta_model'\n",
      "MATCH (n:action_graph)-[rel:edge]->(m:action_graph), (n)-[:typing]->(x:meta_model), (m)-[:typing]->(y:meta_model)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, x, y, rel_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, x, y, rel_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, x, edges_to_merge_props, y, rel_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, x, edges_to_merge_props, y, rel_img\n",
      "SET rel_img += new_props\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g1 = h.rewrite(\"nugget_1\", rule1, {}, rhs_typing=rhs_typing1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3) Merge two nodes in the action graph (to avoid gene duplication)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAFVxJREFUeJzt3XtsVOedxvHnHY/BBkPHBtvBMcFu\nYnBt4guXbESp5BAaatCGLPEiirJsVwKliRJnoxBgky5FcTcRldUuKBW5tJKbTVUly+KUbaGhLEu6\nDS1bk5CQOHWccmnNzQZs4iu2x+/+YfCCwfYMtd+Z8Xw/0kjMzHvO/A7J+XGeOe85Y6y1AgAAAACX\nPKEuAAAAAED0IYgAAAAAcI4gAgAAAMA5gggAAAAA5wgiAAAAAJwjiAAAAABwjiACAAAAwDmCyChi\njDlujFnY77UiY0zdDcbuN8asvur5M8aYY8aYFmNMnTHmDRc1A4hMl/tN++WecdYYU2GMSQh1XQDC\nS79ecebqXnH5z9/pNz7DGGONMd7Lz9ONMf9hjDlnjLlojPnIGPONEGwKRgBBBDLG/L2kv5O00Fqb\nIGmOpP8KbVUAIsBfX+4Zs9TbN74V4noAhKcrvaJAUqGkfwpi2X+T9GdJ0yRNUu/xytlhrxAh4Q11\nAQgLcyW9ba39oyRZa89IeiW0JQGIFNbak8aY3ZJmhroWAOHLWnvGGPO2egNJoOZKetJa23r5+fvD\nXxlChTMikKTfSVpljHnaGDPHGBMT6oIARA5jzFRJi8UBAoBBGGPSJRVL+iyIxX4n6QfGmBXGmNtG\npjKECkEkOqQZY5qufkiaf+VNa+3rkh6XtEjSO5LqjTHrQ1QrgMjx1uV+8hv19o7nQ1wPgPD0ljGm\nWb1TrOolffuq99b2Oz75sN+yfyvpfyT9s6RjxpjDxpi5TqrGiCOIRIdT1lrf1Q/1Hjj0sdb+xFq7\nUJJP0jcllRljFoWiWAAR44HLPWWatfZRa217qAsCEJYesNZOkFQkKVvS5KveK+93fJJ39YLW2kZr\n7QZrba6kVEmH1RtsjKPaMYIIIriGtbbLWvvv6v1GgvneAABgWFhr35FUIan8Jpc/d3nZNElJw1cZ\nQoUgMvrEGmPirjwUwA0JjDHfMMYsMcZMMMZ4jDHFknIlHRzxagEAQDT5V0lfNcbkBzLYGLPZGDPT\nGOM1xkyQ9Iikz6y150e0SjjBXbNGn139nr8bwDKfS3pG0uuSYiSdkPSItfY3gy4FAAAQBGttgzHm\nNUkbJTUHsMg4SZWSpkhqV++XpPePXIVwyVhrQ10DAAAAgCjD1CwAAAAAzhFEAAAAADhHEAEAAADg\nHEEEAAAAgHNB3TVr8uTJNiMjY4RKARCsQ4cOnbPWJoe6jmDRS4DwQz8BMFwC7SdBBZGMjAxVVVXd\nfFUAhpUx5kSoa7gZ9BIg/NBPAAyXQPsJU7MAAAAAOEcQAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAA\nAAA4RxABAAAA4BxBBAAAAIBzBBEAAAAAzhFEAAAAADhHEAEAAADgHEEEAAAAgHMEEQAAAADOEUQA\nAAAAOEcQAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4RxABAAAA4BxBBAAAAIBzBBEAAAAAzhFE\nAAAAADhHEAEAAADgHEEEAAAAgHMEEQAAAADOEUQAAAAAOEcQAQAAAOAcQQQAAACAcwQRAAAAAM4R\nRAAAAAA4RxABAAAA4BxBBAAAAIBzBBEAAAAAzhFEAAAAADhHEAEAAADgHEEEAAAAgHMEEQAAAADO\nEUQAAAAAOEcQAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4RxABAAAA4BxBBAAAAIBzBBEAAAAA\nzhFEAAAAADhHEAEAAADgHEEEAAAAgHMEEQAAAADOEUQAAAAAOEcQAQAAAOAcQQQAAACAcwQRAAAA\nAM4RRAAAAAA4RxABAAAA4BxBBAAAAIBzBBEAAAAAzhFEAAAAADhHEAEAAADgHEEEAAAAgHMEEQAA\nAADOEUQAAAAAOEcQAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4RxABAAAA4BxBBAAAAIBzBBEA\nAAAAzhFEAAAAADhHEAEAAADgHEEEAAAAgHMEEQAAAADOEUQAAAAAOEcQAQAAAOAcQQQAAACAcwQR\nAAAAAM5FfBDJyMhQdna2CgoK+h7Hjx9XV1eXNm3apBkzZig3N1f5+fkqKSlRdXW1JKmiokI+n++a\n5WpqaiRJxhjl5eUpPz9feXl52rlz56A1nD9/XosXL9aMGTN05513atmyZWpoaBjxbQcwvOgnAAC4\n4w11AcNh+/btmjlz5jWvPfTQQ2pra9PBgwfl8/lkrdWuXbtUU1OjnJwcSdLChQu1ffv2G67zwIED\nSkhI0O7du7V8+XI1NjbK673xX5cxRuvWrVNRUZEk6emnn9aGDRv0ox/9aPg2EoAT9BMAANwYFUGk\nv9raWlVWVqqurk4+n09S7z/uS5YsCXpdRUVFamlpUWNjo5KTk284Jikpqe+gQZLuvvtubdu27aZq\nBxBe6CcAAIyMURFESkpKFBcXJ0nyer1at26dsrKylJiYOOhye/fuVUFBgSQpMzNTlZWV142prKzU\nggULBjxo6K+np0fbtm3T/fffH+RWAAgH9BMAANwYFUGk/1SKN99885r3q6urtXLlSrW1tam4uFhb\ntmyRNPhUinnz5qm5uVlnzpzRvn37Aq7l8ccfV0JCgh577LGb2BIAoUY/AQDAjYi/WP1GCgsLVVtb\nq6amJklSTk6ODh8+rNLSUl28eDGgdRw4cEDHjh1TWVmZVqxYoY6OjiGXWbt2rWpra/XGG2/I4xmV\nf7VA1KGfAAAwMkblv25ZWVlaunSp1qxZc82BQmtra9Dreuqpp5SamqqXXnpp0HHPPPOMDh06pLfe\nektjx44N+nMAhCf6CQAAI2NUTM26ek63JP3whz9URUWFysrKNHfuXMXGxioxMVFpaWnasGFDUOs2\nxqi8vFwrVqzQww8/rPj4+OvGfPzxx3rhhRc0ffp0zZs3T9LAc8QBhDf6CQAAbhhrbcCD58yZY6uq\nqkawHADBMMYcstbOCXUdwaKXAOGHfgJguATaT0bl1CwAAAAA4W1UTM1y5bnnntOOHTuue33Pnj1K\nSUkJQUUAIhX9BAAQ7ZiaBUQwplIAGC70EwDDhalZAAAAAMIWQQQAAACAc1F/jYi1Vn8+26b3app0\n5nyHeqzVxPGxKpzu04xpE+SNIasBCEy3v0c1J5r1/qdN+ry1Sx5jdMukOM2a4dPU1HEyxoS6RAAA\nwkZUBxFrrfZV1euzuhZ1+///WpmLLV36zQfndPjTJi27J13xY2NCWCWASNB+ya8d/12nlvbuvn7i\nt1YnG9p19kKH7khP0II5KYQRAAAui+qv+9+vabouhFzR7bf6vLVLv3j3VAgqAxBpfvHuKX3e2jVg\nP/msrkXv1zSFoDIAAMJT1AYRf4/VezWNNzxouKLHSucvdqqh8ZLDygBEmobGDp2/2KmeQW5C2O3v\n7Tn+wQYBABBFojaInGpoV08Aty7u9lt9cuJzBxUBiFSfnGge9EuNK3qs1amGdgcVAQAQ/qI2iLRf\n8gc8trW9ewQrARDpgukRwfQeAABGs6gNIoFegG4kjY+L6mv6AQxhXJxXgV6Czs0vAADoFbVBJC05\nXiaAQ4eYGKPsaRMcVAQgUmVPm6CYmKH7iTFGacnxDioCACD8RW0QifEYFc7wyTvIwYMxUtLEMUpJ\ninNYGYBIk5oUp6SJYzTYnXm9MUaF032K8XD7XgAApCgOIpI0OztRmWnjbxhGvDFGE8d5teTLU0JQ\nGYBIs+TLUzRxnHfAfpKZNl6zsxNDUBkAAOEpqi9+MMboq3el6vjpNr1X06izFzpkrTRhnFcF033K\nzpioMd6ozmoAAjQuzqvlX71Nfzj+uQ5/2qTmtm4Z03u2ZNaMRGVM4ZfVAQC4WtQfZRvT+03lg/ek\n65Flt+vRB2/XqsUZyrvDRwhxLCMjQ9nZ2SooKOh7HD9+XF1dXdq0aZNmzJih3Nxc5efnq6SkRNXV\n1ZKkiooK+Xy+a5arqamR1PvfNy8vT/n5+crLy9POnTuHrGPt2rXKzMyUMUYfffTRiG4zRpcxXo/y\n7vBp1eIMPfrg7Xpk2e168J50ZaaNJ4Q4Rj8Bokek7u83+vwNGzb0vV9VVaWvfe1ryszM1OzZszVr\n1iyVl5cPuN1PPvmkJGnTpk1KSUlRQUGBsrOztXLlSrW2tg5ay6uvvqq8vDzdeeedysvL0+uvvz5k\n/cMhqs+I9MeBQuht375dM2fOvOa1hx56SG1tbTp48KB8Pp+stdq1a5dqamqUk5MjSVq4cKG2b99+\nw3UeOHBACQkJ2r17t5YvX67GxkZ5vQP/r//AAw/oiSee0Fe+8pXh2zBEHfpJ6NFPgOgRqfv7QJ9/\n5MgRFRcX68c//rEWL14sSaqvr9f3v//9IbdbklatWqXy8nJ1dnbq3nvv1Ysvvqj169cPWEdWVpb2\n79+vpKQk1dXVqaCgQPPnz1dGRkbA23IzCCIIa7W1taqsrFRdXZ18Pp+k3gO8JUuWBL2uoqIitbS0\nqLGxUcnJyQOOmz9//k3XCyB80U+A6BHp+/vmzZu1evXqvhAiSSkpKXrhhReCWs+YMWM0b948/elP\nfxp0XFFRUd+f09PTNWXKFNXV1RFEEF1KSkoUF9d7lzKv16t169YpKytLiYmDX+S7d+9eFRQUSJIy\nMzNVWVl53ZjKykotWLBg0CYCYPSgnwDRI1L396s/X5Iee+wxrV69Wu+9955KSkqGXP7q7d68ebMW\nLVp0zfvNzc1655139Pzzzwdc0/79+9XU1KTZs2cHvMzNIoggrPQ/xfjmm29e8351dbVWrlyptrY2\nFRcXa8uWLZIGP7U6b948NTc368yZM9q3b9/IFQ8grNBPgOgRqfv7YJ9/tdLSUv36179WfX29Dh48\nqKlTp0oaeGrWa6+9pl/96leqra3VokWLdM899wRUT3V1tVatWqWf/vSnio8f+d+94mpshLXCwkLV\n1taqqalJkpSTk6PDhw+rtLRUFy9eDGgdBw4c0LFjx1RWVqYVK1aoo6NjJEsGEKboJ0D0iPT9vbCw\nUL///e/7nm/dulWHDx9WZ2en/H7/kMuvWrVKH3zwgY4ePaojR45o27ZtQy5TW1urxYsX6+WXX3Y2\nrZQggrCWlZWlpUuXas2aNdc0jqHu/nAjTz31lFJTU/XSSy8NZ4kAIgT9BIgekb6/r1u3Tq+88op+\n+ctf9r126dKlgELI1W655RZt2bJFZWVlam9vH3Dc0aNHtWjRIm3dulXFxcU3XXewCCIIKyUlJdfc\nxq6qqkoVFRXKzs7W3LlzlZubq/nz5+vQoUMqLS0Nat3GGJWXl+u73/3uoDtjaWmp0tPTVVdXp4UL\nFyo3N/cv3SwAIUA/AaJHpO7vV64RufJYvXq1JCk/P18///nP9b3vfU+ZmZm66667dO+99+rZZ59V\nWlpaUPUvWbJEX/rSl/Tyyy8POGb9+vU6f/68Nm7c2FfL22+/HdTn3AxjrQ148Jw5c2xVVdUIlgMg\nGMaYQ9baOaGuI1j0EiD80E8ADJdA+wlnRAAAAAA4x12zEJWee+457dix47rX9+zZo5SUlBBUBCBS\n0U+A6BHs/l5fX6/77rvvuteXLVumjRs3jkiNAwmnWq5gahYQwZhKAWC40E8ADBemZgEAAAAIWwQR\nAAAAAM5xjQhGjR5r9b+NF7TjVJ2OtbbKymrauPFalpauu5MmKcaYUJcIIEK0dXdrb8NZ/efpU7rQ\n1SmvMZrlS9TfpKVresKEUJcHAKMCQQSjQndPj/6l5hNVN19UR09P3+uftbZo6x8/1a6zCfp29kyN\n8XASEMDgznZ0aMPHH6q1u1uXbG8/6bZWv71wXoeaGlVya7qW33pbiKsEEClOd7TrZ6dOav/5BnX4\n/YqLiVHRpGQtTbtVU+LiQ11eSHFUhlHh1RNH9XG/EHJFR0+PPm1p0Yt/rA1BZQAiid9afeuTI2rq\n6uwLIVdYSZd6erT9ZJ1+e+FcaAoEEFEONV7QEx++rz31Z9Tu98tKavf7taf+jJ748H0darwQ6hJD\niiCCiNfS3a199fW6dIMQckVnT48OXDinps5Oh5UBiDRVjRfU3NWtgbtJbxj5yZ9POKsJQGQ63dGu\nzbV/0KWeHvn7vedXby/ZXPsHne4Y+NfaRzuCCCLe7y6clyeAyz+MjN7lW0wAg3i7/ozae/ofMlyv\n/tKlqD54ADC0n506qe5BviSVeqeW7zx90lFF4Ycggoh3satLXUPs6JLUaXvUyBkRAIO4EGCPiDFG\nTV1dI1wNgEi2/3zDdWdC+vNL2n+uwUU5YYkggog3IdYrbwAXoccao4mxsQ4qAhCpvhBgj/Bbqwle\n7vcCYGAd/qHPrkq914xEK4IIIt7diZPUY21AY+clTR7hagBEsvtSblF8AF9sJMaO0a1RfrcbAIOL\ni4kJaFx8gONGI4IIIt7E2FjNnzR50Fvzxhqj2b4kTR471mFlACLNXyUmKT7Gq8EuOxvr8ejr6VNl\n+G0iAIMompSsoSJGjKSiyckuyglLBBGMCo9+MUu3j0vQ2BuEkbEej24bN17/eMf0EFQGIJJ4PR6V\n5cxUgter2BsEjbEej4pTp6goOTUE1QGIJEvTbh1y6rjX49H9U251VFH4IYhgVBjj8eg7OTP1zczb\nNTU+XkaSkTQlLk5rMr6ozbl5UX3qE0Dg0uPH6Qf5s/VgWromeHvPjngk5U/06dkZOfqHaZmhLhFA\nBJgSF6/1Wdka6/Fcd2YkRr1fbKzPyo7qHzXkSjuMGl6PRwuSU7UgObXvmhEPUycA3IQvxMbq61On\n6etTp8lvrTwSU7EABG12YpK25BVq5+mT2n+uQe1+v+JjYlQ0OVn3T+GX1QkiGJUIIACGSwz9BMBf\nYEpcvB7OvEMPZ94R6lLCDlOzAAAAADhHEAEAAADgHEEEAAAAgHMEEQAAAADOEUQAAAAAOEcQAQAA\nAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4RxABAAAA4BxBBAAAAIBzBBEAAAAAzhFEAAAAADhHEAEA\nAADgHEEEAAAAgHMEEQAAAADOEUQAAAAAOEcQAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4RxAB\nAAAA4BxBBAAAAIBzBBEAAAAAzhFEAAAAADhHEAEAAADgHEEEAAAAgHMEEQAAAADOEUQAAAAAOEcQ\nAQAAAOAcQQQAAACAcwQRAAAAAM4RRAAAAAA4Z6y1gQ82pkHSiZErB0CQpllrk0NdRLDoJUBYop8A\nGC4B9ZOggggAAAAADAemZgEAAABwjiACAAAAwDmCCAAAAADnCCIAAAAAnCOIAAAAAHCOIAIAAADA\nOYIIAAAAAOcIIgAAAACcI4gAAAAAcO7/AN5L4xkF4wvNAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\n",
    "    \"EGFR_1\", \"EGFR_2\"\n",
    "])\n",
    "\n",
    "rule2 = Rule.from_transform(pattern)\n",
    "merge_result_id = rule2.inject_merge_nodes([\"EGFR_1\", \"EGFR_2\"])\n",
    "plot_rule(rule2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_EGFR_1:action_graph { id : '43'}) , (lhs_EGFR_2:action_graph { id : '44'})  \n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH lhs_EGFR_1 as p_EGFR_1, lhs_EGFR_2 as p_EGFR_2 \n",
      "\n",
      "// Merging nodes '{'EGFR_2', 'EGFR_1'}' of the preserved part into 'EGFR_1_EGFR_2' \n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, p_EGFR_1, p_EGFR_2\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_EGFR_2) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_EGFR_2[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_EGFR_1, p_EGFR_2\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_EGFR_1) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_EGFR_1[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_EGFR_1, p_EGFR_2\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, p_EGFR_1, p_EGFR_2\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, p_EGFR_1, p_EGFR_2\n",
      "SET p_EGFR_2 = new_props\n",
      "WITH p_EGFR_2 as rhs_EGFR_1_EGFR_2, p_EGFR_1\n",
      "// set appropriate node id\n",
      "SET rhs_EGFR_1_EGFR_2.id = toString(id(rhs_EGFR_1_EGFR_2))\n",
      "SET rhs_EGFR_1_EGFR_2.count = NULL\n",
      "WITH toString(id(rhs_EGFR_1_EGFR_2)) as uidea60e5b06eb848218cfe6bf3ce8cbfde, rhs_EGFR_1_EGFR_2, p_EGFR_1\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_maps, [] as pred_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "OPTIONAL MATCH (rhs_EGFR_1_EGFR_2)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(rhs_EGFR_1_EGFR_2)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "OPTIONAL MATCH (p_EGFR_1)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(p_EGFR_1)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN [id(rhs_EGFR_1_EGFR_2),id(p_EGFR_1)] THEN [toString(el['id'])] ELSE [] END) as self_loops, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, self_loops, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, self_loops, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (rhs_EGFR_1_EGFR_2)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(rhs_EGFR_1_EGFR_2)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (rhs_EGFR_1_EGFR_2)-[new_rel:edge]->(rhs_EGFR_1_EGFR_2)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "OPTIONAL MATCH (rhs_EGFR_1_EGFR_2)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "OPTIONAL MATCH (pred)-[:typing]->(rhs_EGFR_1_EGFR_2)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "OPTIONAL MATCH (p_EGFR_1)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "OPTIONAL MATCH (pred)-[:typing]->(p_EGFR_1)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (rhs_EGFR_1_EGFR_2)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(rhs_EGFR_1_EGFR_2))\n",
      "DETACH DELETE (p_EGFR_1)\n",
      "\n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_EGFR_1_EGFR_2, p_EGFR_1, uidea60e5b06eb848218cfe6bf3ce8cbfde\n",
      "\n",
      "\n",
      "// Up-propagation to the graph 'meta_model'\n",
      "\n",
      "// Matching of the nodes to merge in 'meta_model'\n",
      "WITH [] as merged_nodes\n",
      "OPTIONAL MATCH (n:action_graph)-[:typing]->(node_to_merge:meta_model)\n",
      "WITH n, collect(node_to_merge) as nodes_to_merge, merged_nodes\n",
      "WHERE n IS NOT NULL AND size(nodes_to_merge) >= 2\n",
      "UNWIND nodes_to_merge as node_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, node_to_merge, merged_nodes, n\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(node_to_merge) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in node_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, node_to_merge, merged_nodes, n\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(new_props) as new_props_col, merged_nodes, n\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge, merged_nodes, n\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, merged_nodes, nodes_to_merge, n\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, merged_nodes, nodes_to_merge, n\n",
      "WITH nodes_to_merge[0] as merged_node, new_props, merged_nodes, nodes_to_merge, n\n",
      "SET merged_node = new_props\n",
      "// set appropriate node id\n",
      "SET merged_node.id = toString(id(merged_node))\n",
      "SET merged_node.count = NULL\n",
      "WITH toString(id(merged_node)) as merged_id, merged_node, merged_nodes, nodes_to_merge, n\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "//create a map from node ids to the id of the merged_node\n",
      "WITH {old_node:node_to_merge.id,  new_node:merged_node} as id_to_merged_id, node_to_merge, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(id_to_merged_id) as ids_to_merged_id, collect(node_to_merge) as nodes_to_merge, merged_node, merged_nodes, merged_id, n\n",
      "WITH apoc.map.groupByMulti(ids_to_merged_id, 'old_node') as ids_to_merged_id, merged_node, merged_nodes, merged_id, nodes_to_merge, n\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(ids_to_merged_id) | \n",
      "\tpairs + [k, REDUCE(values=[], v in ids_to_merged_id[k] | \n",
      "\t\tvalues + CASE WHEN v.new_node IN values THEN [] ELSE v.new_node END)])) as ids_to_merged_id, merged_node, merged_nodes, merged_id, nodes_to_merge, n\n",
      "WITH collect({n:n, nodes_to_merge:nodes_to_merge, merged_node: merged_node, merged_id: merged_id}) as all_n, collect(ids_to_merged_id) as ids_to_merged_id, merged_nodes\n",
      "WITH reduce(acc={}, x in ids_to_merged_id | apoc.map.merge(acc, x)) as ids_to_merged_id, all_n, merged_nodes\n",
      "UNWIND all_n as n_maps\n",
      "WITH n_maps.n as n, n_maps.nodes_to_merge as nodes_to_merge, n_maps.merged_node as merged_node, n_maps.merged_id as merged_id, ids_to_merged_id, merged_nodes\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "OPTIONAL MATCH (node_to_merge)-[out_rel:edge]->(suc)\n",
      "WITH CASE WHEN suc.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[suc.id][0]), neighbor: ids_to_merged_id[suc.id][0], edge: out_rel}\n",
      "\t\tELSE {id: id(suc), neighbor: suc, edge: out_rel} END AS suc_map, node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(suc_map) as suc_maps, node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(node_to_merge)\n",
      "WITH CASE WHEN pred.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[pred.id][0]), neighbor: ids_to_merged_id[pred.id][0], edge: in_rel}\n",
      "\t\tELSE {id: id(pred), neighbor: pred, edge: in_rel} END AS pred_map, node_to_merge, suc_maps, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(pred_map) as pred_maps, suc_maps, node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(node_to_merge.id) as list_ids, collect(suc_maps) as suc_maps_col, collect(pred_maps) as pred_maps_col, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH REDUCE(init=[], maps in suc_maps_col | init + maps) as suc_maps, REDUCE(init=[], maps in pred_maps_col | init + maps) as pred_maps, list_ids, nodes_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN list_ids THEN [toString(el['id'])] ELSE [] END) as self_loops, ids_to_merged_id, merged_node, merged_nodes, nodes_to_merge, merged_id, list_ids, n\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, ids_to_merged_id, merged_node, self_loops, merged_nodes, nodes_to_merge, merged_id, n\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, ids_to_merged_id, merged_node, self_loops, merged_nodes, nodes_to_merge, merged_id, n\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "WITH ids_to_merged_id, merged_node, merged_nodes, nodes_to_merge, merged_id, n\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "OPTIONAL MATCH (node_to_merge)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, node_to_merge, pred_typings, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "OPTIONAL MATCH (pred)-[:typing]->(node_to_merge)\n",
      "WITH pred_typings + collect(pred) as pred_typings, node_to_merge, suc_typings, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(suc_typings) as suc_typings_col, collect(pred_typings) as pred_typings_col, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH REDUCE(init=[], sucs in suc_typings_col | init + sucs) as suc_typings, REDUCE(init=[], preds in pred_typings_col | init + preds) as pred_typings, nodes_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (merged_node)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(merged_node))\n",
      "WITH ids_to_merged_id, merged_node, merged_nodes, nodes_to_merge, merged_id, n\n",
      "FOREACH(node in filter(x IN nodes_to_merge WHERE x <> merged_node) |\n",
      "\tDETACH DELETE node)\n",
      "RETURN collect(merged_id) as merged_nodes\n"
     ]
    }
   ],
   "source": [
    "action_graph_EGFR_1 = h.node_type(\"nugget_1\", rhs_g1[\"EGFR_1\"])[\"action_graph\"]\n",
    "action_graph_EGFR_2 = h.node_type(\"nugget_1\", rhs_g1[\"EGFR_2\"])[\"action_graph\"]\n",
    "rhs_g2 = h.rewrite(\n",
    "    \"action_graph\", rule2, \n",
    "    {\"EGFR_1\": str(action_graph_EGFR_1), \"EGFR_2\": str(action_graph_EGFR_2)})\n",
    "action_graph_EGFR = rhs_g2[merge_result_id]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4) Generation rule for nugget 2 (some of the nodes are already in the action graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAIABJREFUeJzt3X1UVXWi//HP93BQQAREEFBUlFRQ\nUDAspVQyu2V6c6ZshsY0zbLfZHrvrGnune4vR2es+eVMa9ZtbjXNZGZZ9nAtp6ZySlKzokwKEgXN\nx1IBBQQElIfD2b8/zDPiIziwzwHfr7VYy3P2w/lsdO11Pu79/W5jWZYAAAAAwE4ObwcAAAAAcPmh\niAAAAACwHUUEAAAAgO0oIgAAAABsRxEBAAAAYDuKCAAAAADbUUQAAAAA2I4i0okYY/YbYyae8V6G\nMebgOdbdaIy557TX/2WM2WeMqTHGHDTGvGZHZgAd0/fnmxPfnzMOG2NWGGOCvZ0LgG8541xRcvq5\n4vs/P3LG+nHGGMsY4/z+dawx5g1jTJkxpsoYs80YM8sLh4J2QBGBjDF3SZohaaJlWcGS0iR96N1U\nADqAf/3+nDFSJ88bD3s5DwDfdOpckSIpVdJDrdh2paQDkvpL6qmT31cOt3lCeIXT2wHgE0ZJet+y\nrD2SZFlWiaS/eDcSgI7CsqxDxpi1kpK8nQWA77Isq8QY875OFpKWGiXpZ5Zl1X7/Orftk8FbuCIC\nSfpc0kxjzC+MMWnGGD9vBwLQcRhj+kq6WXxBAHABxphYSZMk7W7FZp9LesoYk2mM6dc+yeAtFJHL\nQ29jTOXpP5KuPbXQsqyXJM2XdKOkjyQdMcb8p5eyAug4/vr9+eQTnTx3/NbLeQD4pr8aY6p18har\nI5IWnbbswTO+n2w9Y9vbJX0saaGkfcaYPGPMKFtSo91RRC4PRZZlhZ3+o5NfHDwsy3rZsqyJksIk\n/R9JS4wxN3ojLIAO4wffn1P6W5Z1v2VZJ7wdCIBP+oFlWd0lZUhKkBRx2rLHz/h+Mvz0DS3LqrAs\n65eWZQ2TFCUpTyeLjbEpO9oRRQTNWJbVaFnW/+rk/0hwvzcAAGgTlmV9JGmFpMcvcfuy77ftLSm8\n7ZLBWyginY+/MSbg1I9aMCGBMWaWMWayMaa7McZhjJkkaZikze2eFgAAXE7+W9INxpgRLVnZGLPU\nGJNkjHEaY7pL+qmk3ZZllbdrStiCWbM6n/fOeP1pC7Y5Jum/JL0kyU/St5J+alnWJxfcCgAAoBUs\nyyo1xrwo6VeSqluwSZCkNZJiJJ3Qyf8kvaX9EsJOxrIsb2cAAAAAcJnh1iwAAAAAtqOIAAAAALAd\nRQQAAACA7SgiAAAAAGzXqlmzIiIirLi4uHaKAqC1vvzyyzLLsiK9naO1OJcAvofzCYC20tLzSauK\nSFxcnHJyci49FYA2ZYz51tsZLgXnEsD3cD4B0FZaej7h1iwAAAAAtqOIAAAAALAdRQQAAACA7Sgi\nAAAAAGxHEQEAAABgO4oIAAAAANtRRAAAAADYjiICAAAAwHYUEQAAAAC2o4gAAAAAsB1FBAAAAIDt\nKCIAAAAAbEcRAQAAAGA7iggAAAAA21FEAAAAANiOIgIAAADAdhQRAAAAALajiAAAAACwHUUEAAAA\ngO0oIgAAAABsRxEBAAAAYDuKCAAAAADbUUQAAAAA2I4iAgAAAMB2FBEAAAAAtqOIAAAAALAdRQQA\nAACA7SgiAAAAAGxHEQEAAABgO4oIAAAAANtRRAAAAADYjiICAAAAwHYUEQAAAAC2o4gAAAAAsB1F\nBAAAAIDtKCIAAAAAbEcRAQAAAGA7iggAAAAA21FEAAAAANiOIgIAAADAdhQRAAAAALajiAAAAHhJ\nXFycEhISlJKS4vnZv3+/GhsbtXjxYg0ZMkTDhg3TiBEjNG3aNBUUFEiSVqxYobCwsGbb7dy5U5Jk\njNHw4cM1YsQIDR8+XG+//bY3DxE4L6e3AwAAAFzOVq9eraSkpGbv3XnnnTp+/Lg2b96ssLAwWZal\n9957Tzt37tTQoUMlSRMnTtTq1avPuc/s7GwFBwdr7dq1+tGPfqSKigo5nXztg2/hXyQAAIAP2bVr\nl9asWaODBw8qLCxM0smrHJMnT271vjIyMlRTU6OKigpFRka2dVTgn0IRAQAA8KJp06YpICBAkuR0\nOvUf//EfGjRokHr06HHB7bKyspSSkiJJGjBggNasWXPWOmvWrNGECRMoIfBJjBEBAADwotWrVysv\nL095eXnKyck5a3lBQYFSUlI0ePBg/du//Zvn/YkTJ3q2O7OEpKena8CAAZozZ44eeeSRdj+Gy1VF\nRYUCAwOb/b2cOX5n5MiRWr9+vWd5XFyctm3bdta+Hn/8cQ0ZMkQOh0PvvPOOLfm9jSICAADgQ1JT\nU7Vr1y5VVlZKkoYOHaq8vDwtWLBAVVVVLdpHdna29u3bpyVLligzM1N1dXXtGfmytWrVKo0ePVqv\nvPKKGhoaPO+fXhIfeeQRzZs376L7Gj9+vN577z2NGzeuPSP7FIoIAACADxk0aJCmTp2qe++9t1nx\nqK2tbfW+fv7znysqKkrPPPNMW0bE95YvX66HH35Yw4cP11tvvXXOdaqqqi56m50kjRo1SvHx8W0d\n0acxRgQAAMCLTh8jIknLli3TihUrtGTJEo0aNUr+/v7q0aOHevfurV/+8pet2rcxRo8//rgyMzN1\n3333KTAwsK3jX7a2bt2q8vJyTZgwQSUlJVq+fLluv/12Sf8Yv1NTU6PS0lK9++67Xk7rmygiAAAA\nXrJ///7zLluyZImWLFlyzmWzZs3SrFmzzrnMsqxmr8eNG6eioqJLjYjzeO655zRz5kwZY3Trrbdq\n/vz5OnTokKTmUytv3LhRmZmZ+uabbxQUFOTNyD6HW7MAAACAVmhoaNCqVau0fPlyxcXFKTExUY2N\njVqxYsVZ62ZkZKixsVHbt2+3P6iPo4gAAAAArfDWW29pyJAhOnjwoPbv36/9+/frgw8+OGcRyc/P\nV3V1teLi4mzP6eu4NQsAAABoheXLl2v69OnN3hszZozcbre+/fZbzxgRy7JkWZZWrFjR7FkuEydO\nbPak+/z8fC1btkxPPPGESktLNWvWLAUEBKigoEAhISG2HZfdzJn3EV5IWlqada75rQF4hzHmS8uy\n0rydo7U4lwC+h/MJgLbS0vMJt2YBAAAAsB1FBAAAAIDtGCMCAADg48pK6rR9S5WKvz0ht9tS91B/\nDR0VqrjBwfJzGm/HAy4JRQQAAMCHffXJURV+WaWmJkv6fmhvRVmDNmeVadvmSt2Y2VsBgX7eDQlc\nAm7NAgAA8FG7tx07WUJc/yghp7gaLVVXNurDN0vOeogh0BFQRAAAAHyQZVnK/aTiZAk5D7dbqipv\nUFlJvY3J0FqWZan04CF9u2OnyotLvB3HZ3BrFgAAgA8qP1yvxgb3RddzuSzt2lqtyJgAG1Khtb5c\nv1Hvv/yajh2tkJ+fn5pcLvWMidaku6YrafRV3o7nVVwRAQAA8EEnaptkTAsGoltSbbWr/QOh1d5+\n9nmt/p9nVF5cosb6etUdP67GhgaVfPudXlr6B21YvcbbEb2KIgIAAOCDunT101kDQ84jIJCvdL5m\n51d5yn7vfTXUn/u2ucb6er3/8qs6uHuPzcl8B/9qAQAAfFBk764yjotfEXH6G8UndbchEVrjw9ff\nUON5SsgprkaXNr75lk2JfA9FBAAAwAc5HEbDRoVd8DkhxkgBQX6K6RdoYzJcjNvt1t5tBRddz3K7\nVfjFlzYk8k0UEQAAAC+rrKzU7373u2bv3XPPPaqo26q+8UFy+p9dRiw1qfrEYf33CzM9Y0kWL16s\nhoYGWzLj/NxNTVILp1R2uS7f8T0UEQAAAC87VxFZtmyZxo0bp7GTeyn9xkiF9+oiyZIltxpdJ9Tg\n3KvE0U3a9PFGzza//vWvKSI+wOnvr4BuQS1aNzQ8vJ3T+C6KCAAAQDuYPn260tLSlJycrB/+8Ieq\nqKiQJC1fvlwjRozQiBEjNGrUKB0+fFjz5s1TZWWlUlJSlJ6eLknKyMjQO++8owMHDmj0+Ct0Y2aU\nMqZ1UX3wRv2/Z6fq/Y+f1dZtXyoiIkKSNG/ePElSenq6UlJSVFRUpJiYGNXV1Xky3XLLLVq1apXN\nv4nLU/rNN8npf+EnZXTp2lVjfzDFpkS+hyICAADQDp544gnl5OQoPz9fw4YN09KlS7Vx40b99re/\n1fvvv6+vv/5aGzZsUGhoqJ566imFhYUpLy9P2dnZzfbTr18/JSUlae3aterdJ0Yn6mpVVFSk2NhY\n1dbWep6q/tRTT0mSsrOzlZeXp969e2v8+PF67bXXJEn79+9XTk6Opk2bZu8v4jI1duoUdQk4/7Nd\njMOhwO7BGjVxgo2pfAtFBAAAoB28+OKLuvLKK5WcnKxVq1YpLy9P7777rmbOnKno6GhJUnBwsAIu\n8GX1lFmzZmnFihVyOp0qLCxUcnKyamtrJZ0cGH0+CxYs0NNPPy1JeuaZZ3T33XerS5cubXB0uJju\nPcJ076OL5de1i+Ro/pW7a2CgekRG6IHf/1YBQZfvRAM8WR0AAKCNffzxx/rTn/6k7OxsRUZGatWq\nVfrLX/5yyfu79dZb9bOf/Uzl5eXatGmTJk+erPLyctXV1V2wiKSnp6upqUmffvqpVqxYoS1btlxy\nBrRebWOD4m+8Tls//UwhbiOnjPoOHKD0yTcpcdSV8vPz83ZEr6KIAAAAtLHKykqFhoaqZ8+eqq+v\n1/LlyyVJkydP1j333KP77rtPUVFRqqmpkdPpVEhIiI4fPy6XyyWn8+yvZ0FBQZo6daoeeugh1dXV\nadCgQXK73Tp27JjcbrfcbrccDoe6d++uqqoqBQcHe7adP3++MjMzlZ6err59+9r2O4C0d+9enair\n0wl/Pw2/+mpdddVVSk1N9XYsn8GtWQAAAG3spptuUnx8vAYPHqzx48dr5MiRkk4OQH/ooYc0ceJE\njRgxQhMmTFBVVZXCw8M1ffp0JScnewarn2nWrFl69tlnNXv2bAUGBiosLEzHjh2TZVk6cuSIJOnn\nP/+5JkyYoJSUFFVWVkqSMjMzVVFRofvvv9+eg4ck6cSJEyoqKlJZWZkiIyNljNHAgQO9HcuncEUE\nAACgjfn7+3sGiZ9pzpw5mjNnzlnvP/vss81eb9y4sdnra6+91jMwff369aqtrVVlZaU+++wzhYSE\nSJIWLVqkRYsWNdtuy5YtiouL0/XXX3+ph4NLsG/fPlmWpdLSUl1xxRXq2bOnQkNDvR3Lp1BEAAAA\nOpj09HRlZGTozTffVK9evRQUdO5nVsyZM0fr1q3Tiy++6HnoIewRFRWl/v37Kzc3VyEhIVwNOQeK\nCAAAQAdzaqat2NhYHTx4UFFRUedc77nnnrMzFk7Ts2dPRUZG6s4771R8fLy6d+/u7Ug+hzEiAAAA\nHdSpIgLftHfvXsXHxys6OlrdunXzdhyfQxEBAADooKKjo3X06FE1NDR4OwrOUFFRofr6+vNerQJF\nBAAAoMNyOp2KiopSUVGRt6PgDHv37tXAgQMZm3MBFBEAAAAf5Wo4rrpjJWqsO3bedbg9yzedKiI4\nPwarAwAA+Jjqwzv13ZerVHXoaxmHU5bbpW49B6pv2h0K7zeq2bp9+vRRQUGBl5LiXCoqKtTQ0KBe\nvXp5O4pP44oIAACADynd/ZG2/e0hVR74UpbbJberTpbbpZrSb7Rz3WP6LueVZuuHh4ersbFRx46d\n/6oJ7MVtWS1DEQEAAPARdcdKtHvjE3I3nXvwudtVr0Nfr1blwTzPe8YYxcbG6tChQ3bFxEVwW1bL\nUEQAAAB8RFH+W7Is9wXXcbvqdTD39Wbv9enTp9OPEzHGqKampt0/Z/HixXrwwQcvefuKigo1NjZe\n8LasWbNm6cknn7zovlasWKFvvvnG8/rtt9/WL37xi0vO5msoIgAAAD6ibM/Hstyui65XVbxN7qZG\nz+vY2FgVFRXJ7b5wiUH727t3r/r27dsmt2WdWURuueUW/f73v/+n9+srKCIAAAA+wu2qb9F6xhi5\nXf+4fSsoKEjdunVTWVlZe0WzhTFGixYtUkpKioYMGaI33nij2fI//vGPGjVqlAYOHNhs2d///nel\npqZq+PDhuv7667V7925J0s6dOzVmzBiNGDFCSUlJevzxxyWdvOrxox/9SBMmTFBCQoJuu+02VVVV\nefZ36NAh3XzzzUpISNDkyZN1/PhxSVJNTY1mz56tpKQkJSUl6Xe/+51nm4yMDP37v/+7MjMz9etf\n/1rz5s1rVhpyc3M1ZMgQWZbV7Jg+/PBDjRkzRqmpqUpOTtarr74qSXr++eeVk5OjBQsWKCUlRVlZ\nWVqxYoWmTZvm2Xbp0qWeLLNnz/ZcMVq8eLHuuOOOcx6DL6GIAAAA+Aj/wLAWrWeMn/y6BDZ7r7NM\n4+vn56e8vDy9/fbbmjt3ro4cOeJZFhISoi1btmjlypVasGCBJOnIkSOaMWOGXn75ZW3dulU/+clP\nNH36dEnS008/rVtuuUVff/21tm3bpjlz5nj29fHHH+uVV17Rjh07FBoaqiVLlniW5eTkaNWqVSos\nLFRjY6NefvllSdKSJUvkdruVn5+v7OxsvfDCC1q7dq1nu507d+pXv/qVsrKy9MADD+jPf/6zp3g8\n+eSTuv/++8+6UjJy5Eh98sknys3NVVZWlh588EFVVFRo9uzZSktL0x//+Efl5eVp4sSJzbZbu3at\nVq5cqezsbOXn56upqalFx+BLKCIAAAA+IibpX+Vwdr3wSsZPkYMnyJjmX+M6SxE5VRaGDBmikSNH\n6vPPP/csy8zMlCSNHj1aRUVFqqur0+bNmzVixAgNHTpUkjR79mzl5eWpurpa48aN07Jly7Rw4UKt\nX79eYWH/KHpTpkzxPPV8zpw5Wr9+vWfZjTfeqLCwMBljdPXVV2vPnj2SpKysLN17770yxigkJER3\n3HGHsrKyPNuNHTtWgwYNkiQlJiZq4MCB+vvf/66Kigq9/fbbmjVr1lnHW1paqmnTpikpKUk33nij\njh49qp07d17095SVlaXMzEyFhITIGKO5c+c2y3K+Y/AlFBEAAAAf0WvIRPn5B0o6//gCh5+/+oy4\n7az3o6OjVV5eroaGc8+41RkEBARIOnnVRJJcrguPp7ntttv08ccfKz4+Xo899phmzJjRqs859VkX\n+5xTqqqqms2WtWDBAj399NNavny5br31VoWGhp61zU9/+lNlZGQoPz9feXl5io2NVV1dXYs+rz2O\nwU4UEQAAAB/h7BKk5FuWyj8wVA5nQLNlxq+L3HLqiuv/S4GhMWdv63SqV69eKioqsituu3j++ecl\nSbt27VJubq5Gjx59wfVHjx6tr7/+Wjt27JAkvfDCC0pNTVX37t21e/duRUdHa9asWVq0aJG++OIL\nz3bvvvuuSktLPZ85YcKEi2abOHGinnvuOVmWperqar366qu64YYbJJ0sRU1NTc1my7r55pu1c+dO\n/eEPf9C8efPOuc/KykrFxcXJGKN169Z5xrdIJ29FO33syplZXnvtNVVXV8uyLC1btsyTpaOgiAAA\nAPiQwLA+uvKOZRp4zX3qFhGvLkHhCgzrq/6j7lSX5J8pb1f5ebeNjY3VmDFjlJCQ4Bmg/eqrr2rj\nxo1KS0vzrPfFF18oNjZW77zzjh2H1Coul0upqamaMmWK/vznP1/06eSRkZFauXKlfvKTn2j48OF6\n6aWX9NJLL0mSXn/9dSUnJys1NVXz58/XE0884dlu7NixyszMVEJCgo4ePaqFCxdeNNvChQtlWZaS\nk5M1ZswYzZgxQzfddJMk6cSJE4qOjm62vsPh0F133aUBAwZo+PDh59znY489pgcffFApKSl6/fXX\nm603d+5c/eY3v/EMVj/dpEmTdOedd2rMmDFKTk6WJD388MMXPQZfYs4cuX8haWlpVk5OTjvGAdAa\nxpgvLctKu/iavoVzCeB7OJ90DE1NTXrzzTeVmpqqK6644qzl5eXlSkhI0IYNG5SUlKTc3Fylp6dr\n5cqVeuyxx5STk6P169drxowZWrVqlcaPH++Fozg/Y4yqq6sVHBzcrp+zePFi1dTUeGbRaguvv/66\nMjIyzipON9xwg+bOnavbb7+9zT7L17X0fMIVEQAAgA7Cz89P1113nbKzs1VbW3vW8vDwcEnyLDt1\ni9K+ffskSX/72980c+ZMvfXWWz5XQjqyo0ePyuVyNSshOTk5io+PV2hoqG677ewxPZCc3g4AAACA\nlouIiFBSUpI2bdqkSZMmNVtmjJGfn58OHz4sSdqwYYPq6uo0aNAg7dq1S9OnT9dnn32mYcOGeSP6\nRbXmTp1/xuLFi9t0f3v37m02SF2S0tLSfHKmKl/CFREAAIAOJiUlRSdOnPAM0D6d0+nUAw88oJSU\nFC1atEhvvPGGwsLCFBMTo8TERD3zzDNeSNy5nauI4OIoIgAAAB2Mw+HQddddpy+++ELV1dXNlvn5\n+em+++5Tbm6uNm3a5JlJKTg4WB988IE2b96s+fPneyN2p3Su27LQMhQRAACADqhHjx5KSUnRxo0b\nm93SZIxRQECAZ2ra04WGhmrdunWUkTbE1ZBLRxEBAADooJKTk2VZlrZv397s/aioqPM+ZT00NFQf\nfPCBPv/8c8rIP+FU+duzZ4/i4+O9nKZjYrA6AABAB2WMUUZGhv76178qNjZWYWFh2r9/vw4cOKDc\n3FyNHDlSkpSRkaHTpzkOCwvTli1bvBW7w2poPKbiI5+opOwTuVy1MvJTeFSIAgKvlhTp7XgdDldE\nAAAAOrCQkBClpaVp48aNcrvdkqSYmBiVlZWpsbHRy+k6j9oTRfpq+2916PCHcrlOTo9sqUlBwRXa\n9s2TOljyoZcTdjwUEQAAgA4uMTFR/v7+2rp1q6STM2f16tVLRUVFXk7WfhYvXqwHH3zQls9qcjdo\n2zdPqqnphCzL1XyhkdxWow4UrVVFVYEteToLiggAAEAHZ4zR+PHjtXXrVh09elSSFBsbe95xImid\nsqNfye2+8NUlt9Wo74rW2pSoc6CIAAAAdALBwcEaPXq0NmzYILfbraioKB06dMjbsSSdLEqPPvqo\nRo0apYEDB+rDDz/UQw89pNTUVCUlJamwsNCz7tKlS5WUlKSkpCTNnj1bNTU1kqSqqipNmzZNCQkJ\nysjIsPVhgSWln8rtbrjoerUnitTQeMyGRJ0DRQQAAKCTGDx4sIKDg/Xuu+9q3bp1+u677zxf5L3t\n1AD5pUuXaurUqbrmmmuUm5urmTNn6tFHH5UkrV27VitXrlR2drby8/PV1NSkJUuWSJJ+85vfKCQk\nRDt27NDq1av10Ucf2ZK7tLRU1TVlLVrXYfw840dwcRQRAACATqKhoUGWZWnNmjU6cuSISsrK9can\nW/Te1p3avPeAXE1ur2X78Y9/LEkaOXKkjDGaMmWKJOnKK6/U7t27JUlZWVnKzMxUSEiIjDGaO3eu\nsrKyJEkbNmzQnDlzJEkRERG69dZb2y1rQ0ODCgoK9MYbb2jNmjU6frxlvze31SSns1u75epsmL4X\nAACgk6ipqdHBgwcVFx+v7MoG1UYM1Lb83fLf8Z0cDiNjjKZfnaJpaUkyxtiaLSAgQNLJJ7937drV\n876fn59cLtf5NrNVWVmZtm/frj179sjlcqmmpkbFxcUqq6hS+vhA+ftfePtuQX3UxT/EnrCdAFdE\nAAAAOonw8HCljBypgqAo1YRGym0cajIO1blcOt7QqNr6Br2Y/ZX+tHGzt6Oe08SJE/Xaa6+purpa\nlmVp2bJluuGGGyRJEyZM0PPPPy9JKi8v15o1a9r88/fu3auCggIdOHBAX331lQoKCtS1a1eFBA+T\nkZ9Oe4D9WRzGX/1iJrV5ps6MKyIAAACdyEF1VZVlZDnOfcWjzuXSe1t36PrEeA2J9q2H8E2aNElb\nt27VmDFjJElpaWl6+OGHJUkLFy7U3XffrYSEBEVHR2vcuHFt+tmlpaUqLy/X5s2bFRYWpri4OPXo\n0UMOh0N9+/ZVn8ixKq/+XzW5G2VZp8+gZeRwONWv9xT1CE1s00ydnbEuVO3OkJaWZp3+VE4A3mWM\n+dKyrDRv52gtziWA7+F80jlYlqU7n31NR6ovPGDaYYzGDY7T/50ywaZkvqmhoUG7d+/Wjh07VF9f\nr8TERO3du1dlZWXq1q2bEhISNGTIEAUHB0uSGl01KinNVvGRTWp01crh8FN4aJL6RF2v4G59vXw0\nvqOl5xOuiAAAAHQS1XUNOlp74qLruS1LXx8osSGRbzpy5IgKCwu1b98+xcbG6qqrrlKfPn1kjFF0\ndLQaGhrUt2/fs8bR+DuD1TfmX9Q35l+8lLxzoYgAAAB0Em7L3eJB6K6mpnZO41saGhq0a9cuFRYW\nyuVyKSEhQT/+8Y8VGBjYbL3o6GgvJbz8UEQAAAA6ie4BXdXV6afGFpSMYMulF198UTExMZ6f8PBw\n22fTam+HDx9WYWGh9u/fr759+yo9PV0xMTGd7jg7IooIAABAJ+HncGhqSqJez9l2wTIS4O/U/CnX\nKzEyTMXFxSouLtb27dtVV1en6OhoTzHp2bOnHI6ON8lqfX295+qH2+1WYmKiRo8e7ZlCGL6BIgIA\nANCJ3JaWrPe371LF8RNqcp89KVEXp58SY3rpyrg+chijQYMGadCgQZKk48ePe4rJzp07VVtbq6io\nKMXExKh3796KiIjw6WJSUlKiwsJCffvtt+rXr5+uueYa9e7d29uxcB4UEQAAgE6ke0BX/c/0W7Rw\nzTodOFqlBpdLliSnwyGHMRo9sK/+c9J4Oc5xa1JQUJDi4+MVHx8vSaqrq/MUk02bNqm6ulq9evXy\nFJPIyEj5+fnZfITN1dXVea5+SFJCQoLGjBnD1Y8OgCICAADQyUQEd9OfZvxA3xwu00c79qrqRJ2i\nQ7vrhmFXKCqke4v3ExAQoAEDBmjAgAGSTt7yVFJSouLiYmVnZ6uystJTTGJiYtSrVy85na37etnQ\n2KTP87/Ve58W6sjRGjkcRoP7RermaxM1bGDUecdyFBcXq7CwUN9995369eunsWPHKiYmplWfDe+i\niAAAAHRSg6MiNDgqos3217VTmTLPAAADv0lEQVRrV/Xv31/9+/eXdHImqlPF5IsvvtDRo0cVERHh\nKSZRUVHy9/dXQUGBtm/f3mxgfFBQkGqO1+vR57JUVlmr+sbvx7Q0Sdv2lGjXd6Uandxfd0+9ylNG\n6urq9M0332jHjh2SpKFDh+qaa65R165d2+wYYR+KCAAAAC5Jly5d1K9fP/Xr10+S1NjYqMOHD6u4\nuFhfffWVysrKFB4eroMHD6qmpkalpaUqKCiQJIWGhirnkFNlxxrPOZal/vsrJdER3ZU6MEyFhYU6\ncOCA4uLiNG7cOKbZ7QQoIgAAAGgT/v7+io2NVWxsrCTJ5XLpyJEjys/P1+HDh1VdXa3AwECFhYWp\nS3CESht6y63zT6Nb39ikN7O+Vu0wp4YmJuraa6/l6kcnQhEBAABAu3A6nQoJCVF0dLSioqLkdrtV\nXV2tqqoqFR0zcne1pIs8z8Ph56dhI8dqWDxXQDobiggAAADaTXBwsO666y7PWJLi4mKVlpaqtrSr\nyusuPhWwMUZVtXU2JIXdKCIAAABoV+caS/LsG5/qaEGxzh4d0pwxUnAgt2N1Rr77RBoAAAB0Sv7+\n/rrx2mR18W/JM0iMhg7o1e6ZYD+KCAAAAGwXH9tTMZEhcjjOP0aki7+fbkofIqfTuw9NRPugiAAA\nAMArfn7nePUMDVKXcxSNrv5OpQzuranjk7yQDHZgjAgAAAC8IjQ4UI/cP0kffblHa7N3qOLYCRkj\nxfUO15SxQ5WWGHveJ6uj46OIAAAAwGsCu/rrpvQE3ZSeILfbLWMM5eMyQREBAACAT3A4GDVwOeFv\nGwAAAIDtKCIAAAAAbEcRAQAAAGA7iggAAAAA21FEAAAAANiOIgIAAADAdhQRAAAAALajiAAAAACw\nHUUEAAAAgO0oIgAAAABsRxEBAAAAYDuKCAAAAADbUUQAAAAA2I4iAgAAAMB2FBEAAAAAtqOIAAAA\nALAdRQQAAACA7SgiAAAAAGxHEQEAAABgO4oIAAAAANtRRAAAAADYjiICAAAAwHYUEQAAAAC2o4gA\nAAAAsB1FBAAAAIDtKCIAAAAAbEcRAQAAAGA7iggAAAAA21FEAAAAANiOIgIAAADAdhQRAAAAALaj\niAAAAACwHUUEAAAAgO2MZVktX9mYUknftl8cAK3U37KsSG+HaC3OJYBP4nwCoK206HzSqiICAAAA\nAG2BW7MAAAAA2I4iAgAAAMB2FBEAAAAAtqOIAAAAALAdRQQAAACA7SgiAAAAAGxHEQEAAABgO4oI\nAAAAANtRRAAAAADY7v8DXx5mOFClnNgAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Rule that merges two EGFR nodes from the action graph\n",
    "rule3 = Rule.from_transform(nx.DiGraph())\n",
    "rule3.inject_add_nodes_from([\n",
    "    (\"EGFR\", {\"uniprotid\": \"P00533\", \"hgnc_symbol\": \"EGFR\"}),\n",
    "    (\"PK\", {\"name\": \"Protein kinase\"}),\n",
    "    (\"activity\", {\"name\": \"activity\", \"test\": True}),\n",
    "    (\"mod\", {\"value\": True}),\n",
    "    (\"phosphorylation\", {\"name\": \"phosphorylation\", \"test\": False}),\n",
    "    (\"ABL1\", {\"uniprotid\": \"P00519\", \"hgnc_symbol\": \"ABL1\"})\n",
    "])\n",
    "rule3.inject_add_edges_from([\n",
    "    (\"PK\", \"EGFR\", {\"start\": 300, \"end\": 500}),\n",
    "    (\"activity\", \"PK\"),\n",
    "    (\"PK\", \"mod\"),\n",
    "    (\"mod\", \"phosphorylation\"),\n",
    "    (\"phosphorylation\", \"ABL1\")\n",
    "])\n",
    "plot_rule(rule3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'action_graph': {'EGFR': '44', 'PK': '8'}, 'meta_model': {'activity': 'state', 'mod': 'mod', 'phosphorylation': 'state', 'ABL1': 'gene'}}\n"
     ]
    }
   ],
   "source": [
    "action_graph_PK = h.node_type(\"nugget_1\", rhs_g1[\"PK\"])[\"action_graph\"]\n",
    "\n",
    "rhs_typing3 = {\n",
    "    \"action_graph\": {\n",
    "        \"EGFR\": action_graph_EGFR,\n",
    "        \"PK\": action_graph_PK\n",
    "    },\n",
    "    \"meta_model\": {\n",
    "        \"activity\": \"state\",\n",
    "        \"mod\": \"mod\",\n",
    "        \"phosphorylation\": \"state\",\n",
    "        \"ABL1\": \"gene\"\n",
    "    }\n",
    "}\n",
    "print(rhs_typing3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Empty instance \n",
      "\n",
      "// Adding node 'PK' from the rhs \n",
      "CREATE (rhs_PK:nugget_2) \n",
      "SET rhs_PK.id = toString(id(rhs_PK)) \n",
      "WITH toString(id(rhs_PK)) as rhs_PK_id , rhs_PK\n",
      "\n",
      "\n",
      "// Adding node 'phosphorylation' from the rhs \n",
      "CREATE (rhs_phosphorylation:nugget_2) \n",
      "SET rhs_phosphorylation.id = toString(id(rhs_phosphorylation)) \n",
      "WITH toString(id(rhs_phosphorylation)) as rhs_phosphorylation_id , rhs_phosphorylation, rhs_PK, rhs_PK_id\n",
      "\n",
      "\n",
      "// Adding node 'activity' from the rhs \n",
      "CREATE (rhs_activity:nugget_2) \n",
      "SET rhs_activity.id = toString(id(rhs_activity)) \n",
      "WITH toString(id(rhs_activity)) as rhs_activity_id , rhs_PK, rhs_phosphorylation, rhs_activity, rhs_phosphorylation_id, rhs_PK_id\n",
      "\n",
      "\n",
      "// Adding node 'ABL1' from the rhs \n",
      "CREATE (rhs_ABL1:nugget_2) \n",
      "SET rhs_ABL1.id = toString(id(rhs_ABL1)) \n",
      "WITH toString(id(rhs_ABL1)) as rhs_ABL1_id , rhs_PK, rhs_phosphorylation, rhs_activity_id, rhs_activity, rhs_phosphorylation_id, rhs_PK_id, rhs_ABL1\n",
      "\n",
      "\n",
      "// Adding node 'EGFR' from the rhs \n",
      "CREATE (rhs_EGFR:nugget_2) \n",
      "SET rhs_EGFR.id = toString(id(rhs_EGFR)) \n",
      "WITH toString(id(rhs_EGFR)) as rhs_EGFR_id , rhs_PK, rhs_phosphorylation, rhs_activity_id, rhs_activity, rhs_phosphorylation_id, rhs_PK_id, rhs_ABL1, rhs_ABL1_id, rhs_EGFR\n",
      "\n",
      "\n",
      "// Adding node 'mod' from the rhs \n",
      "CREATE (rhs_mod:nugget_2) \n",
      "SET rhs_mod.id = toString(id(rhs_mod)) \n",
      "WITH toString(id(rhs_mod)) as rhs_mod_id , rhs_PK, rhs_phosphorylation, rhs_activity_id, rhs_activity, rhs_mod, rhs_phosphorylation_id, rhs_PK_id, rhs_ABL1, rhs_EGFR_id, rhs_ABL1_id, rhs_EGFR\n",
      "\n",
      "\n",
      "// Adding properties to the node 'EGFR' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'uniprotid' IN keys(rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tSET rhs_EGFR.uniprotid = ['P00533'])\n",
      "FOREACH(dummy IN CASE WHEN 'uniprotid' IN keys(rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['P00533'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_EGFR.uniprotid THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_EGFR.uniprotid = rhs_EGFR.uniprotid + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'hgnc_symbol' IN keys(rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tSET rhs_EGFR.hgnc_symbol = ['EGFR'])\n",
      "FOREACH(dummy IN CASE WHEN 'hgnc_symbol' IN keys(rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['EGFR'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_EGFR.hgnc_symbol THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_EGFR.hgnc_symbol = rhs_EGFR.hgnc_symbol + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'PK' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_PK) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK.name = ['Protein kinase'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_PK) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Protein kinase'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK.name = rhs_PK.name + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'activity' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_activity) THEN [1] ELSE [] END |\n",
      "\tSET rhs_activity.name = ['activity'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_activity) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['activity'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_activity.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_activity.name = rhs_activity.name + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'test' IN keys(rhs_activity) THEN [1] ELSE [] END |\n",
      "\tSET rhs_activity.test = [True])\n",
      "FOREACH(dummy IN CASE WHEN 'test' IN keys(rhs_activity) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [True] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_activity.test THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_activity.test = rhs_activity.test + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'mod' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'value' IN keys(rhs_mod) THEN [1] ELSE [] END |\n",
      "\tSET rhs_mod.value = [True])\n",
      "FOREACH(dummy IN CASE WHEN 'value' IN keys(rhs_mod) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [True] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_mod.value THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_mod.value = rhs_mod.value + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'phosphorylation' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tSET rhs_phosphorylation.name = ['phosphorylation'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['phosphorylation'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_phosphorylation.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_phosphorylation.name = rhs_phosphorylation.name + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'test' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tSET rhs_phosphorylation.test = [False])\n",
      "FOREACH(dummy IN CASE WHEN 'test' IN keys(rhs_phosphorylation) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [False] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_phosphorylation.test THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_phosphorylation.test = rhs_phosphorylation.test + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'ABL1' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'uniprotid' IN keys(rhs_ABL1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_ABL1.uniprotid = ['P00519'])\n",
      "FOREACH(dummy IN CASE WHEN 'uniprotid' IN keys(rhs_ABL1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['P00519'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_ABL1.uniprotid THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_ABL1.uniprotid = rhs_ABL1.uniprotid + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'hgnc_symbol' IN keys(rhs_ABL1) THEN [1] ELSE [] END |\n",
      "\tSET rhs_ABL1.hgnc_symbol = ['ABL1'])\n",
      "FOREACH(dummy IN CASE WHEN 'hgnc_symbol' IN keys(rhs_ABL1) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['ABL1'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_ABL1.hgnc_symbol THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_ABL1.hgnc_symbol = rhs_ABL1.hgnc_symbol + [val])))\n",
      "\n",
      "\n",
      "// Adding edge 'phosphorylation->ABL1' from the rhs \n",
      "MERGE (rhs_phosphorylation)-[rhs_phosphorylation_rhs_ABL1:edge]->(rhs_ABL1)\n",
      "\n",
      "\n",
      "// Adding edge 'activity->PK' from the rhs \n",
      "MERGE (rhs_activity)-[rhs_activity_rhs_PK:edge]->(rhs_PK)\n",
      "\n",
      "\n",
      "// Adding edge 'mod->phosphorylation' from the rhs \n",
      "MERGE (rhs_mod)-[rhs_mod_rhs_phosphorylation:edge]->(rhs_phosphorylation)\n",
      "\n",
      "\n",
      "// Adding edge 'PK->EGFR' from the rhs \n",
      "MERGE (rhs_PK)-[rhs_PK_rhs_EGFR:edge]->(rhs_EGFR)\n",
      "\n",
      "\n",
      "// Adding edge 'PK->mod' from the rhs \n",
      "MERGE (rhs_PK)-[rhs_PK_rhs_mod:edge]->(rhs_mod)\n",
      "\n",
      "\n",
      "// Adding properties to an edge 'PK'->'EGFR' from the rhs \n",
      "WITH rhs_mod_id, rhs_PK, rhs_phosphorylation, rhs_activity_id, rhs_PK_rhs_EGFR, rhs_activity, rhs_mod, rhs_phosphorylation_id, rhs_PK_id, rhs_ABL1, rhs_EGFR_id, rhs_ABL1_id, rhs_EGFR \n",
      "FOREACH(dummy IN CASE WHEN NOT 'start' IN keys(rhs_PK_rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK_rhs_EGFR.start = [300])\n",
      "FOREACH(dummy IN CASE WHEN 'start' IN keys(rhs_PK_rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [300] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK_rhs_EGFR.start THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK_rhs_EGFR.start = rhs_PK_rhs_EGFR.start + [val])))\n",
      "FOREACH(dummy IN CASE WHEN NOT 'end' IN keys(rhs_PK_rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tSET rhs_PK_rhs_EGFR.end = [500])\n",
      "FOREACH(dummy IN CASE WHEN 'end' IN keys(rhs_PK_rhs_EGFR) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [500] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_PK_rhs_EGFR.end THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_PK_rhs_EGFR.end = rhs_PK_rhs_EGFR.end + [val])))\n",
      "WITH rhs_mod_id, rhs_PK, rhs_phosphorylation, rhs_activity_id, rhs_PK_rhs_EGFR, rhs_activity, rhs_mod, rhs_phosphorylation_id, rhs_PK_id, rhs_ABL1, rhs_EGFR_id, rhs_ABL1_id, rhs_EGFR \n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_mod_id, rhs_PK, rhs_phosphorylation, rhs_activity_id, rhs_PK_rhs_EGFR, rhs_activity, rhs_mod, rhs_phosphorylation_id, rhs_PK_id, rhs_ABL1, rhs_EGFR_id, rhs_ABL1_id, rhs_EGFR\n",
      "\n",
      "// Checking consistency of introduced rhs\n",
      "MATCH (G:hierarchyNode)\n",
      "WHERE G.id = 'nugget_2'\n",
      "OPTIONAL MATCH (t_i:hierarchyNode)\n",
      "WHERE (t_i)<-[:hierarchyEdge*1..]-(G)-[:hierarchyEdge*1..]->(t_i)\n",
      "WITH DISTINCT t_i\n",
      "RETURN collect(t_i.id)\n",
      "\n",
      "// Replacing ':tmp_typing' with ':typing'\n",
      "MATCH (n:nugget_2)-[t:tmp_typing]->(m)\n",
      "OPTIONAL MATCH (:hierarchyNode {id: 'nugget_2'})-[skeleton_rel:hierarchyEdge]->(:hierarchyNode {id: labels(m)[0]}) \n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [] ELSE [1] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:typing]->(m)\n",
      ")\n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [1] ELSE [] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:transitive_typing]->(m)\n",
      ")\n",
      "\n",
      "// Addition of nodes and properties in 'action_graph'\n",
      "MATCH (n:nugget_2)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:action_graph)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:nugget_2)-[trans_type:transitive_typing]->(successor_node:action_graph)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:action_graph)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, nodes_to_merge_props, node_img\n",
      "SET node_img += new_props\n",
      "\n",
      "\n",
      "// Addition of edges and properties in 'action_graph'\n",
      "MATCH (n:nugget_2)-[rel:edge]->(m:nugget_2), (n)-[:typing]->(x:action_graph), (m)-[:typing]->(y:action_graph)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, x, y, rel_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, x, y, rel_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, x, edges_to_merge_props, y, rel_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, x, edges_to_merge_props, y, rel_img\n",
      "SET rel_img += new_props\n",
      "\n",
      "// Addition of nodes and properties in 'meta_model'\n",
      "MATCH (n:action_graph)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:meta_model)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:nugget_2)-[trans_type:transitive_typing]->(successor_node:meta_model)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:meta_model)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, nodes_to_merge_props, node_img\n",
      "SET node_img += new_props\n",
      "\n",
      "\n",
      "// Addition of edges and properties in 'meta_model'\n",
      "MATCH (n:action_graph)-[rel:edge]->(m:action_graph), (n)-[:typing]->(x:meta_model), (m)-[:typing]->(y:meta_model)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, x, y, rel_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, x, y, rel_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, x, edges_to_merge_props, y, rel_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, x, edges_to_merge_props, y, rel_img\n",
      "SET rel_img += new_props\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g3 = h.rewrite(\"nugget_2\", rule3, {}, rhs_typing=rhs_typing3)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5) Merge two modification actions of a protein kinase region in the action graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAE/tJREFUeJzt3X2w1XW9L/D3l715igeVFKVQfEih\nBA4Pmph2YgzyQg+W1eikeY6Vnk4zPVupN83weLzOnDm36cydMp1bHvE6TWU1HSWVblZWWnIhsMTA\ngsJSwBBBedqb3/0DYxRNNsr+rv3wes2sGRfrt/Z6rxl/n/17r993/XZpmiYAAAA1DWh1AAAAoP9R\nRAAAgOoUEQAAoDpFBAAAqE4RAQAAqlNEAACA6hQRAACgOkWkDymlrCqlzNrj32aWUtY8z7Z3lVI+\n8Iz7l5ZSfl9K2VxKWVNK+XqNzEDv9PS82fL0zHi0lPK1UsrwVucCepY9ZsUjz5wVT//3v+yx/ZGl\nlKaU0v70/bGllG+VUtaXUjaWUu4vpfxjC94K3UARIaWUf0jy3iSzmqYZnuSEJD9obSqgF3jr0zNj\nWnbNjc+2OA/QM/11VkxJMjXJJfvw3BuT/DHJuCQvz67jlUf3e0Jaor3VAegRTkxye9M0DyVJ0zSP\nJPlKayMBvUXTNA+XUhYkmdjqLEDP1TTNI6WU27OrkHTViUk+3jTNk0/fX7z/k9EqzoiQJPckOa+U\n8qlSygmllLZWBwJ6j1LK4UnmxgEC8AJKKWOTzEmych+edk+S/1VKObuUckT3JKNVFJH+4RWllMef\neUty6l8fbJpmfpIPJzk9yY+SrC2lfKZFWYHe4ztPz5O7s2t2/GuL8wA903dKKZuya4nV2iSfe8Zj\nF+1xfLJ0j+e+O8lPklyW5PellCWllBOrpKbbKSL9w5+apjnwmbfsOnDYrWmam5qmmZXkwCQfTHJl\nKeX0VoQFeo23Pz1TxjVN86Gmaba0OhDQI729aZoRSWYmmZDk4Gc89m97HJ9MfuYTm6bZ0DTNxU3T\nHJ/k0CRLsqvYlErZ6UaKCM/SNM2Opmm+kV2fSFjvDQDsF03T/CjJ15L824t8/vqnn/uKJKP2XzJa\nRRHpewaWUob89ZYuXJCglPKPpZQ3l1JGlFIGlFLmJDk+yb3dnhYA6E++kGR2KeXvurJxKeWaUsrE\nUkp7KWVEkn9OsrJpmse6NSVVuGpW33PbHvd/2oXnPJHk0iTzk7QlWZ3kn5umufsFnwUAsA+apllX\nSvnPJJcn2dSFp7wsybeTjEmyJbs+JH1b9yWkptI0TaszAAAA/YylWQAAQHWKCAAAUJ0iAgAAVKeI\nAAAA1e3TVbMOPvjg5sgjj+ymKMC+WrRo0fqmaQ5pdY59ZZZAz2OeAPtLV+fJPhWRI488Mvfdd9+L\nTwXsV6WU1a3O8GKYJdDzmCfA/tLVeWJpFgAAUJ0iAgAAVKeIAAAA1SkiAABAdYoIAABQnSICAABU\np4gAAADVKSIAAEB1iggAAFCdIgIAAFSniAAAANUpIgAAQHWKCAAAUJ0iAgAAVKeIAAAA1SkiAABA\ndYoIAABQnSICAABUp4gAAADVKSIAAEB1iggAAFCdIgIAAFSniAAAANUpIgAAQHWKCAAAUJ0iAgAA\nVKeIAAAA1SkiAABAdYoIAABQnSICAABUp4gAAADVKSIAAEB1iggAAFCdIgIAAFSniAAAANUpIgAA\nQHWKCAAAUJ0iAgAAVKeIAAAA1SkiAABAdYoIAABQnSICAABUp4gAAADVKSIAAEB1iggAAFCdIgIA\nAFSniAAAANUpIgAAQHWKCAAAUJ0iAgAAVKeIAAAA1SkiAABAdYoIAABQnSICAABUp4gAAADVKSIA\nAEB1iggAAFCdIgIAAFSniAAAANUpIgAAQHWKCAAAUJ0iAgAAVKeIAAAA1SkiAABAdYoIAABQnSIC\nAABUp4gAAADVKSIAAEB1iggAAFCdIgIAAFSniAAAANUpIgAAQHWKCAAAUJ0iAgAAVKeIAAAA1Ski\nAABAdYoIAABQnSICAABUp4gAAADVKSIAAEB1iggAAFCdIgIAAFSniAAAANUpIgAAQHWKCAAAUJ0i\nAgAAVKeIAAAA1SkiAABAdYoIAABQnSICAABUp4gAAADVKSIAAEB1iggAAFCdIgIAAFSniAAAANUp\nIgAAQHWKCAAAUJ0ishdXXHFFLrroohfc5qKLLspRRx2VUkruv//+SsmA3sQsgf6pN+37pZRs3rz5\nbz5+3XXXZfLkyZk0aVImT56c+fPnV0xHX6SI7Advf/vb8+Mf/zjjxo1rdRSgFzNLoH/qLfv+scce\nm7vuuivLli3Lbbfdlo997GNZtWpVq2PRi/WpIlJKyVVXXZUTTzwxRx99dH7wgx/kkksuydSpUzNx\n4sQ88MADu7e95pprMnHixEycODHnn3/+7k8ANm7cmHe9612ZMGFCZs6cmYceemivr3vqqafm8MMP\n77b3BdRllkD/1Fv2/SuuuCJnn3125s6dm1e96lU566yzsnjx4px22mk55phj8qlPfWr3titXrswb\n3/jGTJ48OdOmTcv3v//93Y/dcsstmTBhQqZMmZIrr7xyr687c+bMjBo1KkkyduzYjBkzJmvWrOly\nbthTnyoiSXLggQfml7/8Za655pqcccYZOeWUU7J48eKcd955ueqqq5IkCxYsyI033pif/exnWbZs\nWTo7O3fvgPPmzcvIkSOzfPnyfPOb38yPfvSjVr4doEXMEuifesu+v2jRotx888158MEHs3z58lx8\n8cVZsGBBli5dmhtuuCErVqxIkpxzzjl5z3vek6VLl2b+/Pk599xzs27dujz66KO54IIL8t3vfjdL\nlizJ4MGD9+n177rrrjz++OOZPn16d7w9+ok+V0TOOuusJMm0adNSSslb3vKWJMn06dOzcuXKJMnC\nhQtz9tlnZ+TIkSml5MILL8zChQuTJD/84Q/z/ve/P0ly8MEH58wzz2zBu6A77G2d7mOPPZa5c+dm\n/PjxmTRpUs4888ysW7euYkJ6ErOEv8Us6dt6y75/+umn54ADDkhbW1smT56c2bNnZ/DgwRk2bFjG\njx+fhx56KJs2bcqSJUty/vnnJ0le85rXZMqUKbnnnnty7733Ztq0aRk/fnyS5MILL+zya//mN7/J\neeedl5tvvjlDhw7tlvdH/9DnisiQIUOSJG1tbc9q921tbeno6GhVLHqBUko+/elP58EHH8yyZcty\nzDHH5OKLL251LFrELOHFMkt6t96y7/81Z7Ir2573uyvrihUrMnfu3Fx77bU59dRTu+U16D/6XBHp\nilmzZuXrX/96Nm3alKZpcv3112f27NlJktNOOy1f/epXk+z6VOvb3/52K6P2W61Ypztq1KjMnDlz\n9/0ZM2Zk9erV3fL+6BvMkp7PLKE79JZ9f8SIEZkyZUpuuOGGJMkDDzyQX/3qV5kxY0ZmzJiRxYsX\n717Cdf311+/15/3ud7/L6aefni9+8YuZM2dOt2anf+iXRWTOnDk599xzc/LJJ2fSpElJks9+9rNJ\nkssuuywbNmzIhAkT8s53vjN///d/v9ef95GPfCRjx47NmjVrMmvWrBx//PHdmr+/aOU63Z07d+ZL\nX/pS3va2t3XLe6NvMEt6B7OE/a037fs33XRT5s+fn8mTJ+ecc87JjTfemEMOOSSjR4/OV77ylbz1\nrW/N1KlTs3Xr1r3+rM985jN57LHHcvnll2fKlCmZMmVKbr/99v2WlX6oaZou36ZPn95ADUmadevW\nNU3TNCtXrmyGDx+++7GFCxc2J510UtM0TfOJT3yiufLKK3c/9pOf/KSZNm1a0zRNM3Xq1Obuu+/e\n/dhHP/rR5pOf/GSXXv9DH/pQc8YZZzSdnZ0v+b10pyT3NfuwD/eUm1lCLWZJ15knwP7S1XnS3tIW\nBC+gVet0L7rooqxYsSLf+973MmBAvzxpCH2KWQLQM5mMXTRv3rzdpyGfeVu7dm2ro/Vr+3ud7qWX\nXppFixblO9/5zj5fyhC6wizpmcwSutu+7vtr16593u3nzZvXrTlb9br0T86IdNHll1+eyy+/vNUx\n2MOcOXOydOnSnHzyyUmSE0444VnrdN/3vvdlwoQJOeyww/a6TvfXv/51rr766hx33HF53etelyQ5\n6qijfMmY/cos6ZnMErrbvu77o0ePzpIlS7oxUc96XfqnsmsZV9eccMIJzX333deNcYB9UUpZ1DTN\nCa3Osa/MEuh5zBNgf+nqPLE0CwAAqM7SrCQdHTvzq5/9Kff/4pF07NiZcccdlJPfNC7DRgxqdTS6\nwbx583LLLbc859/vuOOOjB49ugWJ6Eue3LQ9P79jdVb/dkPaBw7IxNcelr973SvS3u5zn77GLAF4\nafr90qzli9fmy1f8PB0dTbZt2XX1lEGD29I0Td587qsz95wJKaW0OCU8P0speo6maXLr/OW57aYH\nUkrJ9m2dSZLBQ9vT3l7ywStOzoSpDk7pucyTnmftw5tzxzd+m3sX/iFbt3RkyND2nDTriLzp3cdl\n9CuHtzoe/E2WZnXBQ795LP9x6U/z5KYdu0tIkmzf1pkd23fmtv+zPLfOf+AFfgLALrfOfyALbl6e\nHdt37i4hSbJtS0ee3LQj/3HpT/PQbx5rYUKgN1l275/z+QvuzN23/j5bn+pImmTrUx25+9bf5/MX\n3Jll9/651RHhJevXReSm//n/nnXAsKftWztz203Ls3njtoqpgN5m08ZtuXX+8mzf+gLzZFtnbvrC\n4oqpgN5q7cOb8+XP35PtWzvT2fnslSudnU22b+3Mlz9/T9Y+vLlFCWH/6LffEfnTqifyyJou7MCl\n5KffX5XTzxrf/aF4SXY2O7N48//Nf/3luvxh264zWWMHHZs3v/wDmT58dtpKv/3fnW72swWrUrrw\nsc4jf9yUP616Iq84cmT3h+Il2dK5OT/e+K3cvuGGPN6xNm1lYCYPe33mjvpAjhk6udXx6OPu+MZv\n07lj5wtu07ljZ+785oqc89GplVLB/tdvz4g8vGpj2tr2/t2PHds6s+rBDRUS8VJ0NDvy72v+KV/+\n86fy0NYl2dFsy45mW36/7f5c9+dLc80fz8/2nc5s0T1W/XZDdmx74YOGJGlrK3l41cYKiXgp1u1Y\nk8+smpNvrP/3rO94OB3ZkW3NU7lv8525+o/vzXfXf6nVEenj7l34h+ecCdlTZ2eTe+5cXSkRdI9+\nW0TaBnT9rbe52k2PN//Rq7J8yy+yrXnqOY9ta57K77Yuzf9+5L+3IBn9wb7MiH2ZPdS3s+nM1X/4\nh2zsWJ/tzdZnPdZkZ7Y3W/O9v1ybX266o0UJ6Q+2PuN7qy9kWxe3g56q3/5GPPr4UenYy2nPZNcV\nbyaeeGiFRLxYT3Y+kZ88cctzDhqeaXuzNb/cfHs2dqyvmIz+YuKJh2bw0L0v/evYsTPHTHx5hUS8\nWEuevCubOzekyd/+/bC92ZJvrf9CxVT0N0O6ME+SdGnuQE/Wb4vIgS8fmldPH529fThZSjL9DWPr\nhOJFWbT5zgxIWxe2LPnFpu93ex76n+lvGJu9XeV7wIDkNdMPzQGjhtQJxYvyw8e/nq3Nk3vdbv2O\nh/Podsti6B4nzTpir8vH29pKZsweVykRdI9+W0SS5L0fn55hIwf/zTIyaHBbLvzsSRk4qCsHubTK\nEx2PZUezfa/b7Wi2OSNCtxg4aNesGDT4+WfFgAHJsJGDc+7Hp1VOxr56vGNtl7ZrKwPzRKfLMdM9\n3vTu49I28IUP0doGDsjsdx1bKRF0j35dRA46ZGguu3ZWXj390LQPGpAhL2vP4KHtGTSkLYcdMSIf\nufqUTJoxptUx2YvhbQelvQzc63YDy+AMbzuwQiL6o0kzxuQjV5+Sw44YkUFD2jJ4aHuGvKw97YMG\n5DUnHJrLrp2Vgw4Z2uqY7MWItlFd2q6z6ciwAQd0cxr6q9GvHJ4Pfm5GBg1pe86Zkba2kkFD2vLB\nz83wRw3p9fr94sKDDhmaj13z+mxYtyUrlq3Pzs6dGTNuZMYdd1Cro9FF04e/MTeuvbILWzZ57Yj/\n1u156L/GTxmdK792elb/dkP+vPqJDGgbkGMnHayA9CIzD3x3Vm5ZstflWQe2H5Ixg46ulIr+aNJJ\nY/K562bnzm+uyD13rs62LR0ZPLQ9M2aPy+x3HauE0Cf0+yLyVwcdMjSvPe3wVsfgRRjRPiqvHTEn\nv9i0IDua579Eb3sZlMnD3pBRAw+rnI7+aNxxB/kwo5eaNnxWhrT9a7Z1PJUmz3/51EFlaN7x8g+n\n7O2LQfASjX7l8Jzz0an+Vgh9Vr9emkXfcf6h83LkkOMzuDz3k+dBZWjGDjo2/zTmmhYkA3qT9jIw\nlxx+Q4a1HZCBZfBzHh9UhuaNB74npxzwthakA+hbnBGhTxg0YHAuOfw/8/Mn/iu3/uW6/Gn775Ik\nhw48Im8ZdUFeN/KMDBwwqMUpgd5gzKCj8z+OXJCFj9+UhY/flM2dj2dASl79shl5y6gLc/ywk1sd\nEaBPUEToM9rLwLz+gHfk9Qe8IzubXX8DYEBx0g/YdyPbR+XMgz+cMw/+cDqbjgxIm6VYAPuZIkKf\npIAA+0tb8asSoDs4WgMAAKpTRAAAgOoUEQAAoDpFBAAAqE4RAQAAqlNEAACA6hQRAACgOkUEAACo\nThEBAACqU0QAAIDqFBEAAKA6RQQAAKhOEQEAAKpTRAAAgOoUEQAAoDpFBAAAqE4RAQAAqlNEAACA\n6hQRAACgOkUEAACoThEBAACqU0QAAIDqFBEAAKA6RQQAAKhOEQEAAKpTRAAAgOoUEQAAoDpFBAAA\nqE4RAQAAqlNEAACA6hQRAACgOkUEAACoThEBAACqK03TdH3jUtYlWd19cYB9NK5pmkNaHWJfmSXQ\nI5knwP7SpXmyT0UEAABgf7A0CwAAqE4RAQAAqlNEAACA6hQRAACgOkUEAACoThEBAACqU0QAAIDq\nFBEAAKA6RQQAAKju/wMs7IHRi7AGKQAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"mod_1\", \"mod_2\"])\n",
    "rule4 = Rule.from_transform(pattern)\n",
    "merged_mod = rule4.inject_merge_nodes([\"mod_1\", \"mod_2\"])\n",
    "plot_rule(rule4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_mod_1:action_graph { id : '46'}) , (lhs_mod_2:action_graph { id : '95'})  \n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH lhs_mod_1 as p_mod_1, lhs_mod_2 as p_mod_2 \n",
      "\n",
      "// Merging nodes '{'mod_1', 'mod_2'}' of the preserved part into 'mod_1_mod_2' \n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, p_mod_2, p_mod_1\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_mod_1) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_mod_1[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_mod_2, p_mod_1\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_mod_2) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_mod_2[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_mod_2, p_mod_1\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, p_mod_2, p_mod_1\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, p_mod_2, p_mod_1\n",
      "SET p_mod_1 = new_props\n",
      "WITH p_mod_1 as rhs_mod_1_mod_2, p_mod_2\n",
      "// set appropriate node id\n",
      "SET rhs_mod_1_mod_2.id = toString(id(rhs_mod_1_mod_2))\n",
      "SET rhs_mod_1_mod_2.count = NULL\n",
      "WITH toString(id(rhs_mod_1_mod_2)) as uid04b3737297f945a3a53644f149cab2af, rhs_mod_1_mod_2, p_mod_2\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_maps, [] as pred_maps, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "OPTIONAL MATCH (rhs_mod_1_mod_2)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(rhs_mod_1_mod_2)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "OPTIONAL MATCH (p_mod_2)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(p_mod_2)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN [id(rhs_mod_1_mod_2),id(p_mod_2)] THEN [toString(el['id'])] ELSE [] END) as self_loops, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, self_loops, p_mod_2\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, self_loops, p_mod_2\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (rhs_mod_1_mod_2)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(rhs_mod_1_mod_2)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (rhs_mod_1_mod_2)-[new_rel:edge]->(rhs_mod_1_mod_2)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "OPTIONAL MATCH (rhs_mod_1_mod_2)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "OPTIONAL MATCH (pred)-[:typing]->(rhs_mod_1_mod_2)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "OPTIONAL MATCH (p_mod_2)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "OPTIONAL MATCH (pred)-[:typing]->(p_mod_2)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (rhs_mod_1_mod_2)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(rhs_mod_1_mod_2))\n",
      "DETACH DELETE (p_mod_2)\n",
      "\n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_mod_1_mod_2, uid04b3737297f945a3a53644f149cab2af, p_mod_2\n",
      "\n",
      "\n",
      "// Up-propagation to the graph 'meta_model'\n",
      "\n",
      "// Matching of the nodes to merge in 'meta_model'\n",
      "WITH [] as merged_nodes\n",
      "OPTIONAL MATCH (n:action_graph)-[:typing]->(node_to_merge:meta_model)\n",
      "WITH n, collect(node_to_merge) as nodes_to_merge, merged_nodes\n",
      "WHERE n IS NOT NULL AND size(nodes_to_merge) >= 2\n",
      "UNWIND nodes_to_merge as node_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, node_to_merge, merged_nodes, n\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(node_to_merge) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in node_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, node_to_merge, merged_nodes, n\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(new_props) as new_props_col, merged_nodes, n\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge, merged_nodes, n\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, merged_nodes, nodes_to_merge, n\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, merged_nodes, nodes_to_merge, n\n",
      "WITH nodes_to_merge[0] as merged_node, new_props, merged_nodes, nodes_to_merge, n\n",
      "SET merged_node = new_props\n",
      "// set appropriate node id\n",
      "SET merged_node.id = toString(id(merged_node))\n",
      "SET merged_node.count = NULL\n",
      "WITH toString(id(merged_node)) as merged_id, merged_node, merged_nodes, nodes_to_merge, n\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "//create a map from node ids to the id of the merged_node\n",
      "WITH {old_node:node_to_merge.id,  new_node:merged_node} as id_to_merged_id, node_to_merge, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(id_to_merged_id) as ids_to_merged_id, collect(node_to_merge) as nodes_to_merge, merged_node, merged_nodes, merged_id, n\n",
      "WITH apoc.map.groupByMulti(ids_to_merged_id, 'old_node') as ids_to_merged_id, merged_node, merged_nodes, merged_id, nodes_to_merge, n\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(ids_to_merged_id) | \n",
      "\tpairs + [k, REDUCE(values=[], v in ids_to_merged_id[k] | \n",
      "\t\tvalues + CASE WHEN v.new_node IN values THEN [] ELSE v.new_node END)])) as ids_to_merged_id, merged_node, merged_nodes, merged_id, nodes_to_merge, n\n",
      "WITH collect({n:n, nodes_to_merge:nodes_to_merge, merged_node: merged_node, merged_id: merged_id}) as all_n, collect(ids_to_merged_id) as ids_to_merged_id, merged_nodes\n",
      "WITH reduce(acc={}, x in ids_to_merged_id | apoc.map.merge(acc, x)) as ids_to_merged_id, all_n, merged_nodes\n",
      "UNWIND all_n as n_maps\n",
      "WITH n_maps.n as n, n_maps.nodes_to_merge as nodes_to_merge, n_maps.merged_node as merged_node, n_maps.merged_id as merged_id, ids_to_merged_id, merged_nodes\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "OPTIONAL MATCH (node_to_merge)-[out_rel:edge]->(suc)\n",
      "WITH CASE WHEN suc.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[suc.id][0]), neighbor: ids_to_merged_id[suc.id][0], edge: out_rel}\n",
      "\t\tELSE {id: id(suc), neighbor: suc, edge: out_rel} END AS suc_map, node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(suc_map) as suc_maps, node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(node_to_merge)\n",
      "WITH CASE WHEN pred.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[pred.id][0]), neighbor: ids_to_merged_id[pred.id][0], edge: in_rel}\n",
      "\t\tELSE {id: id(pred), neighbor: pred, edge: in_rel} END AS pred_map, node_to_merge, suc_maps, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(pred_map) as pred_maps, suc_maps, node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(node_to_merge.id) as list_ids, collect(suc_maps) as suc_maps_col, collect(pred_maps) as pred_maps_col, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH REDUCE(init=[], maps in suc_maps_col | init + maps) as suc_maps, REDUCE(init=[], maps in pred_maps_col | init + maps) as pred_maps, list_ids, nodes_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN list_ids THEN [toString(el['id'])] ELSE [] END) as self_loops, ids_to_merged_id, merged_node, merged_nodes, nodes_to_merge, merged_id, list_ids, n\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, ids_to_merged_id, merged_node, self_loops, merged_nodes, nodes_to_merge, merged_id, n\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, ids_to_merged_id, merged_node, self_loops, merged_nodes, nodes_to_merge, merged_id, n\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "WITH ids_to_merged_id, merged_node, merged_nodes, nodes_to_merge, merged_id, n\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, node_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "OPTIONAL MATCH (node_to_merge)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, node_to_merge, pred_typings, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "OPTIONAL MATCH (pred)-[:typing]->(node_to_merge)\n",
      "WITH pred_typings + collect(pred) as pred_typings, node_to_merge, suc_typings, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(suc_typings) as suc_typings_col, collect(pred_typings) as pred_typings_col, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "WITH REDUCE(init=[], sucs in suc_typings_col | init + sucs) as suc_typings, REDUCE(init=[], preds in pred_typings_col | init + preds) as pred_typings, nodes_to_merge, ids_to_merged_id, merged_node, merged_nodes, merged_id, n\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (merged_node)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(merged_node))\n",
      "WITH ids_to_merged_id, merged_node, merged_nodes, nodes_to_merge, merged_id, n\n",
      "FOREACH(node in filter(x IN nodes_to_merge WHERE x <> merged_node) |\n",
      "\tDETACH DELETE node)\n",
      "RETURN collect(merged_id) as merged_nodes\n"
     ]
    }
   ],
   "source": [
    "action_graph_mod_1 = h.node_type(\"nugget_1\", rhs_g1[\"mod\"])[\"action_graph\"]\n",
    "action_graph_mod_2 = h.node_type(\"nugget_2\", rhs_g3[\"mod\"])[\"action_graph\"]\n",
    "rhs_g4 = h.rewrite(\n",
    "    \"action_graph\", rule4, \n",
    "    {\"mod_1\": str(action_graph_mod_1), \"mod_2\": str(action_graph_mod_2)})\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Instantiation use-case / up-propagation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PK EGFR1\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAHmRJREFUeJzt3XtwVOed5vHnbV2QQFejCwjJCLBA\nFkISDsQYKIy5GAthe6aGeFnbSVybdTzZqrhq1huPd8rZcYqtqZqMk4o3uxNmx1XDJplsxkuKxEEC\nA8aGAQy2sGWhCGQZhAEJhCSE7rfufvcPgQdsLi2iPqcP/f1UqWypzzl+VJZ+Ok/36fcYa60AAAAA\nwEk+twMAAAAAiD4UEQAAAACOo4gAAAAAcBxFBAAAAIDjKCIAAAAAHEcRAQAAAOA4iggAAAAAx1FE\n7iDGmFPGmFVf+NpyY8zZ62z7rjHmP171+V8ZY5qMMb3GmLPGmH9xIjMAb7o8bwYuz4xWY8xmY0yS\n27kARJYvzIrzV8+Ky//+37+wfb4xxhpjYi9/nmuM+Y0xpt0Y02WMqTPGPOPCt4IwoIhAxphvSvq6\npFXW2iRJCyS97W4qAB7w6OWZcZ9G58bLLucBEJmuzIoySfMl/dcx7PsLSWckTZc0WaPnK63jnhCu\niHU7ACLCQklvWWtPSJK19ryk/+1uJABeYa1tNsZsl1TsdhYAkctae94Y85ZGC0moFkr6C2tt3+XP\nPxr/ZHALr4hAkg5J+oYx5nvGmAXGmBi3AwHwDmNMnqS14gQBwE0YY3IllUv6dAy7HZL0v4wxG4wx\nd4cnGdxCEYkOOcaYS1d/SFp65UFr7S8lfVfSGkl7JV0wxvylS1kBeMdvL8+T/RqdHX/jch4Akem3\nxpgejV5idUHSX1/12H/5wvlJ7Rf2/Zqkf5X0fUlNxpgaY8xCR1Ij7Cgi0aHFWpt29YdGTxw+Z639\nZ2vtKklpkv5c0kZjzBo3wgLwjD+5PFOmW2v/k7V2wO1AACLSn1hrkyUtl1QoKeOqx179wvlJydU7\nWms7rbUvWWvnSsqWVKPRYmMcyo4woojgGtbaEWvt/9PoMxJc7w0AAMaFtXavpM2SXr3N/dsv75sj\n6a7xSwa3UETuPHHGmIQrHwphQQJjzDPGmApjTLIxxmeMKZc0V9LhsKcFAADR5CeSVhtjSkPZ2Bjz\nt8aYYmNMrDEmWdJ3JH1qre0Ia0o4glWz7jxVX/j8QAj7dEv6K0m/lBQj6TNJ37HW7r/pXgAAAGNg\nrW0zxvxc0n+T1BPCLhMlbZU0VdKARp8kfSx8CeEkY611OwMAAACAKMOlWQAAAAAcRxEBAAAA4DiK\nCAAAAADHUUQAAAAAOG5Mq2ZlZGTY/Pz8MEUBMFZHjhxpt9Zmup1jrJglQORhngAYL6HOkzEVkfz8\nfFVXV99+KgDjyhjzmdsZbgezBIg8zBMA4yXUecKlWQAAAAAcRxEBAAAA4DiKCAAAAADHUUQAAAAA\nOI4iAgAAAMBxFBEAAAAAjqOIAAAAAHAcRQQAAACA4ygiAAAAABxHEQEAAADgOIoIAAAAAMdRRAAA\nAAA4jiICAAAAwHEUEQAAAACOo4gAAAAAcBxFBAAAAIDjKCIAAAAAHEcRAQAAAOA4iggAAAAAx1FE\nXJSfn6/CwkKVlZV9/nHq1CmNjIzolVde0Zw5czR37lyVlpZq/fr1qq+vlyRt3rxZaWlp1+zX0NAg\nSTLGqKSkRKWlpSopKdGbb77p5rcIwCHMEwDjgVkCJ8W6HSDabdmyRcXFxdd87emnn1Z/f78OHz6s\ntLQ0WWtVVVWlhoYGFRUVSZJWrVqlLVu2XPeYBw8eVFJSkrZv364nnnhCnZ2dio3lfzVwp2OeABgP\nzBI4hZ+ACNPY2KitW7fq7NmzSktLkzT6TEJFRcWYj7V8+XL19vaqs7NTmZmZ4x0VQIRjngAYD8wS\nhAtFxGXr169XQkKCJCk2NlYvvviiCgoKlJ6eftP9du/erbKyMknSjBkztHXr1i9ts3XrVq1YsYJf\ndCBKME8AjAdmCZxCEXHZF1/+fOONN655vL6+Xk8++aT6+/tVXl6u1157TdLNX/5cvHixenp6dP78\nee3Zsyd84QFEFOYJgPHALIFTeLN6hJk/f74aGxt16dIlSVJRUZFqamr0/PPPq6urK6RjHDx4UE1N\nTdq4caM2bNigwcHBcEYGEKGYJwDGA7ME4UIRiTAFBQV6/PHH9eyzz17zy93X1zfmY73wwgvKzs7W\npk2bxjMiAI9gngAYD8wShAuXZrns6uswJen111/X5s2btXHjRi1cuFBxcXFKT09XTk6OXnrppTEd\n2xijV199VRs2bNBzzz2nxMTE8Y4PIIIwTwCMB2YJnGKstSFvvGDBAltdXR3GOADGwhhzxFq7wO0c\nY8UsASIP8wTAeAl1nnBpFgAAAADHUUQAAAAAOI4iAgAAAMBxFBEAAAAAjqOIAAAAAHAcy/d6xPBw\nt9rbazUy0qe4uEnKyChVfHyy27EAeFBvb7M6OxsUDPqVmJihjIx58vni3I4FwGOsDerixePq622W\njFFKygylps6UMcbtaPAIikiECwRG1PjJr9XeXidjjILBEfl8cTp54vfKyJyngoJ/p5gYTiAA3NrA\nQLuO1W/WwEC7gsGApKB8vglqbNyi/Py1mjZtqdsRAXhER3udPvnkDVnrVyAwJMnI54tTXNwkFd77\ndaWkTHc7IjyAS7MiWDAY0NGjm9TRUSdr/QoGRy5/fUTW+tXRflR1R/9B1gZcTgog0g0OXlTNRz9R\nX9/5y7MkKEkKBocUDAzpVNM2nTn9trshAXhCW1utjh//pfz+vsslRJKsgsFhDQ116mjtz9TTfdrV\njPAGikgEa2+rUV9vi4JB/3UfDwb96u1tVlvbxw4nA+A1J0/8Tn7/oKTr38Q2GBzRZ5/t1PBwt7PB\nAHhKMOhX4yf/8vmTo9ffZkQNDf/XwVTwKopIBDtzZo+CweGbbhMMDuvsmXccSgTAi4aHe3Xx4nHd\nqIRc7dy5Q+EPBMCzOjrqFMosGRrqVE/PmfAHgqdRRCKUtVb9/a0hbdvffz7MaQB4WX/fOfl8t35L\noLV+dV064UAiAF7V3f3ZVZdj3Vxv79kwp4HXUUQAAP+GxW4A3AQjAuOJIhKhjDGaOHFKSNtOnDg1\nzGkAeNmkpKk3fK/Z1YyJU1pqgQOJAHhVckq+jAlttc7k5LvDnAZeRxGJUMFgUJe6MhUI3Py5B58v\nXnl5DzmUCoAXDQ8b9fUny97ysm6rKVPvdyISAI8aHEyT33/r1ToTEiYrKWmaA4ngZRSRCGSt1d69\ne3XixKA6L1n5/dc/e/D54pScnKeMzBKHEwLwioGBAVVWVur06RQND1sFg9ffzueLU35+OTdKBXBD\n586d065db+vkybQbnptIo0+Szp6zwcFk8CqKSATav3+/GhsbderUZ9q1q0/dPcmy1ly+8/HoP42J\nVUZmmYrnfVvGxLgdGUAEGhoaUmVlpTo6OlRT06B/3R+joaEJstZ3eW4YxcRMUExMgmbOeky5ecvd\njgwgQl24cEE7duxQV1eX9h84oeMNKfL7YyQTJ2l0pvh88UpImKyS0u8oOTnP7cjwAO6sHmHee+89\nHTt2TKdPn1ZHR4dKSkrU15euZctWanDwpEZG+hQXl6SMjGLFxSW5HRdAhBoeHlZVVZXa29tVX1+v\nhIQE5eTcI5kZuu++YnV1NSoY9CsxMVN3TS4KaVUtANGpo6NDVVVV6u7uVl1dnWbOnKmYmCxlZi3W\ntJxY9fa1yMgoJSX/8ntIeEs7QsNfnghSXV2to0ePqrm5Wa2trSotLVVqaqrWrVunlJQUSdluRwTg\nAX6/Xzt27FBra6vq6+sVGxur2bNnKy8vTytXrlRMTIySknPcjgnAAzo7O1VZWanu7m4dPXpU06dP\nV1ZWlu6//34VFxdLktLvKnQ5JbyKS7MiRE1NjT788EOdO3dOzc3NmjdvnlJSUq4qIQBwa4FAQDt3\n7lRLS4saGhpkjNGcOXOUk5Ojhx9+WDExXMoJIDTd3d3XlJBp06ZpypQpuu+++1RaWup2PNwBKCIR\noK6uTu+//75aW1t1+vRpzZs3T6mpqaqoqFBaWprb8QB4RDAY1O7du3XmzBk1NjbK7/fr3nvv1ZQp\nU/TII48oNpYXwQGEpre3V9u2bVNXV5dqa2s1ZcoUTZs2TSUlJVqwYIHb8XCHoIhEgLa2NrW1tamp\nqUnFxcVKSUlReXm5Jk+e7HY0AB4yNDSkrq4uffrppxocHFRRUZEyMzO1du1axcWFtu4/AEijr4b0\n9PTo6NGjysjIUF5enoqKirRo0SK3o+EOQhGJADNnzlR/f7+Ki4uVmpqq8vJyZWVluR0LgMckJiYq\nKytLxhgVFxcrIyNDFRUVio+PdzsaAI/JyMhQfHy8Jk+erPz8fM2ePVtLlixxOxbuMLxO77Lm5mbt\n3btXzz//vJqampSbm6spU0K7ozoAXK26ulodHR16+eWX9cEHH+iBBx5QQkKC27EAeMyVBS8KCgpU\nUVGhhoYGLV26lNWwMO4oIi46f/683n77ba1evVrZ2dnKzmZVLAC3p6amRidPntRjjz2mhIQErVy5\n0u1IADzoyoIXKSkpWrJkiYwxXKWBsOHSLJe0tbVp586dWrFihaZOnep2HAAeVldXp+PHj2vdunW8\nAgLgtl1Z8CI+Pl7Lli3jFRCEHUXEBRcvXtSOHTu0bNky5ebmuh0HgIcdP35ctbW1WrdunSZOnOh2\nHAAeZa3VO++8I2utVqxYIZ+PU0SEHz9lDrt06ZKqqqq0ePFi5efnux0HgId9+umnOnLkiCoqKpSU\nlOR2HAAeZa3V3r17NTg4qNWrV1NC4Bh+0hzU09OjqqoqffWrX9WsWbPcjgPAw5qamnTo0CGtXbtW\nqampbscB4GEHDhxQd3e31qxZw01P4SiKiEP6+vq0bds2lZWVafbs2W7HAeBhp0+f1v79+/XII48o\nPT3d7TgAPOzQoUNqa2vjpqdwBUXEAQMDA6qsrNTcuXNVVFTkdhwAHtbS0qJ3331Xa9asUUZGhttx\nAHjYkSNHdPbsWa1du5b7DcEVFJEwGxwcVGVlpWbNmqWSkhK34wDwsNbWVu3evVurV69mOU0Af5SP\nP/5YJ06cUEVFhSZMmOB2HEQpikgYDQ8Pq6qqSnl5efrKV77idhwAHtbe3q633npLDz30EEt+A/ij\n/OEPf9CxY8dUUVGhxMREt+MgilFEwuTKXUmzs7N1//33ux0HgIddvHhR27dv17Jly5SXl+d2HAAe\n1tDQoI8//lgVFRWaNGmS23EQ5aK2iOTn56uwsFClpaUqLi7Wr3/9a7377rtasGDB59u8//77ys3N\n1bZt28Z07EAgoLfeekupqalavHjxeEcHEGHCOU+6urpUVVWlBx54gCW/gSgQznly4sQJffDBB6qo\nqFBycvJ4RwfGLKqXR9iyZYuKi4v10UcfafHixfrFL37x+WN79uzR17/+df3qV7/Sgw8+GPIxg8Gg\ndu3apYSEBO5KCkSRcMyTnp4eVVZWauHChbrnnnvCERtABArHPDl16pQOHjyoiooKlvxGxIjaV0Su\nNn/+fCUnJ6upqUmS9Pvf/17f+MY39Lvf/W7MJeTtt9+Wz+fTQw89RAkBotB4zZO+vj5VVlaqtLRU\nc+bMCVdcABFsvObJ2bNntW/fPpWXl+uuu+4KV1xgzKL6FZEr3nnnHQ0ODqqgoECNjY166qmn9N57\n72nu3LkhH+PKXUlHRka0Zs0a7koKRKnxmCdXlvy+9957x7QfgDvLeMyTc+fOac+ePSz5jYgU1UVk\n/fr1SkhIUEpKin7zm98oLi5OU6dOVWpqqjZt2qSf/vSnIR9r//796u3tVXl5OXclBaLQeM2ToaEh\nVVZWaubMmSotLQ1zagCRaLzmyYULF7Rr1y6tWrVK2dnZYU4NjF1UP22/ZcsW1dTUaN++fVq9erUk\nKSkpSTt37tThw4f13e9+N6TjvPfee+ro6OCupEAUG495cmXJ79zc3GvemAoguozHPLmy5Pfy5cuV\nk5MT7sjAbYnqInIjqamp2rVrV0i/7B988IFaWlpUXl6uuLg4hxIC8IpQ58mVJb8zMzO1aNEiBxMC\n8IpQ50lnZ6d27NihpUuX6u6773YwITA2FJEbSE1N1c6dO3Xo0KEb/rLX1NTo1KlT3JUUwE3dap5c\nWfI7JSVFS5YscSEhAK+41Tzp7u5WVVWVFi1apBkzZriQEAidsdaGvPGCBQtsdXV1GON4R11dnerq\n6vTYY49p4sSJbsdBlDLGHLHWeu4aHmbJvwkGg9q5c6diY2O1cuVKVtuDa5gn3tfb26s333xT9913\nnwoLC92OgygW6jzhFZHbcPz4cdXW1mrdunWUEAC3LRgMas+ePTLGaMWKFZQQALetv79f27ZtU0lJ\nCSUEnkERGaPGxkYdOXJE69atU1JSkttxAHiUtVb79u3T8PCwVq1axZLfAG7b4OCgtm3bpsLCQhUX\nF7sdBwgZf/nGoKmpSYcPH9batWuVkpLidhwAHnbgwAF1d3fr4YcfZslvALftypLfM2bMUFlZmdtx\ngDGhiITo9OnT2r9/vx555BGlp6e7HQeAhx06dEjt7e0s+Q3gjzIyMqLt27crJydHCxcudDsOMGYU\nkRC0tLTo3Xff5a6kAP5o1dXVam5uVnl5ueLj492OA8Cjriz5PXnyZD3wwANuxwFuC0/FXdbW36r6\njo8VCPp1d8oMzUorlDFGra2t2r17t1avXq2srCy3YwKIcNZanbh0XKe7mxTji1XR5FJlThy9o3FN\nTY1OnjypRx99lCW/AdySP+hX7YVqdQ62a1J8ssqyvqqE2EQFAgHt3LlTSUlJWrp0qdsxgdsW9UWk\nvf+C/ueHf6M/tNcoxoxep21lNTkxU/9+xrfV9F6zVqxYoalTp7qcFECkq71QrU01f6eOgTYZja6A\nFbABzc0o0+pJf6YzDc169NFHlZiY6HJSAJHMWqvfNv5KWxr+j4I2KGutjDEK2qBW5z+maednKz4+\nXg8++CCr7cHTorqItPdf0H/e84x6R3oUtAGNXPVYS+8Z/aT2B/oPpX+h3Nxc1zIC8Ibqcwf0w/df\n1nBg6EuP1V6o1jFbqx+ufF2TJk1yIR0AL/mHmh/pndNVGgoMfumxHSe2KtuXq5+s+ydW24PnRfVP\n8M8++lv1DncraAPXfTxg/PrlZ3+vkcCww8kAeMlwYEg/+uCvr1tCJCmooEbMsH7e+PcOJwPgNcc6\nam9YQiTJrxG1m3Pad3anw8mA8Re1ReTiQLtq244oqOBNt7OyOtC8x6FUALzoQPMeWdmbbhNUULUX\nqnVxoN2hVAC8aOsn/3zDJzWuGAoM6jef/MKhRED4RG0ROX7xqGJ9cbfcbtDfr49aDzuQCIBXfXT+\nsAb9A7fcLtYXp4aLdQ4kAuBV9e01t3xiQ5LO9zVr6BaFBYh0UVtEgjYohfCLLo2uWgEANxKwoc4I\nq8ANLgUFAEkK2tDOTYx8CnJ+Ao+L2iIyPWVmSCcE8b4JKrjrXgcSAfCqe9LvVbzv1svxBmxA01Nm\nOZAIgFflJk8PabtJcUlKiJ0Y5jRAeEVtEclLmaFpSbf+ZbeyWjl9nQOJAHjVyunrQrqUIjdpuvJS\n8sMfCIBn/ensp5QQc/MlvuN88Xr0nidYuheeF7VFRJK+M/97mhCTcMPHJ8Qk6InCZ5Qcn+JgKgBe\nkzIhVU8UPnPLefLn87/nYCoAXvTVqUs1PXWm4nzx1308xsQobUK6ymf+mcPJgPEX1UVk9l1z9f3F\nP1JyfKoSr3p5c0JMguJ98fpa4TNaP+ebLiYE4BXr53xTXyt8RvG++GsKSWLsRCXHp+r7i3+k2XfN\ndTEhAC+I8cXqB0v/h0qzFireF68YM3rLNyOfJsQkKD+1QD986HUlxSe7nBT440X1DQ0lqThzvjav\n/b0+OHdAH144JH9gRLPS52j53eWaFJfkdjwAHmGM0fo539AjM/5U757eoZOXGhQbE6f7shdp4ZQl\nivFF/bgFEKKE2ES9vPjvdK73rPZ8VqW2/vNKnZCuZXkPa1b6HLfjAeOGv4waffZh0bQHtWjag25H\nAeBxSfHJWnfP19yOAeAOMDUpV0/N/bbbMYCwiepLswAAAAC4gyICAAAAwHEUEQAAAACOo4gAAAAA\ncBxFBAAAAIDjKCIAAAAAHEcRAQAAAOA4iggAAAAAx1FEAAAAADiOIgIAAADAcRQRAAAAAI6jiAAA\nAABwHEUEABAR8vPzVVhYqLKyss8/Tp06pZGREb3yyiuaM2eO5s6dq9LSUq1fv1719fWSpM2bNyst\nLe2a/RoaGiRJxhiVlJSotLRUJSUlevPNNz//79XU1GjJkiWaOHGi1q9f78r3DGD8MUu8I9btAAAA\nXLFlyxYVFxdf87Wnn35a/f39Onz4sNLS0mStVVVVlRoaGlRUVCRJWrVqlbZs2XLdYx48eFBJSUna\nvn27nnjiCXV2dio2NlZZWVn68Y9/rJqaGu3atSvs3xsA5zBLvIEiAgCIWI2Njdq6davOnj2rtLQ0\nSaPPTFZUVIz5WMuXL1dvb686OzuVmZmpnJwc5eTk6NixY+MdG0CEYZZEJooIACBirF+/XgkJCZKk\n2NhYvfjiiyooKFB6evpN99u9e7fKysokSTNmzNDWrVu/tM3WrVu1YsUKZWZmjn9wABGFWeINFBEA\nQMT44uUUb7zxxjWP19fX68knn1R/f7/Ky8v12muvSbr55RSLFy9WT0+Pzp8/rz179oQvPICIwSzx\nBt6sDgCIWPPnz1djY6MuXbokSSoqKlJNTY2ef/55dXV1hXSMgwcPqqmpSRs3btSGDRs0ODgYzsgA\nIhCzJDJRRAAAEaugoECPP/64nn322WtOFvr6+sZ8rBdeeEHZ2dnatGnTeEYE4AHMksjEpVkAgIhx\n9XXdkvT6669r8+bN2rhxoxYuXKi4uDilp6crJydHL7300piObYzRq6++qg0bNui5555Ta2urli5d\nqv7+fg0ODio3N1c/+MEP9K1vfWu8vy0ADmOWeIOx1oa88YIFC2x1dXUY4wAYC2PMEWvtArdzjBWz\nBIg8zBMA4yXUecKlWQAAAAAcRxEBAAAA4DiKCAAAAADHUUQAAAAAOI4iAgAAAMBxFBEAAAAAjuM+\nIgAAz/L7B9V6/n01N+/T8HC3jIlR+l2Fyst9SMkpd7sdD4CHDAx0qLl5n9oufKhAYEixsQnKzr5f\nOdOWasKEVLfj3ZEoIgAATxocvKiPa34qv39AweCIJMnagDraj6rz4jHl5a3S3dNXuZwSgBd0dNTr\n+LGfy9qgrA1IkkZG+tTcvFctLftVPO9ZpabOdDnlnYdLswAAnmNtULUf/0zDwz2fl5CrHlUwOKIz\nZ3arvb3WlXwAvKO/v1XHj/1cweDI5yXkCmsDCgaHVVf3jxoa6nIp4Z2LIgIA8JyLF+vl9/dJsjfc\nJhgc0WendjgXCoAnnT3zjoJB/023scGgzrUccChR9KCIAAA851zLIQUCQ7fcbnDwogYG2h1IBMCL\nrLVqa/tIN3tSY3Q7v86ff9+ZUFGEIgIA8Jzh4e6QtjMmRiPDPWFOA8CrRi+9Ctx6Q0l+/0CY00Qf\niggAwHPi4iaFtJ21AcXGTQxzGgBeZUyMjAntdDg2dkKY00QfiggAwHOmTF2kmJhbnxTEx6coMTHL\ngUQAvMgYo4yMeZLMLbaLUVbWAmdCRRGKCADAcyZPLr5cRG588uDzxevu6WtkzM1PMABEt7y8lfL5\nbn5HC2NilDNtqUOJogdFBADgOT5fjOaVfEexsYky5ssnED5fvKbmLFZ29ldcSAfASyYl5ahg9hPy\n+eL05Sc3fPL54lRU9E0lJNzlRrw7Gjc0BAB40sSJWfrKgr/UuZYDamnZL7+/X5JRWto9ys1bofT0\n2W5HBOARWVn3adKkqTpzZo/a22plrV8+X5yyshcoN/dBJSZmuh3xjkQRAQB4Vnx8kqbnr9H0/DWX\nb0Tm41IsALdl0qSpKix8Sip8StYGZEyM25HueBQRAMAdgZMGAOOFeeIM3iMCAAAAwHEUEQAAAACO\no4gAAAAAcBxFBAAAAIDjKCIAAAAAHEcRAQAAAOA4iggAAAAAx1FEAAAAADiOIgIAAADAcRQRAAAA\nAI6jiAAAAABwHEUEAAAAgOMoIgAAAAAcRxEBAAAA4DiKCAAAAADHUUQAAAAAOI4iAgAAAMBxFBEA\nAAAAjqOIAAAAAHAcRQQAAACA4ygiAAAAABxHEQEAAADgOIoIAAAAAMdRRAAAAAA4jiICAAAAwHEU\nEQAAAACOo4gAAAAAcBxFBAAAAIDjKCIAAAAAHEcRAQAAAOA4iggAAAAAx1FEAAAAADiOIgIAAADA\nccZaG/rGxrRJ+ix8cQCM0XRrbabbIcaKWQJEJOYJgPES0jwZUxEBAAAAgPHApVkAAAAAHEcRAQAA\nAOA4iggAAAAAx1FEAAAAADiOIgIAAADAcRQRAAAAAI6jiAAAAABwHEUEAAAAgOMoIgAAAAAc9/8B\n1GqPViw6CI0AAAAASUVORK5CYII=\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"EGFR\", \"PK\"])\n",
    "pattern.add_edges_from([(\"PK\", \"EGFR\")])\n",
    "rule5 = Rule.from_transform(pattern)\n",
    "_, cloned_node = rule5.inject_clone_node(\"EGFR\")\n",
    "rule5.inject_remove_edge(\"PK\", cloned_node)\n",
    "\n",
    "plot_rule(rule5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "CLONE TYPING \n",
      "\n",
      " True\n",
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_EGFR:action_graph { id : '44'}) , (lhs_PK:action_graph { id : '8'})  , (lhs_PK)-[lhs_PK_lhs_EGFR:edge]->(lhs_EGFR)\n",
      "\n",
      "// Cloning node 'EGFR' of the lhs \n",
      "// Create clone corresponding to 'EGFR1' of the preserved part\n",
      "// create a node corresponding to the clone\n",
      "CREATE (p_EGFR1:action_graph) \n",
      "WITH p_EGFR1, toString(id(p_EGFR1)) as p_EGFR1_id, lhs_EGFR.id as original_old, lhs_PK_lhs_EGFR, lhs_EGFR, lhs_PK \n",
      "// set the id property of the original node to NULL\n",
      "SET lhs_EGFR.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET p_EGFR1 = lhs_EGFR\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET p_EGFR1.id = toString(id(p_EGFR1)), p_EGFR1.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET lhs_EGFR.id = original_old\n",
      "WITH p_EGFR1, toString(id(p_EGFR1)) as p_EGFR1_id, lhs_PK_lhs_EGFR, lhs_EGFR, lhs_PK \n",
      "WITH [] as sucIgnore, ['8'] as predIgnore, lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1, lhs_PK, lhs_EGFR \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_EGFR)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1, lhs_PK, lhs_EGFR \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(lhs_EGFR) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1, lhs_PK, suc_maps, lhs_EGFR \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_EGFR1)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(p_EGFR1) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = lhs_EGFR THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (p_EGFR1)-[new_edge:edge]->(p_EGFR1) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1, lhs_PK, lhs_EGFR \n",
      "OPTIONAL MATCH (lhs_EGFR)-[out_typ_edge:typing]->(suc_typ)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1, lhs_PK, lhs_EGFR \n",
      "OPTIONAL MATCH (pred_typ)-[in_typ_edge:typing]->(lhs_EGFR) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1, lhs_PK, suc_typ_maps, lhs_EGFR \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_EGFR1)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(p_EGFR1) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1, lhs_PK, lhs_EGFR \n",
      "\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1, lhs_PK, lhs_EGFR // Renaming vars to correspond to the vars of P\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1_id, p_EGFR1 , lhs_EGFR as p_EGFR, lhs_PK as p_PK \n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH lhs_PK_lhs_EGFR, p_EGFR1_id , p_EGFR as rhs_EGFR, p_PK as rhs_PK, p_EGFR1 as rhs_EGFR1 \n",
      "\n",
      "// Return statement \n",
      "RETURN lhs_PK_lhs_EGFR, rhs_EGFR1, rhs_PK, p_EGFR1_id, rhs_EGFR\n",
      "\n",
      "// Matching of the nodes to clone in 'nugget_2'\n",
      "OPTIONAL MATCH (node_to_clone:nugget_2)-[t:typing]->(n:action_graph)\n",
      "WITH node_to_clone, collect(n) as sucs, collect(t) as typ_sucs, count(n) as number_of_img\n",
      "WHERE number_of_img >= 2 AND node_to_clone IS NOT NULL\n",
      "FOREACH(t IN typ_sucs | DELETE t)\n",
      "WITH node_to_clone, sucs, number_of_img-1 as number_of_clone\n",
      "UNWIND range(1, number_of_clone) as clone_number\n",
      "// create a node corresponding to the clone\n",
      "CREATE (cloned_node:nugget_2) \n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, node_to_clone.id as original_old, clone_number, node_to_clone, sucs \n",
      "// set the id property of the original node to NULL\n",
      "SET node_to_clone.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET cloned_node = node_to_clone\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET cloned_node.id = toString(id(cloned_node)), cloned_node.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET node_to_clone.id = original_old\n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, clone_number, node_to_clone, sucs \n",
      "\n",
      "//create a map from original node id to the clone\n",
      "WITH {original_node:node_to_clone.id, clones:collect(cloned_node)+[node_to_clone]} as orig_id_to_clone, collect({clone_id:clone_id, clone:cloned_node}) as clone_maps, node_to_clone, sucs\n",
      "WITH collect(orig_id_to_clone) as orig_ids_to_clone, collect({orig:node_to_clone, clone_maps:clone_maps}) as all_orig, sucs\n",
      "WITH apoc.map.groupByMulti(orig_ids_to_clone, 'original_node') as orig_ids_to_clone, all_orig, sucs\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(orig_ids_to_clone) | \n",
      "\tpairs + [k, REDUCE(values=[], v in orig_ids_to_clone[k] | \n",
      "\t\tvalues + CASE WHEN v.clones IN values THEN [] ELSE v.clones END)])) as orig_ids_to_clone, all_orig, sucs\n",
      "UNWIND all_orig as original_map\n",
      "WITH original_map.orig as node_to_clone, original_map.clone_maps as clone_maps, sucs, orig_ids_to_clone\n",
      "UNWIND clone_maps as clone_map\n",
      "WITH clone_map.clone_id as clone_id, clone_map.clone as cloned_node, node_to_clone, sucs, orig_ids_to_clone\n",
      "WITH [] as sucIgnore, [] as predIgnore, cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (node_to_clone)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, id: suc.id, edge: out_edge}) as suc_maps, predIgnore, cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(node_to_clone) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, id: pred.id, edge: in_edge}) as pred_maps, cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone, suc_maps \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE\n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL AND suc_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[suc_map.id] \n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE\n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL AND pred_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[pred_map.id] \n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = node_to_clone THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone \n",
      "OPTIONAL MATCH (node_to_clone)-[out_typ_edge:typing]->(suc_typ)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone \n",
      "OPTIONAL MATCH (pred_typ)-[in_typ_edge:typing]->(node_to_clone) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, cloned_node, sucs, orig_ids_to_clone, suc_typ_maps, clone_id, node_to_clone \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH collect(cloned_node)+[node_to_clone] as nodes_to_typ, collect(clone_id) as clone_ids, sucs, orig_ids_to_clone, node_to_clone\n",
      "FOREACH (i IN range(0, size(sucs)-1) |\n",
      "\tFOREACH(source in [nodes_to_typ[i]] |\n",
      "\t\tFOREACH(target in [sucs[i]] |\n",
      "\t\t\tMERGE (source)-[restored_typing:typing]->(target)\n",
      ")))\n",
      "RETURN clone_ids\n",
      "// Removal of edges attributes in 'nugget_2'\n",
      "MATCH (n:nugget_2)-[rel_pred:edge]->(m:nugget_2)\n",
      "OPTIONAL MATCH (x:action_graph)-[rel:edge]->(y:action_graph)WHERE (n)-[:typing]->(x) AND (m)-[:typing]->(y)\n",
      "FOREACH(dummy IN CASE WHEN rel IS NULL THEN [1] ELSE [] END |\n",
      "\tDELETE rel_pred\n",
      ")\n",
      "WITH rel, rel_pred\n",
      "WHERE rel IS NOT NULL AND REDUCE(invalid = 0, k in filter(k in keys(rel_pred) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel_pred[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH rel, rel_pred, [rel_pred, rel] as edges_to_merge_props\n",
      "\n",
      "//Perform the intersection of the properties of edges_to_merge_props\n",
      "WITH [] as new_props, edges_to_merge_props, rel_pred, rel\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(edges_to_merge_props[0]) | pairs +\n",
      "\tCASE WHEN ALL(other in edges_to_merge_props WHERE k in keys(other))\n",
      "\tTHEN\n",
      "\t\tREDUCE(inner_pairs = [], v in edges_to_merge_props[0][k] | inner_pairs +\n",
      "\t\t\tCASE WHEN ALL(other in edges_to_merge_props WHERE v in other[k])\n",
      "\t\t\tTHEN\n",
      "\t\t\t\t{key: k, value: v}\n",
      "\t\t\tELSE\n",
      "\t\t\t\t[]\n",
      "\t\t\tEND)\n",
      "\tELSE\n",
      "\t\t[]\n",
      "\tEND) as new_props, edges_to_merge_props, rel_pred, rel\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, edges_to_merge_props, rel_pred, rel\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, edges_to_merge_props, rel_pred, rel\n",
      "SET rel_pred = new_props\n",
      "\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Matching of the nodes to clone in 'nugget_1'\n",
      "OPTIONAL MATCH (node_to_clone:nugget_1)-[t:typing]->(n:action_graph)\n",
      "WITH node_to_clone, collect(n) as sucs, collect(t) as typ_sucs, count(n) as number_of_img\n",
      "WHERE number_of_img >= 2 AND node_to_clone IS NOT NULL\n",
      "FOREACH(t IN typ_sucs | DELETE t)\n",
      "WITH node_to_clone, sucs, number_of_img-1 as number_of_clone\n",
      "UNWIND range(1, number_of_clone) as clone_number\n",
      "// create a node corresponding to the clone\n",
      "CREATE (cloned_node:nugget_1) \n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, node_to_clone.id as original_old, clone_number, node_to_clone, sucs \n",
      "// set the id property of the original node to NULL\n",
      "SET node_to_clone.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET cloned_node = node_to_clone\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET cloned_node.id = toString(id(cloned_node)), cloned_node.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET node_to_clone.id = original_old\n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, clone_number, node_to_clone, sucs \n",
      "\n",
      "//create a map from original node id to the clone\n",
      "WITH {original_node:node_to_clone.id, clones:collect(cloned_node)+[node_to_clone]} as orig_id_to_clone, collect({clone_id:clone_id, clone:cloned_node}) as clone_maps, node_to_clone, sucs\n",
      "WITH collect(orig_id_to_clone) as orig_ids_to_clone, collect({orig:node_to_clone, clone_maps:clone_maps}) as all_orig, sucs\n",
      "WITH apoc.map.groupByMulti(orig_ids_to_clone, 'original_node') as orig_ids_to_clone, all_orig, sucs\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(orig_ids_to_clone) | \n",
      "\tpairs + [k, REDUCE(values=[], v in orig_ids_to_clone[k] | \n",
      "\t\tvalues + CASE WHEN v.clones IN values THEN [] ELSE v.clones END)])) as orig_ids_to_clone, all_orig, sucs\n",
      "UNWIND all_orig as original_map\n",
      "WITH original_map.orig as node_to_clone, original_map.clone_maps as clone_maps, sucs, orig_ids_to_clone\n",
      "UNWIND clone_maps as clone_map\n",
      "WITH clone_map.clone_id as clone_id, clone_map.clone as cloned_node, node_to_clone, sucs, orig_ids_to_clone\n",
      "WITH [] as sucIgnore, [] as predIgnore, cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (node_to_clone)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, id: suc.id, edge: out_edge}) as suc_maps, predIgnore, cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(node_to_clone) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, id: pred.id, edge: in_edge}) as pred_maps, cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone, suc_maps \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE\n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL AND suc_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[suc_map.id] \n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE\n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL AND pred_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[pred_map.id] \n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = node_to_clone THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone \n",
      "OPTIONAL MATCH (node_to_clone)-[out_typ_edge:typing]->(suc_typ)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, cloned_node, sucs, orig_ids_to_clone, clone_id, node_to_clone \n",
      "OPTIONAL MATCH (pred_typ)-[in_typ_edge:typing]->(node_to_clone) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, cloned_node, sucs, orig_ids_to_clone, suc_typ_maps, clone_id, node_to_clone \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH collect(cloned_node)+[node_to_clone] as nodes_to_typ, collect(clone_id) as clone_ids, sucs, orig_ids_to_clone, node_to_clone\n",
      "FOREACH (i IN range(0, size(sucs)-1) |\n",
      "\tFOREACH(source in [nodes_to_typ[i]] |\n",
      "\t\tFOREACH(target in [sucs[i]] |\n",
      "\t\t\tMERGE (source)-[restored_typing:typing]->(target)\n",
      ")))\n",
      "RETURN clone_ids\n",
      "// Removal of edges attributes in 'nugget_1'\n",
      "MATCH (n:nugget_1)-[rel_pred:edge]->(m:nugget_1)\n",
      "OPTIONAL MATCH (x:action_graph)-[rel:edge]->(y:action_graph)WHERE (n)-[:typing]->(x) AND (m)-[:typing]->(y)\n",
      "FOREACH(dummy IN CASE WHEN rel IS NULL THEN [1] ELSE [] END |\n",
      "\tDELETE rel_pred\n",
      ")\n",
      "WITH rel, rel_pred\n",
      "WHERE rel IS NOT NULL AND REDUCE(invalid = 0, k in filter(k in keys(rel_pred) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel_pred[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH rel, rel_pred, [rel_pred, rel] as edges_to_merge_props\n",
      "\n",
      "//Perform the intersection of the properties of edges_to_merge_props\n",
      "WITH [] as new_props, edges_to_merge_props, rel_pred, rel\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(edges_to_merge_props[0]) | pairs +\n",
      "\tCASE WHEN ALL(other in edges_to_merge_props WHERE k in keys(other))\n",
      "\tTHEN\n",
      "\t\tREDUCE(inner_pairs = [], v in edges_to_merge_props[0][k] | inner_pairs +\n",
      "\t\t\tCASE WHEN ALL(other in edges_to_merge_props WHERE v in other[k])\n",
      "\t\t\tTHEN\n",
      "\t\t\t\t{key: k, value: v}\n",
      "\t\t\tELSE\n",
      "\t\t\t\t[]\n",
      "\t\t\tEND)\n",
      "\tELSE\n",
      "\t\t[]\n",
      "\tEND) as new_props, edges_to_merge_props, rel_pred, rel\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, edges_to_merge_props, rel_pred, rel\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, edges_to_merge_props, rel_pred, rel\n",
      "SET rel_pred = new_props\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g5 = h.rewrite(\n",
    "    \"action_graph\", rule5, \n",
    "    {\"EGFR\": action_graph_EGFR, \"PK\": action_graph_PK})"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
