{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Examples of utils provided by ReGraph's Neo4jHierarchy module"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "from regraph import Rule, plot_rule\n",
    "\n",
    "\n",
    "from regraph.neo4j.hierarchy import Neo4jHierarchy\n",
    "import regraph.neo4j.cypher_utils as cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Initializing Neo4j database\n",
    "\n",
    "0. When installing neo4j you will be asked to choose login/password for you dbs (here its \"neo4j\"/\"admin\"), if you choose other -- change in the cell below.\n",
    "1. To start neo4j server run `sudo service neo4j start`\n",
    "2. Check status by running `sudo service neo4j status`. Here you can check the _bolt_ port, change the cell below if different from 7687\n",
    "3. You can query the db by using the neo4j browser, the address can be found also in the result of 'status', e.g. \"Remote interface available at http://localhost:7474/\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f17069ee198>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# initialize the neo4j driver, wrappped into Neo4jHierarchy object\n",
    "h = Neo4jHierarchy(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"admin\")\n",
    "h._clear()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Hierarchy\n",
    "\n",
    "A hierarchy is given by graphs connected by typing (homorphism). \n",
    "\n",
    "Each graph in the database is represented by a unique label which enables us to match quickly the nodes of this graph. Each node of a graph has then the label *graphId*. We can match these nodes by using the query:\n",
    "\n",
    "> MATCH (n:graphLabel) RETURN n\n",
    "\n",
    "\n",
    "The edges of a graph are labeled as *edge* and the typing edges are labeled as *typing*. We can then easily find the image of a node with the query:\n",
    "\n",
    "> OPTIONAL MATCH (n:graphLabel)-[:typing]->(m) RETURN m\n",
    "\n",
    "The hierarchy skeleton is represented by nodes labeled as hierarchyNodes. It enables us to know which graphs are the ancestors of a graph we want to rewrite for example."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Adding a graph to the hierarchy (Action Graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Here we create a first graph called *ActionGraph*. This graph represent people and the relationship between them."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "nodes = [\n",
    "    (\"a\", {\"name\": {\"Jack\"}, \"age\": {43}, \"hobby\": {\"hiking\", \"music\"}}), \n",
    "    (\"b\", {\"name\": {\"Robert\"}, \"age\": {35}, \"hobby\": {\"sport\", \"music\"}}),\n",
    "    (\"c\", {\"name\":{ \"Paul\"}, \"age\": {18}}),\n",
    "    (\"d\", {\"name\": {\"Joe\"}, \"age\": {12}}),\n",
    "    (\"e\", {\"name\": {\"Paul\"}, \"age\": {18}})\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"b\", {\"type\": {\"friends\"}}), \n",
    "    (\"a\", \"c\", {\"type\": {\"colleagues\"}}),\n",
    "    (\"b\", \"c\", {\"type\": {\"colleagues\"}}),\n",
    "    (\"d\", \"a\", {\"type\": {\"child_of\"}}), \n",
    "    (\"d\", \"e\", {\"type\": {\"enemies\"}}),\n",
    "    (\"e\", \"e\", {\"type\": {\"likes\"}})\n",
    "]\n",
    "h.add_graph('actionGraph', nodes, edges)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Adding a second graph to the herarchy (Meta Model)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Here we create a second graph called *MetaModel*. Which represent the types of people (*Adult* or *Child*) and the relationships between them."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "nodes = [\n",
    "    (\"a\", {\"type\": {\"Adult\"}, \"age\": {43, 35, 18}, \"name\": {\"Paul\", \"Jack\", \"Robert\"}, \"hobby\": {\"hiking\", \"music\", \"sport\"}}),\n",
    "    (\"b\", {\"type\": {\"Child\"}, \"age\": {12, 18}, \"name\": {\"Paul\", \"Joe\"}})\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"a\", {\"type\": {\"friends\", \"colleagues\"}}),\n",
    "    (\"b\", \"a\", {\"type\": {\"child_of\"}}),\n",
    "    (\"b\", \"b\", {\"type\": {\"friends\", \"enemies\"}})\n",
    "]\n",
    "h.add_graph('metaModel', nodes, edges)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Typing"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Here we create a typing of the *ActionGraph* by the *MetaModel*."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// match all typing pairs between 'actionGraph' and 'metaModel'\n",
      "MATCH (s:actionGraph), (t:metaModel)\n",
      "WITH s, t\n",
      "// match all the predecessors of 's' and successors of 't'\n",
      "MATCH (pred), (suc)\n",
      "WHERE (pred)-[:typing*0..]->(s)\n",
      "\tAND (t)-[:typing*0..]->(suc)\n",
      "WITH s, t, collect(DISTINCT pred) as pred_list, collect(DISTINCT suc) as suc_list\n",
      "// select all the pairs 'pred' 'suc' with a path between\n",
      "UNWIND pred_list as pred\n",
      "UNWIND suc_list as suc\n",
      "OPTIONAL MATCH (pred)-[r:typing*]->(suc)\n",
      "WHERE NONE(rel in r WHERE rel.tmp = 'True')\n",
      "WITH s, t, r, labels(pred)[1] as pred_label, labels(suc)[1] as suc_label\n",
      "WHERE r IS NOT NULL\n",
      "WITH DISTINCT s, t, pred_label, suc_label\n",
      "// return the pairs 's' 't' where there should be a typing edge\n",
      "OPTIONAL MATCH (s)-[new_typing:typing]->(t)\n",
      "WHERE new_typing.tmp IS NOT NULL\n",
      "WITH pred_label, suc_label, s.id as s_id, t.id as t_id, new_typing\n",
      "WHERE new_typing IS NULL\n",
      "RETURN pred_label, suc_label, s_id, t_id\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f1706785f98>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mapping = {\n",
    "    \"a\":\"a\",\n",
    "    \"b\":\"a\",\n",
    "    \"c\":\"a\",\n",
    "    \"d\":\"b\",\n",
    "    \"e\":\"b\"\n",
    "}\n",
    "h.add_typing('actionGraph', 'metaModel', mapping)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Classic update functions"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We still can use the modification functions on these graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "#ag.merge_nodes1([\"b\", \"c\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": true,
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "#ag.clone_node(\"e\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Graph rewriting and propagation up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", (\"y\",  {\"type\": {\"Child\"}, \"age\": {12, 18}, \"name\" : {\"Paul\", \"Joe\"}})])\n",
    "pattern.add_edges_from([(\"y\", \"x\",  {\"type\": {\"child_of\"}}), (\"y\", \"y\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "rule.inject_remove_node_attrs(\"y\",  {\"age\": {18}})\n",
    "rule.inject_remove_edge_attrs(\"y\", \"x\",  {\"type\": {\"child_of\"}})\n",
    "#rule.inject_remove_node(\"x\")\n",
    "#rule.inject_remove_edge(\"y\",\"y\")\n",
    "#rule.inject_clone_node(\"y\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAHpRJREFUeJzt3XtwVOeZ5/Hf2xdJ6C6hWwtJSIBA\nOoDBGDDGGRvbxLEnJHHi2vgWx3bWySabpCap2tRksrvxuryT1GxSm8zOeDOTmtwmiW3sZczYwU5w\nMLbB5iZssK0jIQQCDLogISGEhLrV6rN/AF3ckWzpnG7p+6miykLnlB5Rfp96f91Pv8c4jiMAAAAA\ncJPP6wIAAAAATD4EEQAAAACuI4gAAAAAcB1BBAAAAIDrCCIAAAAAXEcQAQAAAOA6gggAAAAA1xFE\nJhBjzAFjzMoL/m6FMebwJa59zRjz6Dlff88Y02KMOWmMOWyMWe1GzQCS05l+c+pMz+gwxvzaGJPp\ndV0AEssFvaL93F5x5r//5wXXVxpjHGNM4MzXZcaYNcaYLmNMrzHmfWPMwx78KhgHBBHIGPOQpAcl\nrXQcJ1PSYkkbvK0KQBL41JmesUin+8Z/87geAInpbK9YKOlaSX8zint/K+kDSdMlTdXp/UrHmFcI\nTwS8LgAJYYmkPzmOs0+SHMdpl/Rzb0sCkCwcxzlijHlZ0jyvawGQuBzHaTfG/EmnA8lILZH0bcdx\n+s98/c7YVwav8I4IJGmrpC8aY75jjFlsjPF7XRCA5GGMKZf0l2KDAOAKjDFlku6U1DyK27ZKetIY\nc68xpmJ8KoNXCCKTQ6kx5vi5fyR97Ow3Hcf5naRvSvqEpNclHTXG/LVHtQJIHmvP9JPNOt07fuBx\nPQAS01pjTJ9Oj1gdlfTYOd/7LxfsT9694N7/IGmTpP8uqcUYs8sYs8SVqjHuCCKTQ6vjOLnn/tHp\njUOc4zi/dxxnpaRcSV+V9IQx5hNeFAsgadx1pqdMdxznPzuOc8rrggAkpLscx8mStEJSjaSCc773\n4wv2J9ece6PjOD2O43zXcZy5kool7dLpYGNcqh3jiCCC8ziOM+Q4znM6/YoE894AAGBMOI7zuqRf\nS/rxh7y/68y9pZLyx64yeIUgMvEEjTFpZ/9oBAcSGGMeNsZ80hiTZYzxGWPulDRX0rZxrxYAAEwm\nP5X0cWPMgpFcbIz5O2PMPGNMwBiTJelrkpodxzk2rlXCFZyaNfG8dMHXb47gnhOSvifpd5L8kg5K\n+prjOJuveBcAAMAoOI7TaYz5V0nfl9Q3glvSJT0vKSTplE6/SPrp8asQbjKO43hdAwAAAIBJhtEs\nAAAAAK4jiAAAAABwHUEEAAAAgOsIIgAAAABcN6pTswoKCpzKyspxKgXAaO3cubPLcZxCr+sYLXoJ\nkHjoJwDGykj7yaiCSGVlperq6j58VQDGlDHmoNc1fBj0EiDx0E8AjJWR9hNGswAAAAC4jiACAAAA\nwHUEEQAAAACuI4gAAAAAcB1BBAAAAIDrCCIAAAAAXEcQAQAAAOA6gggAAAAA1xFEAAAAALiOIAIA\nAADAdQQRAAAAAK4jiAAAAABwHUEEAAAAgOsIIgAAAABcRxABAAAA4DqCCAAAAADXEUQAAAAAuI4g\nAgAAAMB1BBEAAAAAriOIAAAAAHAdQQQAAACA6wgiAAAAAFxHEAEAAADgOoIIAAAAANcRRAAAAAC4\njiACAAAAwHUEEQAAAACuI4gAAAAAcB1BBAAAAIDrCCIAAAAAXEcQAQAAAOA6gggAAAAA1xFEAAAA\nALiOIAIAAADAdQQRAAAAAK4jiAAAAABwHUEEAAAAgOsIIgAAAABcRxABAAAA4DqCCAAAAADXEUQA\nAAAAuI4gAgAAAMB1BBEAAAAAriOIAAAAAHAdQQQAAACA6wgiAAAAAFxHEAEAAADgOoIIAAAAANcR\nRAAAAAC4jiACAAAAwHUEEQAAAACuI4gAAAAAcB1BBAAAAIDrCCIAAAAAXEcQAQAAAOA6goikxsZG\nlZeX6+DBg5Kkxx9/XPfee6/HVQFIRvQTAGOFfoKJjiAiqaamRj/4wQ90zz33aP369Xrqqaf085//\n3OuyACQh+gmAsUI/wUQX8LqARPHggw9qw4YNuuuuu7Rp0yZlZ2d7XRKAJEU/ATBW6CeYyHhH5IxI\nJKL6+nrl5uaqo6PD63IAJDH6CYCxQj/BREYQOeM73/mOrrvuOr3yyiv66le/qsOHD3tdEoAkRT8B\nMFboJ5jIGM2StHbtWr322mvatm2b0tLS9Nhjj+m+++7Txo0bFQjwTwRg5OgnAMYK/QQTnXEcZ8QX\nL1682KmrqxvHcgCMhjFmp+M4i72uY7ToJUDioZ8AGCsj7SeMZgEAAABwHUEEAAAAgOsIIgAAAABc\nRxABAAAA4DqCCAAAAADXcfbbGbHhmI53HFNseFjZhXlKSUv1uiQASSoyGNaJzh75/H7lFk+Vz89r\nPgA+nP7ePg30nlRqxhRlT831uhxgTE36IBKNDGnr2le1/YXXNBQekvEZxYZjmvsXi3TT/XcqpzDf\n6xIBJInezm698dTLqt/0tnx+n5yYo2BqUEs/vULL7rpVgZSg1yUCSBIH32/W679fpyNNB+UP+DUc\nHdbUaUW66d47VbN8gdflAWNiUgeRoXBE//o3f6/OQ+2KRobO+967G3eoceu7euR/fVsF5SUeVQgg\nWXQeatOv//qnipwKy4nF4n8/FI5o87PrtWfru/riD/9KwdQUD6sEkAx2/3mrXv6n5+J7k+GhqCTp\n6IFW/ftPfqvWvQd160Of9rJEYExM6nmBV37xvDoPtV0UQiTJicUUHjilp/7Hz87bVADAhZxYTE8/\n/k8KD5y6ZL+IRobUeahNr/zyeQ+qA5BMjh05el4IudBQOKIdf3hD+95ucLkyYOxN2iASHhjUu69u\nVzQSvfxFjjTYN6D9u/e4VxiApLN/1x4N9g1IzuWviUaienfDdkVOhd0rDEDS2f7Ca4oND1/xmqFw\nRG8+t96lioDxM2mDyMH398oX8F/1ushgWPamd1yoCECysje/o8jg1QOGL+DXwff3ulARgGTV8NYu\nxYavPonxQcP++MgWkKwmbRAZGoxIzhVevjzH4QOH1N7ePs4VAUhW4YFTI7puKBKR/b6tvr6+ca4I\nQLK64qTGORxJ77/3noaGLj3CBSSDSfth9ZyikZ2G5UjqHx7UCy+8oPz8fFmWperqagWDnH4D4LT8\n0iL5An7Folcep3Bijg61H9bTTz+tiooKWZal8vJyGWNcqhRAosvKz9axI4Mjunbrju16e/cuVVdX\ny7Is5edz0ieSy6QNItPmVCo1fcrV57WN1Nh9ULlNJ1VaWqru7m5t27aNRQ8gbuHHl2n7Cxt1tWGK\nqIlp1956hfpDikQiOnTokLKyslRbW6s5c+ZoypQprtQLIHEt+dTN2vCrf9dQOHLZaxxJfSkRte7e\nrVAopMHBQdm2rZKSElmWpaqqKvn9Vx8/B7w2aYOIMUYrH/m0/vAPT2sofOm3NY3fKLUoSwvnz1Z7\ne7ts21ZKSgqLHsB58kOFql46X3u3v3/Zk26M3yjvmjJl5wTU1tamuro65ebmKhQKqa+vT3V1dZox\nY4Ysy1JJCUeGA5PVNbcs1ebVf1I0MiTnMiPkPr9PlTdYOhHuV2trq/bv36+ioiKdOnVK7e3tSktL\nU01NjWpra5WVleXybwCM3KQNIpI096bFOnn8pDb+5gU5jqPhs2MVxiiYGtT0edW64cFPaM/eJqWm\npqq8vFzd3d1qa2tj0QM4z2e+/QX9vx/+Ugff33v6xY0zGwh/wC/jM7r5C6uUV1Mq27aVmZmpqqoq\nHT16VPv375fjOAqFQgqHw2publZ+fr5qa2tVXV2tlBSeOwJMJilTUvXQ331bv/3e32vw5KnzDsII\npqXI5/Prru8+rN5ovxobG5Wfn6/BwUG1tbVp9+7dysjIUCgU0sDAgHbt2qXy8nJZlqWKigrGQJFw\nzOXS9qUsXrzYqaurG8dyvHG845h2rHtDzXW2YsPDKq6cpuvvukVlNVXxRXvy5Ek1NjaqsbFRAwMD\n8QDS3t6uzMxMhUIh5efny+fzsejhGmPMTsdxFntdx2hN1F7iOI4ON7Zo29qN6jhwRD6/X9WL52rx\nqpuUe87n0o4ePSrbtrVv3z4NDw+rt7dXbW1t6u7uVkFBgUKhkLKyshQIBOJjoFOnTvXwN8NkQD9J\nLMNDUTVu2a26dZvU19OrtIx0Lfz4Ms1fsUSp6WmSpFgspgMHDsi2bbW2tioWi6mrq0ttbW06deqU\nQqGQSkpKlJqaqszMTNXW1qqmpoYxUIy7kfYTgsgoseiRSNg4JLdwOKw9e/aooaFBvb29ikQi6ujo\nUFtbm4LBoEKhkAoLC+X3+1VcXCzLsjRjxgzGQDEu6CfJ7fjx47JtW01NTYpEIurv71dbW5s6OzuV\nk5OjUCik3Nxc+f1+VVVVybIshUIhr8vGBEUQcQGLHl5j4zAxOI6jI0eOyLZtHTx4ULFYTD09PWpt\nbVVfX5+KiooUCoWUnp6utLQ0zZkzR7W1tcrOzva6dEwg9JOJIRqNqrm5WbZtq6urS8PDw/EXOGKx\nmEKhkIqLixUMBpWXl6fa2lrNnj2bMVCMKYKIi0a76M8eAcyix0fFxmHi6e8/Pffd0NCggYGB+Ox3\nR0eH0tPTFQqFNHXqVPl8PpWVlcXHQH2+SftYKIwR+snE09nZKdu21dzcfNEY6NSpUxUKhZSdna1A\nIKBZs2bJsiwVFBR4XTYmAIKIR1j0cBMbh4krFovp4MGDsm1bR44cuWgMtKSkRKFQKD4GWlNTo5qa\nGqWnp3tdOpIU/WTiCofDampqkm3b6u3t1dDQkNrb29XW1qZAIKDS0tL4GGhRUVF8DDQQmNRnGuEj\nIIh4bDSLfvny5Zo3b57XJSMJsXGYHHp7e+NjoOFw+IpjoHfffbfy8vK8LhlJiH4yOZwdAz1w4EB8\nDLStrU0nTpw4bww0Oztb99xzD4fu4EMZaT8h6o6T1NRUzZ8/X/Pnz1dra6vq6+uVkpKisrKy+KJv\naWlRUVGR7rzzTq/LBZDAcnJydMMNN2jJkiXav3+/6uvrlZGRET8CuKWlRcPDwzwUEcBVTZs2TdOm\nTdPAwEB8DPTsEcDt7e169913lZ6erltuuUWO4xBEMK54R8RF5y76/v5+DQ4OSpLy8vLinx2prKxk\n1hsjxiuYk1dXV1d8DDQajerEiRPxI8SnT5+uuXPnqqioyOsykUToJ5NTLBbToUOHZNu2Dh8+rFgs\npmPHjmnmzJmKRqPxwzEyMzO9LhVJhHdEElB6eroWLVqkhQsXxhf9vHnzVFZWppaWFtXX1+utt95i\n0QO4qoKCAt10001atmyZmpqa1NTUpFWrVikWi2nPnj169dVXFQwGZVmWZs2apWAw6HXJABKQz+dT\nZWWlKisr1dvbG3+x9LbbblNPT48aGhq0Zs0alZSUyLIslZWV8S4JxgzviCSYnp6e+KucLHpcDa9g\n4nLOPRK4ra0tfjgGnx/B5dBPcDnnng4aiURUW1urOXPmKC0tzevSkKB4RyRJ5eXl6cYbb9TSpUu1\nb98+7dixQ2+++SaLHsCoGGNUVlamsrIynTx5Uo2NjVq3bp1ycnJkWZaqqqoYAwUwIoFAIH4y39Gj\nR2Xbtp555hlNnz5dlmWpuLjY6xKRpAgiCSoYDLLoAYyJzMxMLV68WIsWLdKBAwdk23Z8DNSyLMZA\nAYxYUVGRioqKNDg4qKamJm3cuFGBQCD+jDTGQDEaBJEkwKIHMBZ8Pp9mzJihGTNm6Pjx47JtW2vW\nrFFxcbEsy1J5eTljoABGJC0tTddcc43mz58fHwPdsWOHZs6cKcuylJ+f73WJSAIEkSTCogcwVnJz\nc7V8+XItXbpUzc3NqqurO28MlGOAAYzEuWOg/f39amho0EsvvaTs7Oz4GKjf7/e6TCQogkgSYtED\nGCvnzn53dnaqvr5eq1evVkVFhSzLUklJidclAkgSGRkZ8THQgwcPyrZtbdmyJX4aaFZWltclIsEQ\nRJLchYu+vr6eRQ/gQyksLNSKFSsUDofV1NSk119/XX6/P34EcEpKitclAkgCPp9PVVVVqqqq0vHj\nx9XQ0KDnn39eRUVFjIHiPASRCYJFD2CspKamav78+eeNgW7fvj1+BDBjoABGKjc3VzfccIOWLFmi\nffv2aefOndq8ebMsy2IMFASRiYhFD2CsTJs2TdOmTVN/f78aGxv18ssvKzMzU5ZlacaMGYyBAhiR\nQCCgOXPmaM6cOerq6pJt21q9erXKy8tlWZZCoZDXJcIDPNBwkujs7JRt22ppaWHRTyA8gAxui8Vi\nOnTokGzbVldXV3wMNDs72+vS8BHRT+C2cDisvXv3yrZtGWPip4EyBpr8eKAhzlNYWKibb75Zy5Yt\n0969e7Vp0yYWPYBR8/l8qqysVGVlpXp7e9XQ0KC1a9eqsLBQlmWpoqKCMVAAI5Kamqp58+Zp3rx5\nam1tveg00KlTp3pdIsYZQWSSYdEDGCs5OTlatmyZFi9erP379+udd9457wjg9PR0r0sEkCRKS0tV\nWlqqgYEBNTY26o9//KMyMjI0d+5cxkAnMILIJMaiBzAWAoGAZs+erdmzZ8dnv5999lmVlZXJsiyV\nlpZ6XSKAJJGenq5FixZp4cKF8THQLVu2aPbs2bIsizHQCYYgAhY9gDFTUFCgm266ScuWLVNTU5M2\nb94sSbIsS7Nnz2YMFMCInDsGeuLECdm2rbVr16qgoCA+Burz+bwuEx8RQQRxLHoAYyUlJeWiMdC6\nujrNmDFDlmWpoKDA6xIBJIns7GwtW7ZMS5Ys0f79+7V79+74GGhNTQ1joEmMXSUu6eyiv//++zVr\n1izt2rVLTz/9tN5++20NDAx4Xd5l/ehHP9LXv/71+NcdHR0qLi5O6JqBia60tFQrV67U5z//eWVl\nZWn9+vVau3atmpqaFI1GvS7vsugnQGLx+/2qrq7WZz7zGd1xxx3q7+/Xs88+qz//+c9qbW31urwr\nop9cGsf3YsSOHTsm27a1b9++hJ397u7ulmVZam5uVmZmpp544gl1d3frJz/5ideljQuO20Qychwn\nPgba2dmp2bNnq7a2Vjk5OV6Xdh76SXKgn0xukUgkfgSw4zgJOwZKP7nMdQQRjFaiL/qvfOUruvba\na/XlL39ZM2bM0IYNG1RdXe11WeOCjQOS3YkTJ9TQ0KA9e/Yk5Bgo/STx0U9wVltbm2zb1gcffKCq\nqirNnTs3ocZA6ScX4zMiGLWUlBTNnTtXc+fOjS/6urq6hFn03/zmN/XAAw+oqKhItbW1E3aRAxNB\ndna2rr/++vgRwGdnv2tqalRbW+v57Df9BEgeoVBIoVBIp06d0p49e7R+/XpNmTJFlmVp5syZCgS8\n3fbSTy5GEMFHcu6ib2xsTIhFP3/+fE2dOlXf+ta39OSTT7r+8wGM3tnZ7+rqanV3d8u2bT333HMq\nLS2VZVmaNm2aJ3XRT4DkM2XKFC1cuFALFizQBx98INu2tW3bNlVXV6u2tla5ubme1EU/uVhivPeN\npDdlyhRde+21uu+++3TdddeppaVFTz31lLZs2aLjx4+7Xs+jjz4qn8+nVatWuf6zAXw0+fn5+tjH\nPqb77rtP06ZN05YtW7R69Wq99957CofDrtdDPwGSkzFGFRUVuuOOO/TZz35Wfr9fL774otatW6eW\nlhbFYjHXa6KfnI93RDCmzi76iooK9fX1qaGhQS+++KLy8/NlWZamT5/uyuz3xo0b9Y1vfCNh5swB\njF5KSoosy5JlWWpvb5dt29q5c6eqqqpkWZYKCwtdqYN+AiS/rKwsLV26NP5i6XvvvXfeGGhGRoYr\nddBPzseH1THuhoeH1dLSItu2deLEiXFd9K2trbrllltUUlKil19+2fP58vHGh0sx2Zyd/W5oaFBq\naqosy9KsWbPGZQyUfpIc6Cf4sM6Oge7bt0+hUCg+BmqMGfOfRT+5zHUEEbjp7KJvbm4+b/Z7PBb9\nZMDGAZOV4zjx2e+Ojg5VV1fLsizPZr8nAvoJJquhoSE1Nzervr5e0Wg0fhpoWlqa16UlLU7NQkI6\nO/t9/fXXa+/evdq6dSuLHsConTsGevLkyfgYaF5enizLUmVlJaMPAEYkGAyqtrZWtbW16ujokG3b\neuaZZ1RZWSnLslRUVOR1iRMWQQSeCAaD8dlvFj2AjyIzM1NLliyJz37X19frrbfeUk1NjWpqapSZ\nmel1iQCSRHFxsYqLizU4OKg9e/bo1VdfjX9ebbzGQCcz/jXhuQsX/YYNG8Z99hvAxOPz+TRz5kzN\nnDlTPT09sm1ba9asGffZbwATT1pamhYsWKBrrrlGhw8fvugI4Ly8PK9LnBDY4SFhsOgBjJW8vDzd\neOONWrp0qZqbm7Vt2zYNDQ0xBgpgVIwxKi8vV3l5uU6ePKnGxkatW7dOOTk5sixLVVVVjIF+BAQR\nJJwLF31DQ8OIFn0sFtPr776mX7/ySzUd3iPHcTSrtFoP3f6IbllwqwJ+/ncHJptzZ7+PHj0aHwOd\nPn26LMtScXHxJe87eeqkXtiyVk9t/J06j3cqEAjqRutGffHjD2te5XyXfwsAiSAzM1OLFy/WokWL\ndODAAdm2rS1btmjOnDmqra297Bjo4a7DeurV3+ql7es0EB5Q1pQsfWb5Z3XvivtUlHvpHjRZcGoW\nkkIsFosv+p6envgRwGcX/dDwkL79s7/SO807dSpy6rx7p6ROkVUxV//4jZ8pNZjqRfnjhlNugNEb\nHBxUU1OTbNuOf15t1qxZCgaDkqTWY0f0yI+/qL6BPg0ODcbv8xmfUgIp+tIdj+rRO7/iVfnjhn4C\njN7x48dl27b27t2rkpISWZalsrKy+BjoG++9ru/+4juKDkcVHY7G7wsGggr6g/o/X39Si2Zd51X5\n44bjezFh9fT0qKGh4bxF/9vNv9Eftr5w3qbhXKnBVN26cKX+9pEfulzt+GLjAHx4juPoyJEjsm1b\nbW1tmjVrlubUzNHDP31Q7d1tijmXfupyWkqannjoB7rt2pUuVzy+6CfAhxeNRtXc3CzbthUOh2VZ\nllJzU/Wln3xRg5FL700kKT01Xc8/9oIKcyfWIT0j7ScMtSHp5OXlafny5XrggQc0ffp0bXrrDT3/\n5r9dNoRIUngorA3vvKJjJ465WCmARGaMUVlZmW6//XbdfffdSk1N1ZO//wd1He+8bAiRpMHIoP7v\ni//oYqUAEl0gEFBNTY0+97nP6bbbblNPT4+e+MXjCkfCV7wvOhzVs2+sdqnKxEMQQdI6u+gzKjIU\nHMHnP4wxeuXt9S5UBiDZnJ397vJ3KjIcuer1bcdadejoIRcqA5BsioqKdPPNN2vf8b1ydOXJo0g0\norVv/ptLlSUeggiSXk9ft4aGh656XXgorGMnulyoCECy6uodWY8I+APq6ese52oAJKuh6NCI9iaS\n1Heqb5yrSVwEESS9nIwcpQRSrnpdSiBFuZm5LlQEIFnlZY3smPBoLKrsjJxxrgZAsgoGggr4RnZa\nZ0ZaxjhXk7gIIkh6KxbcquHY8IiuXXntx8e5GgDJ7LM33q301PSrXleQXajK4srxLwhAUjLG6NZr\nV8pnrrzVDvqD+uT1n3KpqsRDEEHSy8vM0+3XfeKKR/OmBFJ049y/UHFeiYuVAUg2Kxbcooy0jCs+\ngT0tJU3/6ZNf4yntAK7okdv/o4JXmdjw+wO6d8X9LlWUeAgimBD+6/3fV22FpSkpUy76XlpKmmaW\nztITD/2tB5UBSCZBf1D//K1/UU76pUc+01Km6PM33atPXr/Kg+oAJJPZZbP12BceV2ow7aIHMft9\nfqWlpOnHX/nfKp1a6lGF3uNR05gQUoOp+udv/Yv+uOMl/Xr9r3SgvUWSVFZYrkdu/5L+cukqpQSv\n/jkSAKgsrtKa76/V6tef0bOvP6Pe/l4ZY7RkzlI9fPuXdH3NMq9LBJAk7lhyp2aWztRvXvmV/vz2\nKxqKDik1JVWfXLpKD658SBVF070u0VM80BATUix2+hkAF74CMdHwADJg/EWHo/L7/BN+FIt+Aoy/\n6HBUgRE8ciDZjbSfTPx/CUxKEz2AAHDPZNg0AHAH/eR87NYAAAAAuI4gAgAAAMB1BBEAAAAAriOI\nAAAAAHAdQQQAAACA6wgiAAAAAFxHEAEAAADgOoIIAAAAANcRRAAAAAC4jiACAAAAwHUEEQAAAACu\nI4gAAAAAcB1BBAAAAIDrCCIAAAAAXEcQAQAAAOA6gggAAAAA1xFEAAAAALiOIAIAAADAdQQRAAAA\nAK4jiAAAAABwHUEEAAAAgOsIIgAAAABcRxABAAAA4DqCCAAAAADXEUQAAAAAuI4gAgAAAMB1BBEA\nAAAAriOIAAAAAHAdQQQAAACA6wgiAAAAAFxHEAEAAADgOoIIAAAAANcRRAAAAAC4zjiOM/KLjemU\ndHD8ygEwStMdxyn0uojRopcACYl+AmCsjKifjCqIAAAAAMBYYDQLAAAAgOsIIgAAAABcRxABAAAA\n4DqCCAAAAADXEUQAAAAAuI4gAgAAAMB1BBEAAAAAriOIAAAAAHAdQQQAAACA6/4/yvTXR8xrD8UA\nAAAASUVORK5CYII=\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'x': 'a', 'y': 'b'}]\n"
     ]
    }
   ],
   "source": [
    "instances = h.find_matching('metaModel', pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_x:metaModel { id : 'a'}) , (lhs_y:metaModel { id : 'b'})  , (lhs_y)-[lhs_y_lhs_x:edge]->(lhs_x), (lhs_y)-[lhs_y_lhs_y:edge]->(lhs_y)\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH lhs_y_lhs_x, lhs_y_lhs_y , lhs_x as p_x, lhs_y as p_y \n",
      "\n",
      "// Removing properties from node 'y' of P \n",
      "FOREACH(dummy IN CASE WHEN 'age' IN keys(p_y) THEN [1] ELSE [] END |\n",
      "\tSET p_y.age = filter(v in p_y.age WHERE NOT v IN ['18'])\n",
      "\tFOREACH(dumy2 IN CASE WHEN size(p_y.age)=0 THEN [1] ELSE [] END |\n",
      "\t\tREMOVE p_y.age))\n",
      "\n",
      "\n",
      "// Removing properties from edge y->x of P \n",
      "WITH p_y, p_x, lhs_y_lhs_y, lhs_y_lhs_x MATCH (p_y)-[p_y_p_x:edge]->(p_x)\n",
      "FOREACH(dummy IN CASE WHEN 'type' IN keys(p_y_p_x) THEN [1] ELSE [] END |\n",
      "\tSET p_y_p_x.type = filter(v in p_y_p_x.type WHERE NOT v IN ['child_of'])\n",
      "\tFOREACH(dumy2 IN CASE WHEN size(p_y_p_x.type)=0 THEN [1] ELSE [] END |\n",
      "\t\tREMOVE p_y_p_x.type))\n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH lhs_y_lhs_y, p_y_p_x, lhs_y_lhs_x , p_x as rhs_x, p_y as rhs_y \n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_x, lhs_y_lhs_y, p_y_p_x, rhs_y, lhs_y_lhs_x\n",
      "\n",
      "// Removal of nodes in 'actionGraph'\n",
      "MATCH (n:actionGraph)\n",
      "OPTIONAL MATCH (n)-[:typing]->(x:metaModel)\n",
      "FOREACH(dummy IN CASE WHEN x IS NULL THEN [1] ELSE [] END |\n",
      "\tDETACH DELETE n\n",
      ")\n",
      "// Removal of node properties in 'actionGraph'\n",
      "WITH n, x\n",
      "WHERE x IS NOT NULL AND REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(x) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN x[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH n, x, [x, n] as node_to_merge_props\n",
      "\n",
      "//Perform the intersection of the properties of node_to_merge_props\n",
      "WITH [] as new_props, n, x, node_to_merge_props\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(node_to_merge_props[0]) | pairs +\n",
      "\tCASE WHEN ALL(other in node_to_merge_props WHERE k in keys(other))\n",
      "\tTHEN\n",
      "\t\tREDUCE(inner_pairs = [], v in node_to_merge_props[0][k] | inner_pairs +\n",
      "\t\t\tCASE WHEN ALL(other in node_to_merge_props WHERE v in other[k])\n",
      "\t\t\tTHEN\n",
      "\t\t\t\t{key: k, value: v}\n",
      "\t\t\tELSE\n",
      "\t\t\t\t[]\n",
      "\t\t\tEND)\n",
      "\tELSE\n",
      "\t\t[]\n",
      "\tEND) as new_props, n, x, node_to_merge_props\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, n, x, node_to_merge_props\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, n, x, node_to_merge_props\n",
      "WITH n.id as n_id, n, x, new_props, node_to_merge_props\n",
      "SET n = new_props\n",
      "SET n.id = n_id\n",
      "\n",
      "// Removal of edges attributes in 'actionGraph'\n",
      "MATCH (n:actionGraph)-[rel_pred:edge]->(m:actionGraph)\n",
      "OPTIONAL MATCH (x:metaModel)-[rel:edge]->(y:metaModel)WHERE (n)-[:typing]->(x) AND (m)-[:typing]->(y)\n",
      "FOREACH(dummy IN CASE WHEN rel IS NULL THEN [1] ELSE [] END |\n",
      "\tDELETE rel_pred\n",
      ")\n",
      "WITH rel, rel_pred\n",
      "WHERE rel IS NOT NULL AND REDUCE(invalid = 0, k in filter(k in keys(rel_pred) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel_pred[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH rel, rel_pred, [rel_pred, rel] as edges_to_merge_props\n",
      "\n",
      "//Perform the intersection of the properties of edges_to_merge_props\n",
      "WITH [] as new_props, edges_to_merge_props, rel, rel_pred\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(edges_to_merge_props[0]) | pairs +\n",
      "\tCASE WHEN ALL(other in edges_to_merge_props WHERE k in keys(other))\n",
      "\tTHEN\n",
      "\t\tREDUCE(inner_pairs = [], v in edges_to_merge_props[0][k] | inner_pairs +\n",
      "\t\t\tCASE WHEN ALL(other in edges_to_merge_props WHERE v in other[k])\n",
      "\t\t\tTHEN\n",
      "\t\t\t\t{key: k, value: v}\n",
      "\t\t\tELSE\n",
      "\t\t\t\t[]\n",
      "\t\t\tEND)\n",
      "\tELSE\n",
      "\t\t[]\n",
      "\tEND) as new_props, edges_to_merge_props, rel, rel_pred\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, edges_to_merge_props, rel, rel_pred\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, edges_to_merge_props, rel, rel_pred\n",
      "SET rel_pred = new_props\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'x': 'a', 'y': 'b'}"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "h.rewrite('metaModel', rule, instances[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Graph rewritting and propagation down"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([(\"w\", {\"name\":{\"Paul\"}}), \"x\", \"y\", \"z\"])\n",
    "pattern.add_edges_from([(\"x\", \"w\"), (\"y\", \"x\"), (\"y\", \"z\"), (\"z\",\"z\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "rule.inject_add_node_attrs(\"x\", {\"age\":{10}})\n",
    "rule.inject_add_edge_attrs(\"x\", \"w\", {\"relation\":{\"brothers\"}})\n",
    "rule.inject_add_node(\"new_node\", {\"name\":{\"Will\"}})\n",
    "rule.inject_add_edge(\"new_node\", \"y\")\n",
    "merged_node = rule.inject_merge_nodes([\"w\", \"z\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rhs_typing = {\n",
    "    'metaModel': {'new_node':'a', merged_node: 'a'}\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAIABJREFUeJzt3Xl0lPed5/v3U1WSSkICbQjtCK1o\nKSF2MLGJAccGgu3ESUwcJ5Oedm4cx0n3PZ4+k3TfjjtnpjO+J307meRm7sTunmSy2I7TSePYFmYz\nxtgYjLABiUUrEpIQkkBrCZVKVfXcPzAKq3ZVqaTP6xzOMaWn9HwB11fP5/k9v9/PME0TERERERER\nf7IEugAREREREZl9FERERERERMTvFERERERERMTvFERERERERMTvFERERERERMTvFERERERERMTv\nFERERERERMTvFERmEMMw6g3D2HTTa580DKPpNse+bRjGE9f9/m8NwzhnGIbTMIwmwzB+54+aRSQ4\nfdxv+j/uGa2GYfzSMIzIQNclItPLTb3i4vW94uP//q83HZ9hGIZpGIbt49+nGobxB8MwLhmG0W0Y\nRoVhGF8NwB9FpoCCiGAYxn8AvgxsMk0zElgB7AtsVSISBLZ93DOWcbVv/F8BrkdEpqdrvaIEWAp8\ndwzv/TXQCCwE4rh6vdI66RVKQNgCXYBMCyuBXaZp1gKYpnkReD6wJYlIsDBNs9kwjJ1AUaBrEZHp\nyzTNi4Zh7OJqIBmtlcD/aZpm38e//2jyK5NA0YiIABwGvmIYxt8YhrHCMAxroAsSkeBhGEYasAVd\nIIjIMAzDSAU2AzVjeNth4GeGYWw3DCN9aiqTQFEQmR2SDcPouv4X8IlrXzRN8zfAt4D7gQNAm2EY\n/zlAtYpI8NjxcT95l6u94wcBrkdEpqcdhmH0cvURqzbg2eu+9p9uuj45edN7Pw8cBP4eOGcYxnHD\nMFb6pWqZcgois8MF0zSjr//F1QuHIaZp/tY0zU1ANPAk8F8Mw7g/EMWKSNB4+OOestA0zadM0+wP\ndEEiMi09bJpmFPBJYDEQf93X/umm65Pi699ommanaZrfMU2zEFgAHOdqsDH8VLtMIQURuYFpmoOm\naf6eq3ck9Ly3iIiITArTNA8AvwT+aZzvv/Txe5OB2MmrTAJFQWTmCTEMw37tF6NYkMAwjK8ahrHV\nMIwowzAshmFsBgqBI1NerYiIiMwmPwbuMwxjyWgONgzj/zYMo8gwDJthGFHAN4Aa0zQvT2mV4hda\nNWvmKb3p9++N4j09wN8CvwGsQAPwDdM03x32XSIiIiJjYJpmu2EYvwK+B/SO4i0RwL8DSUA/V2+S\nPjh1FYo/GaZpBroGERERERGZZfRoloiIiIiI+J2CiIiIiIiI+J2CiIiIiIiI+J2CiIiIiIiI+N2Y\nVs2Kj483MzIypqgUERmrY8eOXTJNc36g6xgr9RKR6Uf9REQmy2j7yZiCSEZGBmVlZeOvSkQmlWEY\nDYGuYTzUS0SmH/UTEZkso+0nejRLRERERET8TkFERERERET8TkFERERERET8TkFERERERET8TkFE\nRERERET8TkFERERERET8TkFERERERET8TkFERERERET8TkFERERERET8TkFERERERET8TkFERERE\nRET8TkFERERERET8TkFERERERET8TkFERERERET8TkFERERERET8TkFERERERET8TkFERERERET8\nTkFERERERET8TkFERERERET8TkFERERERMTPMjIyqKioCHQZAaUgIiIiIiIifqcgIkN+/vOf881v\nfhOADz74AMMwOHr0KABPPfUUzz//fCDLE5Egon4iImM13r5hGAZJSUlERERgs9lYtGjR0NeOHDnC\nvffey/Lly1m+fDlvvPEGAN/97nf54Q9/CMArr7yCxWKhra0NgC1btrB79+471vnVr36VJ598kg0b\nNpCTk8NXvvIVTNMEoLW1lc985jMUFxfjcDj41a9+NfS+gwcP4nA4cDgcPP3000PvAaisrGTz5s2s\nXLmSJUuW8Itf/GLMf3/BSEFEhmzcuJF9+/YBsG/fPtauXXvD7zdu3BjI8kQkiKifiMhYTaRv/N3f\n/R0tLS1kZGTQ3d0NQFdXF08++SQvvvgix44d4/XXX+frX/86XV1dt5xrzZo1vPXWWwwODnLkyBE+\n8YlPDFtrRUUFpaWlnDp1imPHjrF3714Avv3tb1NUVMTJkyfZvXs33/nOd6ioqGBgYIDt27fz05/+\nlPLycu655x7Onz8PgMfj4bHHHuNHP/oRR48e5d133+W5557j7NmzE/sLDQIKIjIkOzub/v5+mpqa\n2LdvHz/4wQ/Yt28fjY2NDAwMkJWVFegSRSRIqJ+IyFhNpG888sgjfPazn+Ub3/gGnZ2duFwuDh06\nxLlz59i8eTMlJSVs3rwZwzCoqalh3bp1HD16FLfbzXvvvcf3vvc99u7dy+HDhykqKiIiImLYWh9+\n+GHsdjuhoaEsW7aM2tpaAPbu3cvXv/51AJKSktiyZQv79++nsrKSiIgIPvnJTwLwhS98gXnz5gFQ\nVVXFmTNn2L59OyUlJdx9990MDAxw5syZSfhbnd4UROQGGzZs4PXXX6e1tZVPfvKTtLS08MYbb7Bh\nw4ZAlyYiQUb9RETGarx945lnnqGwsJBnnnkGuDrKYJomxcXFHD9+fOhXY2MjK1asIDw8nOLiYl56\n6SWSkpK49957ef/990c9Ymu324f+22q14vF4xvxnNQwDANM0iY+Pv6HO+vp6PvOZz4z5ewYbBRG5\nwcaNG3nuuedYt24dAOvWreO5557TYxQiMmbqJyIyVuPtG93d3fz4xz++4bW77rqL6upq9u/fP/Ta\n0aNHh+ZmbNy4kWeffZaNGzcSFhZGamoqv/zlLyfUozZt2sQLL7wAwMWLFyktLWXDhg3k5eXR39/P\nwYMHAfi3f/s3urq6AMjLyyMiIoJf//rXQ9/n7Nmz9PT0jLuOYKEgIjfYsGEDDQ0NQx/CjRs30tDQ\noDuYIjJm6iciMlbj7RtVVVUsW7aMkpKSoddiYmL405/+xPe//32WLFlCfn4+//AP/3BDELn5XJcv\nX2bVqlXjrv8nP/kJJ06coLi4mPvuu4/nnnuOwsJCwsLCeOmll3jqqacoLi7m7bffJj09HQCbzcZr\nr73Gyy+/THFxMYWFhTz11FO43e5x1xEsjOtn7I9kxYoVZllZ2RSWIyJjYRjGMdM0VwS6jrFSLxGZ\nftRPRGSyjLafaERERERERET8zhboAkREREREhtPW1sanPvWpW17/7Gc/y/e+971JP9/x48f56le/\nesvrTz/9NE888cSkn2+2UhARERERkWktISGB48eP++18JSUlfj3fbKVHs0RERERExO8URERERERE\nxO/0aJbcwMTkApdo5+ra1vFEk0I8BkaAKxORYOPBSz0t9NKPDQupJBBDVKDLEpEg1Ec/9VzEzSDh\nhJFBEnZC/Xb+C7WDVBwcwO0yiUuxsmxTOGHhujaaKAURGXKBS7zDcdx48OAFwIaVEGzcwxJSmB/g\nCkUkGJiYnKCWk9QAVwOJBYMPqSKGKDawnEjCA1yliASDQTwc4DjNtAPgxYcVC4c5TRbJ3IUD6xQ+\n4NNx0cvPn+mkqWoQnxe8HgiLMPjtf+lhy9ci2fzEnKEd0mXs9GiWANDCJfZwlCsMDIUQuHoB0c8A\neykbagIiIsMp4ywnqcGDd6if+DDx4uMyPfyJd7mCK8BVish058HLG7xPM+148eHFB1wNIz581HGB\nvZRhMvo98cai+5KXf9x+iYbTgwwOXA0hAANXTNwuk9IXevnjj3un5NyzhYKIYGLyDieGPuC348XH\nO5yYsg+7iMwMPfRxmvobbmhcz8RkgEGOUennykQk2FTTSDd9d7w+8eKjlQ4aaZuS8+/4aS9Xun34\nbt/OcLvgrRf7aDvvmZLzzwYKIkILlxlgcMTjBvHQzCU/VCQiweo09SPesDAxqeMCg+iHt4jcWTl1\neO9wU+MaD17KqZ30c7uu+PigtB/v8KfH57saRmR8FESES3QPOxpyjQcvlz6exC4icjutdOAbxcip\nBQvd6Ie3iNyeFx9O+kd17GV6Jv38rfVerLaR5354B6H6Q/ekn3+2UBARERERERknTVUfPwURYT7R\no1pxwoaV+cT4oSIRCVaJxGEZxY9lHz7mMccPFYlIMLJiIYqIUR0bz7xJP39ihhWfd+TRXWsI5K70\n3zLCM42CiJBILGGEjHhcKDaSifNDRSISrArIGHHfIcM0yCKFEK0gLyLDKCJzxBulNqw4yJz0c4dF\nWFi1NRzrCG3KYoENX9RNlfFSEBEMDNZTgg3rnQ/ymNxDiTY2FJFhRRFBEZl37Cem18TqMVhOnp8r\nE5Fgk0sqMURhMW9/uWoO+ogdiCKVhCk5/8NPRxEZbcFyh8ujUDts+kok8am6qTJeCiICXH2c4lOs\nZA52bFgxzKsXDL4BD4NdLrw7L2FrG3lCu4jIMnJZSg42rFcDiQmmx4fP7WXwwhV49TKhXv3gFpHh\nWbGymTWkeOIwPSY+txef14fX5cHn9uKt7MP+Xv+U3SSdG2fl716OJz6jH2uID1soWKxXNzQMizDY\n9lQUDz8dOSXnni30k0CGJBLHF9jARTq4ZHRxtuos7Wfb+eDVd1m5ciUnw0+yadOmQJcpItOcgYGD\nLPLJ4DytdHl7OX7sI9rKztN85jzFxcXU1NSQl6dREREZXgg2HJfTObfnJBdCOoiImUNPaxeuym7C\nLWEY6ek4VzmJjJyaQGANv0LOwwf5P9Z+juoPwO0yiUuxsnSDnZAwPSUyUQoicgMDgyTiSCKOmKgw\nStubiYuL4+LFi4SGhtLb20tUVFSgyxSRIGDDSibJYIMBXwduaxc1/f04nU5OnjypICIio+J0OqHf\nx4WDNeTn52N0uEiOS+TUqVOkpKRQUVHBmjVrpuTcH374IQUFBaTnziE9d0pOMavp0Sy5o9TUVGJj\nY0lJSaG5uRmv10tFRUWgyxKRIFRUVITVaiU5OZnm5mY6OztpamoKdFkiEgR6e3sBGBgYwG63U1BQ\nQGRkJHa7nUuXLnH27Fnc7snfy6Onp4eGhgaKi4sn/XvLVQoiMiyHw0FkZCQRERG0t7dP2YddRGa2\nqKgoFi1aRGJiIh0dHbjdbk6ePBnoskQkCDidTtxuNxaLBavVSn5+Pna7ndTUVJqamnC73VRWVk76\neY8dO0ZRURFhYWGT/r3lKgURGVZ2djbh4eGkpqbS3NzM4OAgZ8+eDXRZIhKEiouLCQkJISEhgebm\nZpqamujo6Ah0WSIyzTmdTgYGBoYCQXR0NIWFhcTGxuL1eunu7qa8vByfb/IW1enq6qKxsZGioqJJ\n+55yKwURGZbVaqWwsJCYmBh8Ph9dXV1UVFRM6oddRGaHhIQEEhMTSU5O5uLFi3i9XsrLywNdlohM\nc729vbhcLux2OwCRkZEUFBRgs9lISUmhqakJp9NJfX39pJ3z2LFjFBcXExqqzQqnkoKIjKigoICQ\nkBBSU1Pp6OhgyZIlmObIu42KiNzM4XAQHh7OvHnz8Pl8ZGZO/kZkIjKz3DwiEhkZSXh4ODk5OSxY\nsIDe3l5SUlKIjY2dlPN1dHRw4cIFCgsLJ+X7yZ1p1SwZkd1uZ9WqVdxzzz0cOnSIlJQUrNZhNj8U\nEbmDjIwMHA4H69ato7y8nNTU1ECXJCLTmMvlwuPxDE1Ut9lsQyMjxcXFREREUFRUhGEYREdHT8o5\ny8rKWLJkCSEhIZPy/eTONCIio1JUVER2djaFhYV6lEJExs0wDNauXUthYSF2u52GhoZAlyQi05jT\n6QQYGhG5fguB6OhoVqxYwfLly6mpqcHlck34fJcuXaKtrY2CgoIJfy8ZmYKIjElBQQG1tbWT8mEX\nkdmtuLhYK2eJyLCuBRGXy0VYWNhtNy6MiIggIyODM2fOTPh8ZWVllJSUYLPpoSF/UBCRMQkPDycz\nM5PTp08HuhQRCXIZGRk4nU7a29sDXYqITFM37yFypx3Ui4uLOXXqFF6vd9znamtr4/Lly+Tn54/7\ne8jYKIjImDkcjgl/2EVELBYLDodDoyIickdOpxOv14vP5yMkJOSGR7OuFxsbS2xsLLW1teM+V1lZ\nGUuXLtU8WD9SEJExi4mJIT4+nurq6kCXIiJBLi8vb2jpTRGRm11buvf6FbPuZCI3Ni5evEh3dzeL\nFy8e1/tlfBREZFyKi4s1aV1EJiw0NJS8vDwqKioCXYqITEO3W7r3TtLS0jBNk+bm5jGfp6ysjGXL\nlmGx6NLYn/S3LeOSkpKCYRg0NTUFuhQRCXJFRUVUVlbidrsDXYqITDNOp/OGzQzv9GjWNeMZFblw\n4QJOp5OcnJxx1ynjoyAi46YVb0RkMkRGRpKamkplZWWgSxGRaWbLli2UlJSwatUqHA4HERERwx6f\nk5PDpUuX6OzsHPU5ysrKWL58uUZDAkB/4zJuWVlZdHR00NHREehSRCTIORwOysvL8fl8gS5FRKaR\n+Ph4oqKiKCkpYe3atRiGMezxVqt1THueNTU14XK5yM7OnoxyZYwURGTcrn3YNSoiIhOVkJBAZGQk\n9fX1gS5FRKYZp9M54iNZ1ysoKKCuro7+/v4Rj702GjJSwJGpoSAiE5Kfn099fT1XrlwJdCkiEuT0\nuKeI3I7T6Rx2kvrN7HY7WVlZI+55dv78eTweD5mZmRMtUcZJQUQmxG63k52drQ0ORWTCFi5ciMvl\norW1NdCliMg04fP56O/vH3FuyM0cDgenT5/G4/Hc8RiNhgSegohM2Gg+7CIiIzEMQxscisgNnE4n\nERERY55IHh0dzfz586mpqbnt1689Brpo0aKJligToCAiEzZv3jwWLFhAVVVVoEsRkSCXl5dHS0sL\nPT09gS5FRKaBsT6Wdb1rj3uapnnD66ZpUlZWxooVKyajRJkABRGZFNc2OLz5wy4iMhY2m43Fixdr\ng0MRAcY+Uf16ycnJWK1WGhsbb3i9rq4Om81Genr6ZJQoE6AgIpMiKSmJkJAQzp8/H+hSRCTIFRUV\nUV1dzcDAQKBLEZEAm8iICPz5Ruk1pmly7NgxjYZMEwoiMmnutOLN2bNnSUtLo6GhAYDvf//7bN++\n3d/liUiQiIiIID09nTNnztzyNfUTkdmlt7d33CMicHXPs87OTi5fvgxATU0Ndrud1NRU9ZNpQEFE\nJk1mZiY9PT1cunTphtcXL17MD37wAx599FF2797Niy++yPPPPx+gKkUkGBQXF3Pq1KlbNjhUPxGZ\nXSY6ImKxWCgqKhraMPX60RD1k8BTEJFJc+3DfrtRkS9/+cssXryYhx9+mBdffJG5c+cGoEIRCRZx\ncXHMmzePurq6W76mfiIye/T29k4oiMCf9zw7efIkkZGRJCcnD31N/SSwFERkUuXn59PY2EhfX98N\nr7vdbk6dOkV0dLT2CBCRUbnT457qJyKzg2ma9PX1TTiIhIWFkZWVxWuvvXbL3BD1k8BSEJFJFRoa\nSk5Ozi0r3vzN3/wNy5cvZ8+ePTz55JM0NTUFqEIRCRZpaWl4PB4uXLhww+vqJyKzQ39/PyEhIdhs\ntgl/L7vdTldXF/Hx8Te8rn4SWAoiMukcDgeVlZUMDg4CsGPHDt5++21+/OMfU1hYyLPPPssXv/hF\nbYAoIsO63QaH6icis8dElu69ntfrpaqqitWrV1NZWTn0uvpJ4Blj2fdhxYoVZllZ2RSWIzPF3r17\nSUxMpKioKNClzGiGYRwzTTPo1iBUL5HR8ng8vPTSS2zbto3o6OhAlzOjqZ/IdFNXV0dtbS333Xff\nhL5PRUUFTU1NlJSU8Pbbb/Poo49iGMYkVSm3M9p+ohERmRIOh0MbHIrIhNlsNvLz87XBocgsNBkT\n1T0eD8ePH2fFihUkJiYSFhY2tFyvBJ6CiEyJBQsWEBERQX19faBLEZEgV1hYSG1tLS6XK9CliIgf\nTcajWadPnyYhIWFobsidFsGQwFAQkSlz87PdIiLjER4ezqJFizh9+nSgSxERP5roiMjg4CAnTpy4\nYaWsRYsW4XQ6aW9vn4wSZYIURGTKZGRkcOXKFdra2gJdiogEOYfDwenTp/F6vYEuRUT8ZKKbGZ46\ndYrk5GRiY2OHXhtuzzPxPwURmTIWi0WjIiIyKWJiYoiLi6OmpibQpYiIn0zk0Sy3283JkydZvnz5\nLV9bvHgxTU1NOJ3OiZYoE6QgIlMqLy+P5uZment7A12KiAS5a4tgiMjM53a7MU2TsLCwcb2/oqKC\ntLS02662FxoaSm5urhbBmAYmvkPMDFFaWsrf/u3fDv3+9OnT/P73v+ehhx4KYFXBLyQkhNzsfPa+\ndB5Xw0JcfRCdaGH5p0NJK7Rq+TyZcdRLpk5qaiqe/hBKf97GpZoIfF5IzbeyYlsY0Ym6ryYyk0zk\nsayBgQEqKip4+OGH73iMw+Hg5X/dQ/v7Ti6fB2soLF4XQvHGUMLm6NrEXxREPrZlyxa2bNkCwAsv\nvMAvfvEL7r///gBXFfxaqr0c+u95DPQPYnquPtt9ocpL9ZFB4tOtfPG/RhAepQsImTnUS6bOsTcG\nOPfKekzTh/nxXJGL1V6Ove5m6eZQ7vu6XTc3RGaIiUxULy8vZ+HChcydO/e2X/cOmuz6iUH7++tp\n9XrAvNo3Wiq97P9fLh7+TgS5a0LGXbuMnq4Ab7Jr1y7++Z//mT/96U/Y7fZAlxPUui76+M13nLh6\nwfRc94E2YdAFbXVefvudPnxe7TUiM496yeSq2O9m7wsufB4D02sdet3rAY8bjr/p5u1fanlfkZli\nvPNDXC4Xp06dYtmyZXc85tV/ukLNBx58HutQCAEYHLj669+fu8L5cu2u7g8KItc5ceIETz75JK++\n+urQetMyfgdfdDE4zHWB1wMdF3xUf6APu8ws6iWTy/SZ7H3ehWfgzscMDsCRf3fT36sbGyIzwXgf\nzTpx4gSZmZl3DDGXGr1UH/YM2088A7Dned3Y8AcFkY81NzfzyCOP8Jvf/Ibc3NxAlxP0PG6T0wcG\nMX3DHzfogiN/HKYbiAQZ9ZLJV3/Cy+DAyAHDsFwdORGR4DeeR7P6+/s5e/YsS5cuveMxx1534xvF\nKuCXGr10XNBy4VNNQeRj//Iv/0J7ezvf/OY3KSkpoaSkhP379we6rKDV12ky2ke1Oy+MkFZEgoh6\nyeTrbPHiG0Wb8AzApfPqJyIzwXhGRI4fP05OTs6w72tv8I4qiFht0NmifjLVNFn9Y88++yzPPvts\noMuYMayhjOrCAcCq+WAyg6iXTD5biDG6GxsGhGo6jsiMMNY5IleuXKGqqorPf/7zwx4XEjbKu6Tm\n1d4jU0sjIjIl5kQbRMWNfJzVBos/oSQiIneWsdSG1zPyo1khYZCzWv1EJNh5vV5cLhcRERGjfs9H\nH31EXl7eiO/JvzsEa+jId0p9PkjOs454nEyMgohMCbfbjT3nFFgHhz3OsMCKbePbrEhEZgeX7xIh\n8RfBGOZ5CuPqDZC0Il04iAS7vr4+5syZM+rluJ1OJzU1NSxZsmTEYz3RZ/GN8GyWNQSWfCp09KMn\nMm4KIjLpPB4Pb775Ju6Yk/TbKzGN208etYXB/d+wE71A/xuKyO11dnayc+dOrPkH8Bi9tw0jhgGh\n4fCFfxj9hYuITF+9vb1jeizro48+Ij8/n/Dw8GGPq6yspOzDw5iLX8d3h2sTawjEpVnY8Bd6ztMf\nNEdEJpXP52PPnj20tLRQWXkWI7WKONuDuOuKsBCCYQHvIMSmWNjwH+1krdBjFCJye729vbzxxhv0\n9PRwquoE6cu6CWu/D8+FDGwhFjCu7iGStcLGxifsxCZrNERkJhjLRPWenh7q6up49NFHhz2uvr6e\nd955h46ODmovV1G42oKv9i68XfHYQg1MEzBh6ZZQ1j9uJ8Sumxr+oCAik8Y0Tfbv309jYyM1NTV4\nvV4KCxeTktLL/f84j8uNFtxXTKLiDV0wiMiw+vv7eeONN+ju7qaiooKkpCQS06JZ9pAXR0E07fVe\nTB/EplqYE61RVZGZZCxL93744YcUFhYOu3HshQsX2Lt3L93d3VRWVlJYWMi8aDdbvhZBZOhculp8\nWENgQaYVW6gCiD8piMikOXz4MLW1tZw7d44rV67gcDiYP38+999/P6GhISRlB7pCEQkGHo+HnTt3\n0tnZyalTp4iJiSEtLY2CggJWrFgBQGqBfnyJzFROp5PExMQRj+vu7ub8+fNs3779jsd0dHSwa9cu\nent7OX36NHl5ecybN49NmzaRnJwMwNx43cwIFHVyoMPVxtG2t6jrKcdn+pgfnsLqBfeRHpmr543H\nYOHChezevZuOjg6Ki4uJiYlhy5YthIaGBro0Eb8wTZPzziqOtO6hvb8Zi2Ehc66DVQs2EBOWEOjy\ngobNZmPhwoXs37+fiIgIMjMzycrKYt26dYEuTUT8YLRL9x47doyioqJhrzPmzp1LVFQU7777LllZ\nWcTGxnLPPfeQkZExiRXLeM36IPL+xV0cvPAnfKYPH1cnQXa7L9PQW0nqnCw+n/1NbBbNYxiNnp4e\nEhMTSU5OJjw8nK1bt444cUxkpvD4Bvl9zc9o6qth0PfnSZAftR/gxKWD3J38IGsT7w9ghcHDNE26\nurpYsmQJHo+HtLQ07r33Xt0YEpklRjNHpLOzk6amJj7xiU8Me5zb7cbtdrNu3To8Hg+rV68mLy9v\nMsuVCZjVQaTi8mHebXkNj3nrErODvgEandW8eu5feSTryQBUF1zOnTtHWVkZ27dvxzRNTNMc04oX\nIsHu1XP/SqOz+pZ+4sOLz/TybstrRIXMoyhuTYAqDB7vvfce/f39/MVf/AUtLS0kJiZisejRCZHZ\nwDTNUQWRY8eOUVxcPOxoiNvtZufOnSxevJilS5fS0NCgkZBpZtZ2dtP08VbzH2+4c3kzjzlIbXc5\nnQNtfqws+DQ3N3Pw4EEeeOAB5s2bR3R0NDExMYEuS8RvOlxt1HaX3/amxjWDPjf7m/+IaY68Md9s\nVlZWRltbG5/61KewWq2kpqZis83qe2Yis8qVK1cICwvDar3zojYdHR20tLRQVFR0x2OubSWQlJTE\nsmXLMAxDIWQamrVBpKmvDrcNe6smAAASAklEQVS3f8TjfKaP4+3v+qGi4NTe3s6+ffu47777iI+P\nD3Q5IgFx4tK7+MyRd+od8PbT1Ffrh4qCU3l5ObW1tZpbJjKLjWZ+SFlZGSUlJXe8SeHz+di7dy9R\nUVGsXbt2KsqUSTJrg0iPuwMY+XljH15qL1bS3d099UUFma6uLt58803Wr19PUlJSoMsRCZiOgdah\nOWbD8Xg8nKkrZ2BgwA9VBZfq6mrKy8vZunXrsMtwisjMdqele30+H4cOHaKuro62tjby8/Nv+37T\nNDlw4AAA69ev19yyaW7WjneHWkb5g86ErvYefvfh70hISCA3N5fMzMxZ/4PS6XRSWlrK6tWrWbhw\nYaDLEQkou3XOqI7z+UyqzlRz/oNfs3DhQnJyckhPT5/18x8aGho4fPgw27ZtG/XeASIyM91pfkhV\nVRUVFRX87ne/o6SkhCtXrjB37txbjnv//ffp7e1ly5Yts763BoNZG0QWRuViMvKjFL5BOPd+G1Fu\nk76+Ptra2jh06BDp6enk5uaSlpY27HOMM5HL5aK0tBSHw0Fubm6gyxEJuILYFZzpPIrbN/xIh8/0\ncupgLfNjnbhcLs6dO4fdbicrK4ucnBwSEmbfEr8tLS0cOHCAzZs3Ex0dHehyRCTAnE7nLfNMfT4f\nH374IT09PfT19TEwMMCJEye4++67bzjuww8/pKWlhW3btmluWZCYtf9KoVY7xXF3ceLSe3eeYGqC\nzQwlOzaLttY2Tp06hdVqZcGCBbhcLurr6wkLCyMrK4vc3NxpfRHxwx/+kPr6en72s58B0NraSnFx\nMefOnSMiImLU32dwcJDS0lIWLVqEw+GYqnJFgkpG1GLCbZG43W7gDpPRvQbhnfNZlD6P1tZWysrK\nmDt3LgkJCfT19XHq1CnmzZtHbm4uOTk503pkYLL6yeXLl9mzZw8bN25k/vz5U1WuiExjN/eTxsZG\nPvOZz9DQ0DDUT86ePYvT6aShoYG0tDRsNhtLly694fucPn2aqqoqHnzwQc0xCyKzesxqY+rnSQhP\nxWbcuk+IBQt2WwSbYr5EdlY2ixYtYuXKlWRlZXHlyhXKysooLy+nsbGR8vJydu/ePa1Xw/nLv/xL\n/vCHP+B0OgF4/vnneeyxx8Z00eD1etm1axfz589n5cqVU1WqSNAxDAvbc/4KuzUcy23aqs0IYcGc\nNO5JeIj09HTy8vJYvXo1CQkJtLa2cuTIEaqqqmhoaOCDDz6grKwsAH+K0ZuMftLd3c3OnTu5++67\nSUlJmapSRWSau7mf7Nixg0ceeWSon3i9Xj766CO6u7vp7+9nwYIF5Ofn33Czpra2lo8++oitW7eO\nqQ9J4M3aEREAmyWEx/P+E0fb9vFB614GvK6PJzWZFMWuYV3SVuaGxkD+1clTNTU1VFVVER0dTVZW\nFpcvX6atrY2amhpWrVpFS0sLSUlJ03JiVGxsLA8++CC//vWv+drXvsYLL7zAvn37Rv1+n8/Hvn37\nsNvtI24eJDIbxdkTeaLgWd5teZ2Ky0cwDAPTNAmz2lm1YBMrEzZis4Swcvkq2traqKqqora2loSE\nBNxuN21tbdTW1uL1eklLS6Orq2vaPqo00X7S19dHaWkpK1asYNGiRVNYqYhMdzf3k7179/LOO+8M\nff3MmTP09fVRX19Peno6ISEhN4yGNDY2cujQIbZu3ar9y4LQrA4icDWMrE18gDULPkWPuxMfXiJD\nogmx3DisFxUVxdKlS1m6dOltLyIcDgfvv/8+AwMDZGdnk5ubO+0uIr71rW/xpS99iYSEBPLz88nJ\nyRn1ew8ePIjH4+GBBx6YlkFLZDqYGxrDloVf5r60R3EOdmHBytzQGAzjxlGShIQEEhISWLt2LY2N\njVRVVWG320lNTcU0TWJiYnj99deJjIwkJyeHrKysabdAxnj7ycDAAKWlpeTn57N48eIprlJEgsG1\nfhITE0NSUhKFhYXA1ZUGP/roIzo7O3G73SQkJFBQUDA06tHa2sr+/fu5//77iY2NDeQfQcZp1geR\nawzDwrywuFEde+0i4q677uL8+fO0tLQMrVPd0dFBVVUVr7/+OnPmzCEnJ4fs7OxpcRHhcDiIi4vj\nr//6r4eexRyNI0eO0NnZydatW7UChcgohFhCiQkbec6Y1WolIyODjIwMXC4XdXV1GIZBfn4+q1ev\nprm5merqao4ePUpSUhK5ubmkp6dPiwUyxtNPPB4PO3fuJC0tjZKSkimuUESCxbV+8swzz/D4448P\nvX769Gn6+/tpaGhg4cKFhIaGDvWOjo4Odu/ezb333suCBQsCVbpMkK4qJ8BisZCRkXHDZjmxsbGs\nWbOGxx57jJUrV9LW1sbLL7/Mrl27qKurw+sdea+BqfTEE09gsVj49Kc/ParjT5w4wfnz59m8eTMh\nIbfOpRGRyWG32ykoKBhaG99isZCWlsaGDRt47LHHyMjI4NSpU/zmN7/h4MGDtLa2BrjisfUTn8/H\n7t27iYmJYc2aNX6oTkSCyRNPPAFc3fsDri6Oc/z4cTo6OvB4PMyfP5+ioiLCw8Pp6elh586d3HXX\nXaSlpQWybJkgjYhMEYvFQmpqKqmpqQwODnLu3DlOnz7NwYMHyczMJCcnh8TERL/XtX//fp5++ulR\njWycPXuW06dP8+CDDxIWFuaH6kTkdkJDQ8nLyyMvLw+n00l1dTUHDhzA5/ORk5NDTk7ObdfTn2qj\n7SemabJ//35sNtsty22KiMDVfrJ9+/ahXlZRUYHL5bphNKS4uJgrV65QWlrK0qVLycrKCnDVMlEK\nIn4QEhJCbm4uubm5OJ1OampqeOedd/x6EXHhwgXuvfdeEhMT+clPfjLi8efOnaOsrIxt27YxZ87o\nNmsTkakXGRk5NF+tvb2dqqoqduzYQXR0NDk5OWRmZk75jYOx9pP33nuP/v5+Nm/erMc7ReQG1/eT\n73//+0RFReF2uzl58iSXL1/G5/MRHx+Pw+HAYrHwxhtvkJubS0FBQaBLl0mgIOJnkZGRlJSUUFJS\nQnt7O9XV1ezYsWNo/4CpuohITk6msrJyVMc2Nzdz8OBBtmzZwrx58ya9FhGZHPPnz2f+/Pk3THo/\ncuQIqamp5OTkkJaWNiUX/mPpJ2VlZbS1tfHpT396WsxtEZHp5fp+smfPHiIjIykvL79hNCQsLIz8\n/HzefPNNkpKSWLZsWYCrlsmiIBJA1y4i1qxZQ1NT09BFREpKCjk5OaSnp/v97mF7ezv79u3jvvvu\nIz4+3q/nFpHxsVgsLFy4kIULFzIwMEBdXR0nTpzgwIEDZGdnk5OTE5ANA8vLy6mtreWhhx7SBmMi\nMiKn00loaCjl5eVcvnwZgPj4eIqKijh48CBRUVE3zMuV4KcgMg1YLBbS09NJT0/H7XZTV1fHyZMn\neeedd8jKyiInJ8cvu7Z3dXXx5ptvsn79epKSkqb8fCIy+a7dOczPz6enp4fq6mr27duHxWIhNzeX\n7Oxsv+zaXl1dTXl5OQ8++OC0WDVQRKY/p9NJfX09AwMDNDQ0sGjRIkJDQ+no6ACuTmTXFgIzi4LI\nNBMaGsrixYtZvHgxPT091NTU8NZbb2GxWIbmk0zFRYTT6aS0tJTVq1ezcOHCSf/+IuJ/c+fOZfny\n5SxfvpyLFy9SXV3NH/7wB+Li4sjNzWXRokVTshpeQ0MDhw8fZtu2bX4JPSIS/DweD319fVRVVdHe\n3o7Vah3aG8TlcrFlyxbNMZuBFESmsblz57Js2TKWLVtGa2vrDRcROTk5Q3cKJsrlclFaWorD4SA3\nN3cSKheR6SYxMZHExETuuusuGhoaqK6u5tChQ6Snp5Obm0tycvKk/JBvaWnhwIEDbN68edpt6ioi\n05fT6eTSpUvEx8fT0NBAdnY2Fy9eJC8vjwceeACbTZesM5H+VYPEggULWLBgAWvXruX8+fNUV1fz\n/vvvk56eTk5ODikpKcNeRJzoO86Ll3/Lh33H8OJlgW0Bj8Z9kQ1zNrK3dC+LFi3C4XD48U8kIoFg\ntVrJzMwkMzMTl8tFTU0NR48epa+vj+zsbHJzc4fdoXjQHOSt7n28dPm3nHefx4KFgvACHot7nOyB\nHPbs2cPGjRsDMidFRIJLp6eTVzt3sKPzj3R5ujC3QtKFROY0RdHf3094eDjbtm3THLMZzDBNc9QH\nr1ixwiwrK5vCcmQsXC4XtbW1VFdX43Q6hyalxsX9eYd40zT5WetPebVzBwPmACZ//ve2G3bsbjvf\n6H2aLZ/YEog/gkyQYRjHTNNcEeg6xkq9ZPrp6uqiqqqKmpoaQkNDh+aTREREDB1zxdvHtxuepmGg\nAZfpuuH9dsNOyuVU/j75WbIytbZ/MFI/EX+qcVXz7fqnGTAHcJvuP3/BBxafhaT9Kfx/X/mfxMTE\nBK5IGbfR9hONiAQxu91OYWEhhYWFdHV1UV1dza5duwgNDR2aT7JvYC+vdu645aIBwGW6cNvcvJL0\nEpvNzZoAJjKLRUdHs2rVKlauXElLSwvV1dW88sorJCQkkJubS0ZGBt9r/nvqBs4xeP1Fw8dcpovG\n2PO8FbmXLBREROTO+rx9/FX9t+j19d76RQv4LD7aNl2kKayJGBREZjLN+pkhoqOjWblyJV/84hdZ\nt24dXV1d/O6V3/E/Gv/f24aQa3yGjwvuC5T3n/RjtSIyXRmGQXJyMuvXr+fxxx8nNzeX6upq/sfv\nf8YxZ9ltQ8g1btz8/vIrDPgG/FixiASbN7t23jgKchuDxiD/u/1/+akiCRQFkRnGMAySkpJYv349\nKz+3gkGbZ8T3uEwXr3X+yQ/ViUgwsdlsZGdns3nzZsLuCbvh0c47MQyDI87DfqhORILVjq5/H/Ym\n6TXHrhzjiu+KHyqSQFEQmcF6zB5slpF3MjYxaRts80NFIhKsuowuvIZ3xOO8ppcub6cfKhKRYNXj\n6R7VcTZs9Hp7prgaCSQFkRlsrnXuqO5gAsTa7rxKjohIrC0WKyPf2LAaVuZa5/mhIhEJVpHWqFEd\n5zE9RFpGd6wEJwWRGSw/vIBQY+Ql78KNcLZGb/NDRSISrDbNuw+bMfL6Jj7Tx+rINX6oSESC1bbo\nbYQZ9hGPc0Q4mGOd44eKJFAURGYwq2HlK/H/AfswH3YLFuJD4lk+Z7kfKxORYLMobBH54QXYhlls\nMcwI48GYhwi3hPuxMhEJNltjPo3NGH6E1W7Y+er8/+iniiRQFERmuM/FfoGNczfdNoyEGmHE2mL5\n0cL/rqV7RWRE/5j230gOTSHMCLvla3bDztI5S/nGgm8GoDIRCSZR1rn8P+k/IsISccvNDQODMCOM\nryc8yTLdJJ3xtI/IDGcYBv85+bvcM3c9v730a8r7KwCTGGsMn497lIdiHiZqlM9qisjsNtc6l3/N\n/AVvdL7Oyx0v0jrYCkBWWDZfin+ce+duwDrCXU4REYDCiCJ+lfVbXrn8Mq93vUa/rx8rVu6KWseX\n4r9MQXhBoEsUP1AQmQUMw+CuqHXcFbUO0zTx4dPFgoiMi91i55G4z/FI3Ofwml4MDCyGBtdFZOwW\nhCzgW4l/xbcS/wqP6cGKVU9ozDIKIrOMYRijWvlGRGQkuqEhIpNlNIthyMyj21giIiIiIuJ3CiIi\nIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIi\nIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3\nCiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIi\nIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIi\nIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3CiIiIiIiIuJ3\nhmmaoz/YMNqBhqkrR0TGaKFpmvMDXcRYqZeITEvqJyIyWUbVT8YURERERERERCaDHs0SERERERG/\nUxARERERERG/UxARERERERG/UxARERERERG/UxARERERERG/UxARERERERG/UxARERERERG/UxAR\nERERERG/UxARERERERG/+/8B+qov65VaEPAAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'w': 'c', 'x': 'a', 'y': 'd', 'z': 'e'}]\n"
     ]
    }
   ],
   "source": [
    "instances = h.find_matching('actionGraph', pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_w:actionGraph { id : 'c'}) , (lhs_x:actionGraph { id : 'a'}) , (lhs_y:actionGraph { id : 'd'}) , (lhs_z:actionGraph { id : 'e'})  , (lhs_x)-[lhs_x_lhs_w:edge]->(lhs_w), (lhs_y)-[lhs_y_lhs_x:edge]->(lhs_x), (lhs_y)-[lhs_y_lhs_z:edge]->(lhs_z), (lhs_z)-[lhs_z_lhs_z:edge]->(lhs_z)\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH lhs_y_lhs_z, lhs_x_lhs_w, lhs_z_lhs_z, lhs_y_lhs_x , lhs_w as p_w, lhs_x as p_x, lhs_y as p_y, lhs_z as p_z \n",
      "\n",
      "// Merging nodes '{'w', 'z'}' of the preserved part into 'w_z' \n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, p_y, lhs_y_lhs_z, lhs_x_lhs_w, p_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_w) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_w[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_y, lhs_y_lhs_z, lhs_x_lhs_w, p_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_z) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_z[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_y, lhs_y_lhs_z, lhs_x_lhs_w, p_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, p_y, lhs_y_lhs_z, lhs_x_lhs_w, p_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, p_y, lhs_y_lhs_z, lhs_x_lhs_w, p_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "SET p_w = new_props\n",
      "WITH p_w as rhs_w_z, p_y, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "// set appropriate node id\n",
      "SET rhs_w_z.id = toString(id(rhs_w_z))\n",
      "SET rhs_w_z.count = NULL\n",
      "WITH toString(id(rhs_w_z)) as uidedfb0dd7f0fc417da402d1bdad12aa67, p_y, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_maps, [] as pred_maps, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "OPTIONAL MATCH (rhs_w_z)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(rhs_w_z)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "OPTIONAL MATCH (p_z)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(p_z)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN [id(rhs_w_z),id(p_z)] THEN [toString(el['id'])] ELSE [] END) as self_loops, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, self_loops, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, self_loops, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (rhs_w_z)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(rhs_w_z)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (rhs_w_z)-[new_rel:edge]->(rhs_w_z)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "OPTIONAL MATCH (rhs_w_z)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "OPTIONAL MATCH (pred)-[:typing]->(rhs_w_z)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "OPTIONAL MATCH (p_z)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "OPTIONAL MATCH (pred)-[:typing]->(p_z)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, lhs_y_lhs_x\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (rhs_w_z)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(rhs_w_z))\n",
      "DETACH DELETE (p_z)\n",
      "\n",
      "\n",
      "// Adding node 'new_node' from the rhs \n",
      "CREATE (rhs_new_node:actionGraph) \n",
      "SET rhs_new_node.id = toString(id(rhs_new_node)) \n",
      "WITH toString(id(rhs_new_node)) as rhs_new_node_id , p_y, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, p_x, lhs_z_lhs_z, p_z, rhs_new_node, lhs_y_lhs_x\n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH rhs_new_node_id, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, lhs_x_lhs_w, lhs_z_lhs_z, p_z, rhs_new_node, lhs_y_lhs_x , p_x as rhs_x, p_y as rhs_y \n",
      "\n",
      "// Adding properties to the node 'x' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'age' IN keys(rhs_x) THEN [1] ELSE [] END |\n",
      "\tSET rhs_x.age = [10])\n",
      "FOREACH(dummy IN CASE WHEN 'age' IN keys(rhs_x) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [10] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_x.age THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_x.age = rhs_x.age + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'new_node' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_new_node) THEN [1] ELSE [] END |\n",
      "\tSET rhs_new_node.name = ['Will'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_new_node) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Will'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_new_node.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_new_node.name = rhs_new_node.name + [val])))\n",
      "\n",
      "\n",
      "// Adding properties to the node 'w_z' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_w_z) THEN [1] ELSE [] END |\n",
      "\tSET rhs_w_z.name = ['Paul'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_w_z) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Paul'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_w_z.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_w_z.name = rhs_w_z.name + [val])))\n",
      "\n",
      "\n",
      "// Adding edge 'new_node->y' from the rhs \n",
      "MERGE (rhs_new_node)-[rhs_new_node_rhs_y:edge]->(rhs_y)\n",
      "\n",
      "\n",
      "// Adding properties to an edge 'x'->'w_z' from the rhs \n",
      "WITH rhs_new_node_id, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, rhs_y, lhs_x_lhs_w, rhs_x, lhs_z_lhs_z, p_z, rhs_new_node, lhs_y_lhs_x \n",
      "MATCH (rhs_x)-[rhs_x_rhs_w_z:edge]->(rhs_w_z)\n",
      "FOREACH(dummy IN CASE WHEN NOT 'relation' IN keys(rhs_x_rhs_w_z) THEN [1] ELSE [] END |\n",
      "\tSET rhs_x_rhs_w_z.relation = ['brothers'])\n",
      "FOREACH(dummy IN CASE WHEN 'relation' IN keys(rhs_x_rhs_w_z) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['brothers'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_x_rhs_w_z.relation THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_x_rhs_w_z.relation = rhs_x_rhs_w_z.relation + [val])))\n",
      "WITH rhs_new_node_id, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, rhs_y, rhs_x_rhs_w_z, lhs_x_lhs_w, rhs_x, lhs_z_lhs_z, p_z, rhs_new_node, lhs_y_lhs_x \n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_new_node_id, uidedfb0dd7f0fc417da402d1bdad12aa67, rhs_w_z, lhs_y_lhs_z, rhs_y, rhs_x_rhs_w_z, lhs_x_lhs_w, rhs_x, lhs_z_lhs_z, p_z, rhs_new_node, lhs_y_lhs_x\n",
      "\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Checking consistency of introduced rhs\n",
      "MATCH (G:hierarchyNode)\n",
      "WHERE G.id = 'actionGraph'\n",
      "OPTIONAL MATCH (t_i:hierarchyNode)\n",
      "WHERE (t_i)<-[:hierarchyEdge*1..]-(G)-[:hierarchyEdge*1..]->(t_i)\n",
      "WITH DISTINCT t_i\n",
      "RETURN collect(t_i.id)\n",
      "\n",
      "// Replacing ':tmp_typing' with ':typing'\n",
      "MATCH (n:actionGraph)-[t:tmp_typing]->(m)\n",
      "OPTIONAL MATCH (:hierarchyNode {id: 'actionGraph'})-[skeleton_rel:hierarchyEdge]->(:hierarchyNode {id: labels(m)[0]}) \n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [] ELSE [1] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:typing]->(m)\n",
      ")\n",
      "FOREACH( dummy IN (CASE skeleton_rel WHEN null THEN [1] ELSE [] END) | \n",
      "\tDELETE t\n",
      "\tMERGE (n)-[:transitive_typing]->(m)\n",
      ")\n",
      "\n",
      "\n",
      "// Up-propagation to the graph 'metaModel'\n",
      "\n",
      "// Matching of the nodes to merge in 'metaModel'\n",
      "WITH [] as merged_nodes\n",
      "OPTIONAL MATCH (n:actionGraph)-[:typing]->(node_to_merge:metaModel)\n",
      "WITH n, collect(node_to_merge) as nodes_to_merge, merged_nodes\n",
      "WHERE n IS NOT NULL AND size(nodes_to_merge) >= 2\n",
      "UNWIND nodes_to_merge as node_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, node_to_merge, n, merged_nodes\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(node_to_merge) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in node_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, node_to_merge, n, merged_nodes\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(new_props) as new_props_col, n, merged_nodes\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge, n, merged_nodes\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, n, merged_nodes, nodes_to_merge\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, n, merged_nodes, nodes_to_merge\n",
      "WITH nodes_to_merge[0] as merged_node, new_props, n, merged_nodes, nodes_to_merge\n",
      "SET merged_node = new_props\n",
      "// set appropriate node id\n",
      "SET merged_node.id = toString(id(merged_node))\n",
      "SET merged_node.count = NULL\n",
      "WITH toString(id(merged_node)) as merged_id, n, merged_nodes, merged_node, nodes_to_merge\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "//create a map from node ids to the id of the merged_node\n",
      "WITH {old_node:node_to_merge.id,  new_node:merged_node} as id_to_merged_id, node_to_merge, merged_node, n, merged_nodes, merged_id\n",
      "WITH collect(id_to_merged_id) as ids_to_merged_id, collect(node_to_merge) as nodes_to_merge, merged_node, n, merged_nodes, merged_id\n",
      "WITH apoc.map.groupByMulti(ids_to_merged_id, 'old_node') as ids_to_merged_id, merged_node, n, merged_nodes, nodes_to_merge, merged_id\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(ids_to_merged_id) | \n",
      "\tpairs + [k, REDUCE(values=[], v in ids_to_merged_id[k] | \n",
      "\t\tvalues + CASE WHEN v.new_node IN values THEN [] ELSE v.new_node END)])) as ids_to_merged_id, merged_node, n, merged_nodes, nodes_to_merge, merged_id\n",
      "WITH collect({n:n, nodes_to_merge:nodes_to_merge, merged_node: merged_node, merged_id: merged_id}) as all_n, collect(ids_to_merged_id) as ids_to_merged_id, merged_nodes\n",
      "WITH reduce(acc={}, x in ids_to_merged_id | apoc.map.merge(acc, x)) as ids_to_merged_id, all_n, merged_nodes\n",
      "UNWIND all_n as n_maps\n",
      "WITH n_maps.n as n, n_maps.nodes_to_merge as nodes_to_merge, n_maps.merged_node as merged_node, n_maps.merged_id as merged_id, ids_to_merged_id, merged_nodes\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH node_to_merge, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "OPTIONAL MATCH (node_to_merge)-[out_rel:edge]->(suc)\n",
      "WITH CASE WHEN suc.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[suc.id][0]), neighbor: ids_to_merged_id[suc.id][0], edge: out_rel}\n",
      "\t\tELSE {id: id(suc), neighbor: suc, edge: out_rel} END AS suc_map, node_to_merge, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "WITH collect(suc_map) as suc_maps, node_to_merge, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(node_to_merge)\n",
      "WITH CASE WHEN pred.id IN keys(ids_to_merged_id)\n",
      "\t\tTHEN {id: id(ids_to_merged_id[pred.id][0]), neighbor: ids_to_merged_id[pred.id][0], edge: in_rel}\n",
      "\t\tELSE {id: id(pred), neighbor: pred, edge: in_rel} END AS pred_map, node_to_merge, suc_maps, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "WITH collect(pred_map) as pred_maps, suc_maps, node_to_merge, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(node_to_merge.id) as list_ids, collect(suc_maps) as suc_maps_col, collect(pred_maps) as pred_maps_col, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "WITH REDUCE(init=[], maps in suc_maps_col | init + maps) as suc_maps, REDUCE(init=[], maps in pred_maps_col | init + maps) as pred_maps, list_ids, nodes_to_merge, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN list_ids THEN [toString(el['id'])] ELSE [] END) as self_loops, merged_node, n, merged_nodes, nodes_to_merge, list_ids, ids_to_merged_id, merged_id\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, merged_node, n, merged_nodes, nodes_to_merge, self_loops, ids_to_merged_id, merged_id\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, merged_node, n, merged_nodes, nodes_to_merge, self_loops, ids_to_merged_id, merged_id\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "WITH merged_node, n, merged_nodes, nodes_to_merge, ids_to_merged_id, merged_id\n",
      "UNWIND nodes_to_merge AS node_to_merge\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, node_to_merge, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "OPTIONAL MATCH (node_to_merge)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, node_to_merge, pred_typings, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "OPTIONAL MATCH (pred)-[:typing]->(node_to_merge)\n",
      "WITH pred_typings + collect(pred) as pred_typings, node_to_merge, suc_typings, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "WITH collect(node_to_merge) as nodes_to_merge, collect(suc_typings) as suc_typings_col, collect(pred_typings) as pred_typings_col, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "WITH REDUCE(init=[], sucs in suc_typings_col | init + sucs) as suc_typings, REDUCE(init=[], preds in pred_typings_col | init + preds) as pred_typings, nodes_to_merge, merged_node, n, merged_nodes, ids_to_merged_id, merged_id\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (merged_node)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(merged_node))\n",
      "WITH merged_node, n, merged_nodes, nodes_to_merge, ids_to_merged_id, merged_id\n",
      "FOREACH(node in filter(x IN nodes_to_merge WHERE x <> merged_node) |\n",
      "\tDETACH DELETE node)\n",
      "RETURN collect(merged_id) as merged_nodes\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "// Addition of nodes and properties in 'metaModel'\n",
      "MATCH (n:actionGraph)\n",
      "OPTIONAL MATCH (n)<-[:typing*0..]-()-[:typing*]->(existing_img:metaModel)\n",
      "FOREACH(dummy IN CASE WHEN existing_img IS NOT NULL THEN [1] ELSE [] END |\n",
      "\tMERGE (n)-[:typing]->(existing_img))\n",
      "WITH n OPTIONAL MATCH (n)<-[:typing*]-(:actionGraph)-[trans_type:transitive_typing]->(successor_node:metaModel)\n",
      "\tFOREACH(dummy IN CASE WHEN trans_type IS NULL THEN [] ELSE [1] END |\n",
      "\t\tMERGE (n)-[:typing]->(successor_node)\n",
      "\t\tDELETE trans_type)\n",
      "WITH n MERGE (n)-[:typing]->(node_img:metaModel)\n",
      "WITH n, node_img\n",
      "FOREACH(dummy IN CASE WHEN node_img.id IS NULL THEN [1] ELSE [] END |\n",
      "\tSET node_img.id = toString(id(node_img)))\n",
      "WITH n, node_img WHERE REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(node_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN node_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH node_img, collect(n) + [node_img] as nodes_to_merge_props\n",
      "UNWIND nodes_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, node_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, node_img\n",
      "WITH collect(prop_to_merge) as nodes_to_merge_props, collect(new_props) as new_props_col, node_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, nodes_to_merge_props, node_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, nodes_to_merge_props, node_img\n",
      "SET node_img += new_props\n",
      "\n",
      "\n",
      "// Addition of edges and properties in 'metaModel'\n",
      "MATCH (n:actionGraph)-[rel:edge]->(m:actionGraph), (n)-[:typing]->(x:metaModel), (m)-[:typing]->(y:metaModel)\n",
      "MERGE (x)-[rel_img:edge]->(y)\n",
      "WITH x, y, rel, rel_img WHERE REDUCE(invalid = 0, k in filter(k in keys(rel) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel_img) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel_img[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH x, y, rel_img, collect(rel) + rel_img as edges_to_merge_props\n",
      "UNWIND edges_to_merge_props as prop_to_merge\n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH new_props + REDUCE(pairs = [], k in filter(k in keys(prop_to_merge) WHERE k <> 'id') | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in prop_to_merge[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, prop_to_merge, x, y, rel_img\n",
      "WITH collect(prop_to_merge) as edges_to_merge_props, collect(new_props) as new_props_col, x, y, rel_img\n",
      "WITH REDUCE(init=[], props in new_props_col | init + props) as new_props, edges_to_merge_props, x, y, rel_img\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, x, edges_to_merge_props, y, rel_img\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, x, edges_to_merge_props, y, rel_img\n",
      "SET rel_img += new_props\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'new_node': '30', 'w_z': '18', 'x': 'a', 'y': 'd'}"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "h.rewrite('actionGraph', rule, instances[0], rhs_typing=rhs_typing)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Removing a graph from the hierarchy"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can also remove a graph from the hierarchy. All its nodes and connections (edges and typing edges) are removed."
   ]
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
