{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Examples of utils provided by ReGraph's neo4j module"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "\n",
    "from regraph import Rule, plot_rule\n",
    "from regraph.neo4j.graphs import Neo4jGraph\n",
    "from regraph.neo4j.cypher_utils import *"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Initializing Neo4j graph\n",
    "\n",
    "0. When installing neo4j you will be asked to choose login/password for you dbs (here its \"neo4j\"/\"admin\"), if you choose other -- change in the cell below.\n",
    "1. To start neo4j server run `sudo service neo4j start`\n",
    "2. Check status by running `sudo service neo4j status`. Here you can check the _bolt_ port, change the cell below if different from 7687\n",
    "3. You can query the db by using the neo4j browser, the address can be found also in the result of 'status', e.g. \"Remote interface available at http://localhost:7474/\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# initialize the neo4j driver, wrappped into Neo4jGraph object\n",
    "g = Neo4jGraph(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"admin\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# here we clear the db\n",
    "res = g.clear()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f15c52e5160>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes = [\n",
    "    (\"a\", {\"name\": \"Jack\", \"age\": 23, \"hobby\": {\"hiking\", \"music\"}, \"weight\": 75}), \n",
    "    (\"b\", {\"name\": \"Bob\", \"age\": 24, \"hobby\": {\"sport\", \"music\"}, \"height\": 178}),\n",
    "    \"c\", \n",
    "    (\"d\", {\"name\": \"Paul\"}), \"e\", \"f\"\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"b\", {\"type\": {\"friends\", \"colleagues\"}}), \n",
    "    (\"d\", \"b\", {\"type\": \"enemies\"}), \n",
    "    (\"a\", \"c\"),\n",
    "    (\"d\", \"a\", {\"type\": \"friends\"}),\n",
    "    (\"e\", \"a\"), \n",
    "    (\"f\", \"d\")\n",
    "]\n",
    "g.add_nodes_from(nodes)\n",
    "g.add_edges_from(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (n { id : 'a' })\n",
      "RETURN n\n",
      "\n",
      "{'hobby': ['hiking', 'music'], 'id': 'a', 'age': [23], 'weight': [75], 'name': ['Jack']}\n"
     ]
    }
   ],
   "source": [
    "print(get_node(\"a\"))\n",
    "print(g.get_node(\"a\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Primitive operations on Neo4j graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Basic operations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f15c52d3dd8>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.add_node(\"x\", {\"name\": \"Roberto\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f15c52e64a8>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.add_edge(\"x\", \"c\", {\"type\": {\"friends\", \"colleagues\"}, \"since\": 1993})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['a', 'b', 'c', 'd', 'e', 'f', 'x']"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('a', 'c'),\n",
       " ('a', 'b'),\n",
       " ('d', 'b'),\n",
       " ('d', 'a'),\n",
       " ('e', 'a'),\n",
       " ('f', 'd'),\n",
       " ('x', 'c')]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.edges()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'type': ['colleagues', 'friends']}"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.get_edge('a', 'b')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cloning"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "By default if we clone a node without specifying the new id for it, the id is automatically derived from the original one (however it takes some additional time to generate it, and some naming collisions may happen in the future when using clone operation inside of complex queries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created clone by the name:  a1\n",
      "Properties of the resulting node: \n",
      "{'hobby': ['hiking', 'music'], 'id': 'a1', 'age': [23], 'weight': [75], 'name': ['Jack']}\n",
      "Properties of incident edges are also cloned, e.g: \n",
      "{'type': ['colleagues', 'friends']}\n"
     ]
    }
   ],
   "source": [
    "clone1_res = g.clone_node('a')\n",
    "print(\"Created clone by the name: \", clone1_res)\n",
    "print(\"Properties of the resulting node: \")\n",
    "print(g.get_node(clone1_res))\n",
    "print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "print(g.get_edge(clone1_res, 'b'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can specify the parameter `ignore_naming=True` to avoid automatic id derivation. In this case cloning uses Neo4j native ids (this mode is more suitable for using clone operation inside of complex queries as the Neo4j id have the guaranteed uniqueness)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Here we ignore pretty naming of new clones\n",
      "\n",
      "Created clone by the name:  478\n",
      "Properties of the resulting node: \n",
      "{'hobby': ['hiking', 'music'], 'id': '478', 'age': [23], 'weight': [75], 'name': ['Jack']}\n",
      "Properties of incident edges are also cloned, e.g: \n",
      "{'type': ['colleagues', 'friends']}\n"
     ]
    }
   ],
   "source": [
    "print(\"Here we ignore pretty naming of new clones\\n\")\n",
    "clone2_res = g.clone_node('a', ignore_naming=True)\n",
    "print(\"Created clone by the name: \", clone2_res)\n",
    "print(\"Properties of the resulting node: \")\n",
    "print(g.get_node(clone2_res))\n",
    "print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "print(g.get_edge(clone2_res, 'b'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The third option is to specify the id of the new node manually"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created clone by the name:  a_clone\n",
      "Properties of the resulting node: \n",
      "{'hobby': ['hiking', 'music'], 'id': 'a_clone', 'age': [23], 'weight': [75], 'name': ['Jack']}\n",
      "Properties of incident edges are also cloned, e.g: \n",
      "{'type': ['colleagues', 'friends']}\n"
     ]
    }
   ],
   "source": [
    "clone3_res = g.clone_node('a', 'a_clone')\n",
    "print(\"Created clone by the name: \", clone3_res)\n",
    "print(\"Properties of the resulting node: \")\n",
    "print(g.get_node(clone3_res))\n",
    "print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "print(g.get_edge(clone3_res, 'b'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Properties of the resulting node: a_b\n",
      "{'hobby': ['hiking', 'music', 'sport'], 'name': ['Jack', 'Bob'], 'id': 'a_b', 'age': [23, 24], 'weight': [75], 'height': [178]}\n"
     ]
    }
   ],
   "source": [
    "merge1_res = g.merge_nodes1([\"a\", \"b\"])\n",
    "print(\"Properties of the resulting node: {}\".format(merge1_res))\n",
    "print(g.get_node(merge1_res))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Properties of the resulting node: a_b_d\n",
      "{'hobby': ['hiking', 'music', 'sport'], 'name': ['Jack', 'Bob', 'Paul'], 'id': 'a_b_d', 'age': [23, 24], 'weight': [75], 'height': [178]}\n"
     ]
    }
   ],
   "source": [
    "merge2_res = g.merge_nodes([\"a_b\", \"d\"])\n",
    "print(\"Properties of the resulting node: {}\".format(merge2_res))\n",
    "print(g.get_node(merge2_res))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Rewriting Neo4j graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Create an SqPO rewriting rule"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", \"y\", \"z\"])\n",
    "pattern.add_edges_from([(\"y\", \"x\"), (\"y\", \"z\"), (\"z\", \"z\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "clone_name1, _ = rule.inject_clone_node(\"y\")\n",
    "clone_name2, _ = rule.inject_clone_node(\"y\")\n",
    "rule.inject_remove_edge(clone_name2, \"z\")\n",
    "rule.inject_remove_node(\"x\")\n",
    "rule.inject_add_node(\"new_node\")\n",
    "rule.inject_add_edge(\"new_node\", \"z\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xl8leWd9/Hvdc7JHiBkg4QkhrCELZElLKnLSFERRtFW\nRx2dqs+jolbsMO04bX26Oe30aQerHafWKvZpR3QsWkcsVQsV0YrsYkC2QCAxCQkJZAGynJztfv4A\nTwEDSTC5T87J5/168XoJuU/yO0h+ub7Xdd3XbSzLEgAAAADYyRHqAgAAAAAMPAQRAAAAALYjiAAA\nAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQiiDGmwhhz5Vl/doUxprqTa981xtxz\n2u8fMcaUG2NajDHVxpjldtQMIDyd6jftp3pGnTHmt8aYxFDXBaB/OatXHD69V5z67x+ddX2uMcYy\nxrhO/T7LGPOqMeaoMeaYMWanMeauELwV9AGCCGSMuVPSVyRdaVlWoqQiSWtCWxWAMHDdqZ4xVSf7\nxndCXA+A/unTXjFZ0hRJ3+7Ba5dJqpJ0kaQUnRyv1PV6hQgJV6gLQL8wXdIqy7IOSJJlWYclPRva\nkgCEC8uyDhlj3pI0KdS1AOi/LMs6bIxZpZOBpLumS/ony7JaT/3+o96vDKHCiggkaaOkO4wxDxtj\niowxzlAXBCB8GGOyJc0XAwQA52GMyZI0T1JZD162UdJTxphbjTE5fVMZQoUgMjBkGmOaT/8l6dJP\nP2hZ1guSHpI0V9J7kuqNMd8MUa0AwseKU/1knU72jh+HuB4A/dMKY8wJndxiVS/p+6d97J/PGp/s\nOOu1fyfpfUnflVRujCkxxky3pWr0OYLIwFBjWVbS6b90cuAQZFnWi5ZlXSkpSdL9kn5ojJkbimIB\nhI0bTvWUiyzL+qplWe2hLghAv3SDZVmDJF0haZyk1NM+9thZ45PC019oWVaTZVnfsixroqRhkkp0\nMtgYm2pHHyKI4AyWZXkty3pFJ2ck2O8NAAB6hWVZ70n6raTHLvD1R0+9NlNScu9VhlAhiESeKGNM\n7Ke/1I0DCYwxdxlj/tYYM8gY4zDGzJM0UdKmPq8WAAAMJD+XdJUx5uLuXGyM+akxZpIxxmWMGSTp\nAUlllmU19GmVsAWnZkWeN8/6/QfdeM1xSY9IekGSU9Inkh6wLGvdeV8FAADQA5ZlHTHGPC/pe5JO\ndOMl8ZJek5QhqV0nJ0kX9F2FsJOxLCvUNQAAAAAYYNiaBQAAAMB2BBEAAAAAtiOIAAAAALAdQQQA\nAACA7Xp0alZqaqqVm5vbR6UA6KkPP/zwqGVZaaGuo6foJUD/Qz8B0Fu62096FERyc3O1devWC68K\nQK8yxnwS6houBL0E6H/oJwB6S3f7CVuzAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAA\ngO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQA\nAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1B\nBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiEBvvvmm\nJk+eHPwVHR2t119/PdRlAQgz9BIAvYV+MjAQRKD58+erpKREJSUlevDBB1VUVKS5c+eGuiwAYYZe\nAqC30E8GBleoC0D/sWrVKj3++ON6//33FRsbG+pyAIQpegmA3kI/iWwEEUiStm/frvvvv1+rVq1S\nampqqMsBEKboJQB6C/0k8rE1Czp06JBuvPFGvfDCCxo7dmyoywEQpuglAHoL/WRgIIhAzz33nI4c\nOaIHH3wweFPY2rVrQ10WgDBDLwHQW+gnA4OxLKvbFxcVFVlbt27tw3IA9IQx5kPLsopCXUdP0UuA\n/od+AqC3dLefsCICAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDtCCIAAAAAbMcDDQc4y7K0YfMx\nfbS9RcZI06cNVtGUQTLGhLo0AGGmoyOgt/7coMpqt+LjnZo7J1nZI3gSMoCeO3LUozdWNejYca+G\nD4vRtXNTlZDgDHVZ6GUEkQFs3YZm3bNoj440eOXzBSQZOZ3SiIwY/ebpCSqaMjjUJQIIA5Zl6cmn\nq/SjxyokS+rwBORyGn3jEWn2ZUn69VMTlJIcFeoyAYSB1la/Hvj6Xr3+xlG5nJLXZyk62qEHFu/V\novuy9INv58nhYLI0UrA1a4B674MmLbhluyoq3Wpt9aujw1JHR0BtbQHtP9Cuq2/4SFu2HQ91mQDC\nwPf/7aAe/Wm5Tpzw60SLXx6Ppbb2gDo6AnrnvSZdcvVWNR/zhrpMAP2c2+3XlQu26Q9vHFFHR0Ct\nbQF5PJZaWvxqaw/oF89W655Fe9STZ+ChfyOIDECBgKU779uttvbAOa9pawvofz2wm292AOe1/0Cb\nnnymWm1tnfcTj9dSbW2HfvrEJzZXBiDc/Pr5Gu3d3yZ3R+djj7a2gFa8cUTrNhyzuTL0FYLIALTm\nvSa1tPq7vK72cIc2f8iqCHAhSkpKdMkllyg+Pl433XRTqMvpM794tlp+3/knLDo8lp57vkYez7kn\nPwCc20DoJ5Zl6fGnqtR+nklSSWpvD+jnv6y0qSr0NYLIALR56zG1diOIeH2WNm8liAAXIj09XY8/\n/rieeOKJUJfSJ3w+n6qqqvTW6hp5uwgikmQFpPJP2m2oDIg8kd5P2tvb9VHJPtXVubu81rKkDZub\nbaiq/8rNzdXOnTtDXUav4Gb1ASgQsNSdHVeBQEAtrW19XxAQxpYsWaKKigo99dRTkqS6ujoVFhaq\nvLxcmZmZ2rNnT4gr7D3Hjh1TVVWVqqqqVFNTI7/fL3d7jqSYLl8bCPjldnskJfR5nUC4Gij9xLIs\n1dfXB/vJkSNH1NbukGWNlNT1jehtbW6tWLFC48ePV15enqKiOAwjXLEiMgBNuXiwEhO7PgLP4Qio\n8cgWrVu3Tu3tzGQCnbn77rv16quvqqWlRZL07LPP6rbbblN8fHyIK/v8fD6fKisr9cEHH+h3v/ud\nli9frvXr16u0tFSVlZX6+OOPlRBXKWO63nLl8wW0edNK7dy5U4EAW7SAzkRyP2lra9O+ffu0Zs0a\nPf/883r99de1detWlZWVqaKiQnt2b5XL1dGNzxRQbPQhrVixQitWrNCyZcv03nvv6fDhwz2uyRij\nH//4x5o+fbry8vL06quvBj+2adMmzZ49W9OmTdO0adP0xhtvSJK+/e1va8mSJZKkl19+WQ6HQ/X1\n9ZKk+fPna/Xq1ef8enfddZfuv/9+ffGLX9SYMWN0xx13BO/Fraur05e+9CUVFhaqoKBAzz//fPB1\n77//vgoKClRQUKBFixadcf9uaWmp5s2bp+nTp+viiy/Wb37zmx7/PYQSKyID0DVXJis6qusZB5fD\nrbjo/dq5s0X79+/XlClTVFBQIKeTc7yBTyUnJ2vBggVatmyZ7r33Xi1dulRr1qwJdVmfS01NjUpK\nSlRbWyu/3y+/36/m5mY1NTWpsbFRlmVp6NChysjI0I3XOfUfz0ne8xyK5TB+jcw+qMaGJq1fv167\ndu3SzJkzlZuba9t7AsJBJPaTnTt3at++fTp69KgkyePxqLGxUU1NTWpublZMTIyGDh2q0aNH6crL\nW7Tq3Rj5fOeeJ3cYr5Li/6y9ew+qoqJCWVlZamxsVGlpqYYMGaL8/HyNHTu22+Ft8ODB2rJliz74\n4APdfPPNuvHGG9Xc3Kz7779fb775pjIyMlRbW6vp06dr586dmjNnjh577DE9/PDDWrNmjWbNmqV3\n3nlHN954ozZt2qRLL720y7+Pt99+Ww6HQ1OmTNHbb7+tq666Sl/72tc0adIkvfbaa6qtrdW0adM0\ndepUjRkzRrfeeqtefPFFXXHFFXr55ZeDK2Y+n0+33XabXnzxRY0bN04nTpxQUVGRiouLNW7cuG7+\nHwotgsgA5HI5tPQ/x+sf7t11zpvCoqIC+vsv1aq5uUm1tTUaOXKkvF6vdu/erZkzZ2rUqFE2Vw30\nXw899JBuv/12paena/z48RozZkyoS/pcvF6vSktL1dTUpKamJh0/flyDBg3S0KFDNXHiRCUknNxe\nlZiYqOzsbFUejtUf/9TW6Ul8DoelhHhL117VrLKyMsXFxWnkyJFavXq1MjIyVFxcrNTUVLvfItBv\nRVo/aWxs1IEDB4Lho6OjQ0lJSUpOTtaoUaMUHR0tSUpNTdWMmVnavd+jQzU+ebyf3UPucvk1PLVB\nednH1NzskGVZOnTokA4ePKicnBwVFBTo2LFjcrlcmjRpUrfqu/XWWyVJs2bNUk1Njdxut9avX6/y\n8nLNmzcveJ0xRmVlZbrkkkt0yy23yOPx6IMPPtBjjz2m3//+9xoxYoQmTZrUZQC64YYbFBt78kGv\nU6dO1YEDB3TVVVfp7bff1s9+9jNJUkZGhubPn6+1a9cqEAgoPj5eV1xxhSTp5ptv1sKFCyVJ+/bt\n0549e4LvQZI6Ojq0Z88eggj6t7+dm6plz07Uwq/tkddr6UTLyZvXExOdiot16Cc/SJHTOqLjxyep\nsbFR5eXlOnTokEaNGqU1a9bo448/VnFxsYYNGxbidwKEXkFBgVJSUrR48eLgTFW48Xq9OnTokKqq\nqlReXq7du3crKSlJGRkZmjBhgpxOpxwOhzIyMpSdna3s7GwNHTpUknTJJZa+88MD+uVzh+QwUlt7\nQE6nFB3t0Lgx8Xr0W04dqk5TdtZg1dbWaseOHUpLS5PH41Ftba3Gjh2r6dOnBwMOMJBFQj9pbW0N\n3v+xfft2HThwQMnJyRo9erQSExPlcDgUExOjrKysYD+Ji4uTJK1b7dXt9+zUxi3H5fdb8notxcY4\nZEm6cUGqbv2SU3t2X63q6mrt3r1bTU1NGjJkiE6cOKE///nPSklJ0cSJE9Xa2tqtnvJpKPh0t4fP\n55NlWSosLNRf/vKXTl9TWFiol156SRkZGZo9e7a+8Y1vKCsrS3PmzOn21/v0a/p8vi5fczZjTu5q\nsSxLqampKikp6fHn6C8IIgPYtdekqnL3JXpzdYM+LDkhSZpVNFhXz0mR02kUCORr165d2rZtm5KS\nklRXV6edO3dq6NCh6ujoUH19vcaNG6fLL788xO8ECL177rlHjzzyiK699lpJUkVFhS699FK1tbXJ\n7XYrKytLjz76qO6+++4QV/pXjY2NZ9wsmp6eruzsbC1YsEDJycmqqanRoEGDggOFzMzMTm8KdTiM\nfvz90fqXxRfplRX1Kq9o16BEl669JlUFExMlSe3t47V161Y5nU6lp6ersrJSH374obKyshQIBHTw\n4EFddtllYT/7C/SGcOsngUBAhw8fDvaTtrY2ZWVlKTc3VzNnztTLL7+sQCCgtLQ0ZWdnKycnR2lp\nacEB9elSkqP0p/+ZorIDbXrtj0fU1OzViIxY/d2X0pWednL1ZMrkSdq4caNGjRqlmpoabd++XY2N\njUpJSVFKSopWrVql7du3a+TIkcrPz1dubq4cju7fFv2FL3xB+/fv19q1azV79mxJ0pYtW1RUVCRj\njObMmaPvf//7uv/++4OB6re//a1efPHFC/47vPLKK7V06VI9+uijOnz4sN5880390z/9k0aPHq32\n9na9//77uuyyy/T73/9ezc0nTw3Lz89XfHy8li1bpq985SuSpL179yozM1ODBw++4FrsRBAZ4Fwu\nhxbMT9OC+Wmf+ZjD4VBBQYHGjh2rbdu2adeuXUpLS1NVVZW2bdumjIwMTZ06NQRVA/3P2rVrtWjR\nouAPu9zcXFVXV4e4qjN5PJ7gqkdVVZUcDoeys7NVWFiozMxMuVx//ZEwa9YsuVwuJSUldfvzJw2J\n0r13juj0Y3Fxcbrssss0ceJEbdy4UVFRUcrMzFR5ebm2bt2qkSNHKjk5+XO/RyAShEM/aWlpOeMU\nvaSkJGVnZ+vyyy//TMi45pprlJqaesZqQFdGj4rXw/94UacfS0tL03XXXaeKigpt3LhRWVlZqqur\n044dO+T1epWVlaU777xTlZWV2r17t9atW6cxY8YoPz+/W31m6NCh+sMf/qCHH35YixcvlsfjUV5e\nnlauXBkMIt/97neDKyBz5szR+vXrNWPGjG6/v7M9+eSTuu+++1RYWCjLsvSTn/xEEydOlCS99NJL\n+upXvypjjC6//HLl5ORIklwul1auXKnFixdryZIl8vv9GjZsmF5++eULrsNupidPzi4qKrK2bt3a\nh+WgPzt27Jg2bdqkiooKud1u1dfXa+zYsZo5c6bGjh3b6cwG+pYx5kPLsopCXUdPRVIvqamp0ezZ\nszV8+HC99dZb/e50m4aGBlVVVamyslINDQ0aPnx4cIVjyJAhIaurqqpKGzduVFNTk44dOya3262C\nggK2fIYQ/ST0+nM/8fv9qq2tVXV1tSorK+V2u4O9JCsrq0chozcFAoHg7o329nbV1dVp0KBBmjp1\nanDL5/Hjx7Vv3z6VlpYqPj5e+fn5Gj16dPD+FPS+7vYTggh6rLa2Vhs2bNDkyZOVmJioDRs2yOfz\nqbi4WJmZmaEub0Bh4ICzdXR06NChQ6qsrFR1dbWioqKCg4WMjIwzVj1CLRAIqLS0VNu3b9d1112n\nmpoabd68WcOHD9eMGTM0aNCgUJc4oNBPcLbjx48HVz1qa2uVnJwc7Cepqan9agKyo6ND27ZtU0ND\ng66++mqVlJRoz549mjRpki6++GK5XK7gze179+5VdXW1cnJyNG7cOGVkZPSr9xIJCCLoU5ZlnfFN\ne/DgQW3atEnJycmaOXNmj7Zz4MIxcIBlWWpoaFBlZaWqqqrU2Nh4xg3l4bBP+PR+4vP5tGPHDn38\n8ccaN26cpkyZwqylTegn8Pl8qq2tDYYPj8dzxqpHTEzXDy8NtdP7SUtLizZv3qza2loVFRWdsXvD\n7XarrKxMe/fuldfrDR77m5iY+Lm+fklJie66667P/PmiRYt0zz33fK7PHU4IIrCd3+/Xrl27VFJS\nolGjRmnatGkhW6odKBg4DExut1vV1dWqqqpSdXW1YmJizlj1iIRn/bS1tWnr1q365JNPNG3aNI0b\nN65HN5ui5+gnA9OxY8eCwePw4cNKSUkJ9pOUlJSIWCmor68/7+6No0ePqrS0VGVlZUpLSwve4B4J\nvTRUCCIIGbfbrQ8//FAHDhzQ5MmTNXHiRNu+mZcsWaKKiorgkYd1dXUqLCxUeXl5v9pr21sYOAwM\nlmXpyJEjwcFCc3PzGasekbyFqaGhQRs3blRra6tmzZoVvEnTDvST8EA/6Rmfz6eamppgP/H5fGes\nekTyCmRXuzf8fr/Ky8tVWlqqhoYGjRo1Svn5+b3yrCP6yTmuI4igrzQ3N2vjxo1qbm7WjBkzlJeX\n1+dfs7GxURMmTFBZWZkSExP1wx/+UI2NjXriiSf6/GuHAgOH/ue4FdBrvjbtsryKltHlzhh90REr\nVw9nFd1ud3CgUF1drbi4uOBgYfjw4QNupq6yslIbN25UQkKCiouLbTlhi34SHiK5n1QEfPofX5tq\n5FeKHLrOFadJjp4Hhebm5mA/qaurU2pqavAY3YF2Wt3puzdGjx6tqVOndrp748SJE8Eb3GNiYoI3\nuF/oTg/6yTmuI4igrx06dCh4XOesWbOUnp7ep19v4cKFmjJliu69917l5eVpzZo1EftsAgYO/Ydl\nWfqVr0W/8J2QQ0btOtlbE2QULekX0cma6Tz3/mrLslRfXx8cLBw7dkyZmZnB8PF59y1HgkAgoD17\n9mjbtm266KKLVFRU1OczifST/i8S+0mrFdBiT5PWBzrkl+ST5JAUIynPRGlpTLLSzbknI7xe7xmr\nHoFAIBg8MjMzI3rVo7u6u3vDsizV1NSotLRUlZWVys7OVn5+vkaMGNGtbWtWwFLdnia5j3v0vZ9/\nS7P+ZoYWLlxIPzml/xyfgog1YsQIffnLX9a+ffu0evVqZWZmasaMGX02sHrooYd0++23Kz09XePH\nj4/Yb3L0L0/7WvS0r0UdkqS/TvC0ylKrpLs9DXohJlWTT5vNbG9vP2PVIyEhQdnZ2Zo5c6aGDx/O\nPRFncTgcmjhxosaMGaOPPvpIr7zyigoKClRYWNhnp4HRT2A3n2Xpzo4G7bG8p/rJSQFJ7ZJKLa9u\nch/VH2PTNNj8tUc0NTUF+0l9fb3S0tKUk5OjuXPnDrhVj+6IjY3VJZdcEny20e7duzVz5kyNHDny\njOuMMRoxYoRGjBihjo4OHThwQJs3b5bb7dbYsWM1duzYTg8FsSxL2/57vz54epc8rT45nEZpJybp\n3978d3kOOegnp7AiAlt5vV5t375du3bt0oQJEzR58uROn9T8ec2ePVtlZWV66qmntGDBgl7//P0F\nM5j9Q5MV0KXuw2cMGjozwbj0bHMgOFg4fvy4RowYEVz1SEhIsKXeSHH8+HFt3rxZ9fX1mj59ukaP\nHt0nN9bST/q3SOsnq/ztetjTrDade3wWI+k+E68Fh/+65UqScnJylJ2drczMzD752RrJTt+9UVxc\nrLS0zz7o+XQNDQ3BG9yTk5M1btw45ebmBo8JfvP/bNaeNz+Rt91/xuuWVv1Ijb46ffvu7+ubTz/U\nl28ppNiahX6ttbVVW7ZsUXV1taZNm6b8/Pxenf198cUX9cgjj6i8vDyiZ5UZOPQPz3lP6Oe+E3J3\ncZ3L59c/rv9Y04amKicnR+np6RH979Muhw8f1saNGxUIBFRcXKyMjIxe/fz0k/4t0vrJTe4jKrG8\nXV4X7/bo/27YrZxTExkcm//5WZalffv2acuWLd3eveH3+/XJJ5+otLRU9fX1GjVqlGLqhuq9H+76\nTAiRpJLj67T66Mv61vj/1J0vXa3hEyNztYqtWejXEhISdMUVV+jo0aPasGGDdu3apVmzZikrK6tX\nPv/atWu1aNGiiB40oP/YEfB2GUIkKcbpVM6c2ZrhiuvzmgaS4cOH6/rrr9eBAwe0du1apaamatas\nWb32DBX6Cex0wPJ16zpPbLT+Zt41SjT8u+wtxhjl5+crLy9P27dv16uvvtrl7g2n06m8vDzl5eWp\npaVF+/fv1ztP7ZC3vfOvcbBtt2YlXSXLK236f3t1/c++0IfvqP/jXy9CKjU1Vdddd52Kioq0bt06\nvfXWW2pqarrgz1dTU6P8/Hzt379fDz74YC9WCpybs5vbgYwxcoX/kfz9kjFGo0eP1s0336z09HSt\nWLFCGzZsUEdHVxvmzo1+glDo7sDMkuQSDaUvREVFqaioSDfddJNaW1u1fPly7d27V13tIkpMTFTh\npIvlrf3sx477mvR4+Td01HtYs5KulhWwdPD9Ti4cYFgRQb+Qm5urnJwc7d69WytXrlReXp6mTZum\nuLiezRxnZmaqtLS0j6oEOne5I0bv+N1qPc+ebknyyNKUCzh6E93ncrk0efJk5efna+vWrVq+fLmm\nTp2qCRMm9HhFg36CUJjuiNGagLuLbiLlGKdiI+Bhg/3Z2bs3du7c2eXuDb83IBkjnfV/cLBrqL4+\n8mefvXaAY0UE/YbD4dCkSZN0yy23yOl06pVXXlFJSYn8/s/usQT6k/nOuC7nJZ2SLnHEnPfITfSe\nuLg4XXbZZbr22mtVVVWlV155RRUVFaEuC+jSva4EdfWkijhJ97ki90Gm/U1Pdm9ExTkVHd+9ef4h\nmZH3IMOeIoig34mJiVFxcbGuv/561dfXa/ny5Tpw4ECoywLOKcYYPRE99JyDB6ekIXLoX6O5mdRu\nycnJmjdvnr7whS9oy5YtWrlypY4ePRrqsoBzmuaM0Zed8TrX9EaspCmOaN3g5F4zu+Xm5urmm29W\ndna2Vq5cqXXr1qm9/cybQYwxmnrbGDmjzz/Ejopzaub/Ht+X5YYFggj6rSFDhujqq6/W7NmztX37\ndq1YsUJ1dXWhLgvo1GxnrJZGp2ikcSpORvEywYcZFjti9HpsmjJYDQmZ7Oxs3XjjjRo9erT+9Kc/\n6d1331Vra2uoywI69YOoIfqaa5AGyyjxVD9JlFGcjG51JujX0SlysS0rJLqze2P6nfknV0XO8b/I\n4TJKSIvT+L/Nsanq/ovjexEWLMtSWVmZNm/erGHDhmnmzJkaNOizy9J79+7VlVddpef+8o4yLrpI\ny//1xzq4d69+97vfhaDqvsdxm/2PZVnaaXlVFvDJKWm6M4YA0s94PB6VlJRoz549mjhxoi6++OJz\nnohTZ/l1KOBXrDEaa1wRPfijn/Q/XsvS+kCHjloBDTZGlzhiFM8pWf3KsWPHtGnTJjU0NGjGjBka\nNWqUJKmh/LheuusddZzwytN66iQ0IznjXEocEa87fvNFJaZF7qoWzxFBRPL5fNqxY4c+/vhjjRs3\nTlOmTFF09Mmbfxssvx7zntCyZc+r6Zn/0vDv/rOqv/Ed3bv+HX0nJUvDI3AwyMABuHAtLS3avHmz\nampqNH36dI0dOzb4QMTtAY/+3XtcJQGPomUU0MnTXe5yJep+V6KiIjCQ0E+AC1dbW6sNGzbI4XCo\nuLhYw4YNU8AXUNl7NVr1+/2qamzX8WHROnhTpmqKhijLEaWvRw3S1RG6xY4ggojW1tamrVu36pNP\nPtHUqVOVPG6svuxpUJMC8kmqX7hYLa+u1Ig/v6b4qYUaLKPXYtKU5Yisg+IYOACfX319vTZs2CCf\nz6fi4mLtH5asBz1N6uzcolhJhY5o/Vd0SsSFEfoJ8Pl0tnvjP2ICWu5vU3un/cToIVei7ouKvIMH\nuttPWN9DWIqPj9fll1+u+fPnq6KiQl+pLVOj5ZdPkuXxyLN7nxxDhshXf0R+Scdk6UFPY6jLBtAP\npaen6/rrr9eUKVO06oN1eqD9SKchRJLcknYEPHrG12JvkQD6PWOMxowZo1tuuUXJycla8sF7eslz\notMQIkluWfpPX4t2Bjw2V9p/EEQQ1lJSUjRx3lzVJA+W/9TsZMMjP1LMlAJl/vElHf3at+SrrlFA\nJ59WuzdW87Y0AAAJ3klEQVTgDW3BAPqtvLw8mQXXyHSxB98t6be+Fvl6sKMAwMDhcrk0depU7bt8\nujqc5+8nHln69QCe2CCIIOz9JeAO7utu/cOf1P7+eqUseVTRE/I19JGvq+6uB2X5fPJKetfvDm2x\nAPq1t+RRh6PrLVdeSfssX98XBCAsBSxL20zXz0ELSFrr7+j7gvopggjCntuy9Om3esKCa5S96W05\nYk8+0WHwXX+vEW+/JuNyyX/qWgA4l3are086doh+AuDcejJN4T3H1q2BgCCCsJfjcCmmy+daS/Ey\nyomwm9UB9K5RDle3fjB6ZGmEI/JO4gPQO6KN0aBujE0kaVgEnurZXQQRhL3Zjthufatbkq5xnuvZ\n1wAg3eFK7NbExhRH9IAePADo2u3OBEV3cU2cpP/tTLCjnH6JIIKwF2OMvu4apPOdxB0n6QFXIg+C\nAnBek02UJjuiFHOea2Jl9C9Rg22rCUB4ujMqQfEy55zacEgaIoducMXbWVa/wqgMEeGOqETd5xqk\nGEmnPx85SlKMpDucCXrAlRia4gCEDWOMnolO1lRHtOJkzvghGaeTWzx/GT1UhY6u5jkBDHQpxqnl\nMalKlUMJZ8WRBBmNME69HJOqxAE8ScqGeUSMRVGD9GVnvF7wtWhjwKP6I/WaNyxLd7gSlM29IQC6\nKd449Hx0irZbXj3va9WBgFexxuhaR5xucMVr0AAeNADomVGOKP0ldpj+HHBrua9VTVZA6cap21wJ\n+htHjJwR9mDUnmJ0hoiS6XDqX6KHSJKefes1LVy4MMQVAQhHxhhNNtGaHM3KB4DPJ8oYzXfGab7z\nfJvIByaCCCJKR71bNc+Xq+mDI8qqGaIDjbuUdWeeYjL45gcAAOhPCCKIGJVP71f5T3fLkmR1BBSn\naFX/qkzVvypTzqKxyv3GuOCDDwEAABBabHRFRDi0rFzlS/Yo0BGQ1fHXB5IFOgIKdARU+cv9qvpV\nWQgrBAAAwOkIIgh7AU9AB364U4F2/7mvafer/LE98rf15FmnAAAA6CsEEYS9hrcPn3xaYReMkY68\nUdP3BQEAAKBLBBGEvbbyFgXc514N+ZS/1a+28hYbKgIAAEBXCCIIe84Yp4yzGzehO42csc6+LwgA\nAABdIogg7CVfkS51I4c4oh1Knj2s7wsCAABAlwgiCHvxowcpcVKSdL5VEYcUNzJBgwqS7CsMAAAA\n50QQQUSY+PR0RSVFdR5GHJJrcJQmPTfT/sIAAADQKYIIIkJsVrymv/1FpS8YIUeMQ87BLjkHu+SI\ncShtfqamr/6i4kcmhrpMAAAAnMKT1RExYobHaeIvp8vb7FHrnuOSpIT8QYpKjglxZQAAADgbQQQR\nJyopWknFqaEuAwAAAOfB1iwAAAAAtiOIAAAAALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4IIAAAA\nANsRRAAgwi1dulSFhYUqKChQYWGhXnjhhVCXBCBM0U/Qm3iOCABEuDFjxujdd99VcnKyqqurNXny\nZF166aXKzc0NdWkAwgz9BL2JFREAiBBLlizRgw8+GPx9XV2dhg0bphkzZig5OVmSlJWVpYyMDFVX\nV4eqTABhgH4COxBEACBC3H333Xr11VfV0tIiSXr22Wd12223KT4+PnjNu+++q+bmZk2bNi1UZQII\nA/QT2IEgAgARIjk5WQsWLNCyZcvk8/m0dOlSffWrXw1+fPfu3brjjjv00ksvKS4uLoSVAujv6Cew\nA/eIAEAEeeihh3T77bcrPT1d48eP15gxYyRJ+/fv1/z58/XMM8/o0ksvDXGVAMIB/QR9jRURAIgg\nBQUFSklJ0eLFi4P7uw8ePKi5c+fqySef1Lx580JcIYBwQT9BXyOIAECEueeee+RwOHTttddKkr75\nzW+qoaFB3/ve9zR58mRNnjxZq1atCnGVAMIB/QR9ia1ZABBh1q5dq0WLFsnhODnX9Morr4S4IgDh\nin6CvsSKCABEiJqaGuXn52v//v1nHLsJAD1FP4EdWBEBgAiRmZmp0tLSUJcBIALQT2AHVkQAAAAA\n2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdN6sDQATaEfDoOW+L3gt0yCNL6capu5wJuskVr0GGOSgA\n3eO3LK0OuPWst0X7LK8kabyJ0sKoRM1xxMppTIgrRDgjiABAhPmV94R+4WuRR5YCp/7skOXX474T\nWupr0csxqcpy0P4BnF+HZeluT4N2BLxqkxX88xLLq3/2NGuaI1rPRCcrmjCCC8S0GABEkNX+dv3C\n1yL3aSHkU+2ydFQB3e5pkM+yOn09AHzqO95mfRTwnBFCPtUmS1sCHXrUeywElSFSEEQAIII84T0h\ndyeDhk8FJDVbAa0NuO0rCkDYabD8esPfro7zXOOWtMLfpmPW2dMeQPcQRAAgQlQGfKqyfF1e1ypL\n/+1rs6EiAOHqTb+7W4NEp4xW+dv7vB5EJoIIAESIBgUUpe7t1T5i+fu4GgDhrNHyqzvrph2y1MCK\nCC4QQQQAIkSSHPKeZ1vW6ZI5OQvAeSQZh2K6cV20jIbST3CB+JcDABEi1zg1zDi7vC5BRrc4E2yo\nCEC4muuM69Z1flm6yhnbx9UgUhFEACBCGGP0j65BOt/wwehkEGHgAOB8hhunrnDEnndVJFbSPGec\nUroxAQJ0hiACABFkgSte/+BMUFwn94pESxoio2UxKZz7D6BLS6KTNNZEddpP4iRNMFH6t6gk+wtD\nxCCIAECE+Wb0ED0bnaxLHTFy6uQqyFAZLXQlalVsukY5okJdIoAwEG8cWh6Tqu9GDdZI45TRyX4y\nyrj0g6gkvRiTqlgmNfA58GhdAIhAxc4YFTtjZFmW/JJcDBYAXIBoY3SzK0E3uxIUOPUgVAf9BL2E\nIAIAEcwYQ6MH0CsIIOhtbM0CAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAA\nALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gA\nAAAAsB1BBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYj\niAAAAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAA\ntiOIAAAAALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO2NZVvcvNuaIpE/6rhwAPXSRZVlpoS6ip+gl\nQL9EPwHQW7rVT3oURAAAAACgN7A1CwAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiO\nIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAAgO3+PzTxBVMYYy3tAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f15c52e5ac8>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'y': 'a1', 'x': 'c', 'z': 'a_b_d'}, {'y': '478', 'x': 'c', 'z': 'a_b_d'}, {'y': 'a_clone', 'x': 'c', 'z': 'a_b_d'}, {'y': 'e', 'x': 'a_clone', 'z': 'a_b_d'}, {'y': 'e', 'x': '478', 'z': 'a_b_d'}, {'y': 'e', 'x': 'a1', 'z': 'a_b_d'}]\n"
     ]
    }
   ],
   "source": [
    "instances = g.find_matching(pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Rewriting rule to Cypher: \n",
      "\n",
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_x:node { id : 'c'}), (lhs_z:node { id : 'a_b_d'}), (lhs_y:node { id : 'a1'}) , (lhs_y)-[lhs_y_lhs_x:edge]->(lhs_x), (lhs_y)-[lhs_y_lhs_z:edge]->(lhs_z), (lhs_z)-[lhs_z_lhs_z:edge]->(lhs_z)\n",
      "\n",
      "// Cloning node 'y' of the lhs \n",
      "// Create clone corresponding to 'y2' of the preserved part\n",
      "// create a node corresponding to the clone\n",
      "CREATE (p_y2:node) \n",
      "WITH p_y2, toString(id(p_y2)) as p_y2_id, lhs_y.id as original_old, lhs_z_lhs_z, lhs_y_lhs_x, lhs_y, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "// set the id property of the original node to NULL\n",
      "SET lhs_y.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET p_y2 = lhs_y\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET p_y2.id = toString(id(p_y2)), p_y2.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET lhs_y.id = original_old\n",
      "WITH p_y2, toString(id(p_y2)) as p_y2_id, lhs_z_lhs_z, lhs_y_lhs_x, lhs_y, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "WITH ['a_b_d'] as sucIgnore, [] as predIgnore, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_y)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(lhs_y) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, suc_maps, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_y2)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(p_y2) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = lhs_y THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (p_y2)-[new_edge:edge]->(p_y2) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "OPTIONAL MATCH (lhs_y)-[out_typ_edge:typing]->(suc_typ:node)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "OPTIONAL MATCH (pred_typ:node)-[in_typ_edge:typing]->(lhs_y) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, lhs_x, suc_typ_maps, lhs_y_lhs_z, lhs_z \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_y2)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(p_y2) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "\n",
      "// Create clone corresponding to 'y1' of the preserved part\n",
      "// create a node corresponding to the clone\n",
      "CREATE (p_y1:node) \n",
      "WITH p_y1, toString(id(p_y1)) as p_y1_id, lhs_y.id as original_old, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "// set the id property of the original node to NULL\n",
      "SET lhs_y.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET p_y1 = lhs_y\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET p_y1.id = toString(id(p_y1)), p_y1.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET lhs_y.id = original_old\n",
      "WITH p_y1, toString(id(p_y1)) as p_y1_id, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y2_id, lhs_x, lhs_y_lhs_z, lhs_z \n",
      "WITH [] as sucIgnore, [] as predIgnore, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y1_id, p_y2_id, lhs_x, p_y1, lhs_y_lhs_z, lhs_z \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_y)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y1_id, p_y2_id, lhs_x, p_y1, lhs_y_lhs_z, lhs_z \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(lhs_y) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y1_id, p_y2_id, suc_maps, lhs_x, p_y1, lhs_y_lhs_z, lhs_z \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_y1)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(p_y1) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = lhs_y THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (p_y1)-[new_edge:edge]->(p_y1) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y1_id, p_y2_id, lhs_x, p_y1, lhs_y_lhs_z, lhs_z \n",
      "OPTIONAL MATCH (lhs_y)-[out_typ_edge:typing]->(suc_typ:node)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y1_id, p_y2_id, lhs_x, p_y1, lhs_y_lhs_z, lhs_z \n",
      "OPTIONAL MATCH (pred_typ:node)-[in_typ_edge:typing]->(lhs_y) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y1_id, p_y2_id, lhs_x, suc_typ_maps, p_y1, lhs_y_lhs_z, lhs_z \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_y1)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(p_y1) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y1_id, p_y2_id, lhs_x, p_y1, lhs_y_lhs_z, lhs_z \n",
      "\n",
      "// Removing node 'x' of the lhs \n",
      "DETACH DELETE lhs_x\n",
      "\n",
      "WITH lhs_z_lhs_z, p_y2, lhs_y_lhs_x, lhs_y, p_y1_id, p_y2_id, p_y1, lhs_y_lhs_z, lhs_z // Renaming vars to correspond to the vars of P\n",
      "WITH lhs_z_lhs_z, p_y2, lhs_y_lhs_x, p_y1_id, p_y2_id, p_y1, lhs_y_lhs_z , lhs_z as p_z, lhs_y as p_y \n",
      "\n",
      "// Adding node 'new_node' from the rhs \n",
      "CREATE (rhs_new_node:node) \n",
      "SET rhs_new_node.id = toString(id(rhs_new_node)) \n",
      "WITH toString(id(rhs_new_node)) as rhs_new_node_id , lhs_z_lhs_z, p_y2, lhs_y_lhs_x, p_y, p_y1_id, p_z, p_y2_id, rhs_new_node, p_y1, lhs_y_lhs_z\n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH lhs_z_lhs_z, lhs_y_lhs_x, p_y1_id, p_y2_id, rhs_new_node, lhs_y_lhs_z, rhs_new_node_id , p_z as rhs_z, p_y1 as rhs_y1, p_y2 as rhs_y2, p_y as rhs_y \n",
      "\n",
      "// Adding properties to the node 'new_node' from the rhs \n",
      "// Adding edge 'new_node->z' from the rhs \n",
      "MERGE (rhs_new_node)-[rhs_new_node_rhs_z:edge {  }]->(rhs_z)\n",
      "\n",
      "\n",
      "// Return statement \n",
      "RETURN lhs_z_lhs_z, lhs_y_lhs_x, p_y1_id, rhs_z, p_y2_id, rhs_y1, rhs_y, rhs_new_node, lhs_y_lhs_z, rhs_new_node_id, rhs_y2\n",
      "\n",
      "\n",
      "\n",
      "Rewriting rule to commands: \n",
      "\n",
      "CLONE y AS y2.\n",
      "CLONE y AS y1.\n",
      "DELETE_NODE x.\n",
      "DELETE_EDGE y2 z.\n",
      "ADD_NODE new_node {}.\n",
      "ADD_EDGE new_node z {}.\n",
      "ADD_NODE_ATTRS new_node {}.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g = g.rewrite(rule, instances[0])\n",
    "print(\"\\n\\nRewriting rule to commands: \\n\")\n",
    "print(rule.to_commands())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'new_node': '482', 'y': 'a1', 'y1': '481', 'y2': '480', 'z': 'a_b_d'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rhs_g"
   ]
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python [default]",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
