{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Examples of utils provided by ReGraph's Neo4jHierarchy module"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "from regraph import Rule, plot_rule\n",
    "\n",
    "\n",
    "from regraph.neo4j.hierarchy import Neo4jHierarchy\n",
    "import regraph.neo4j.cypher_utils as cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Initializing Neo4j database\n",
    "\n",
    "0. When installing neo4j you will be asked to choose login/password for you dbs (here its \"neo4j\"/\"admin\"), if you choose other -- change in the cell below.\n",
    "1. To start neo4j server run `sudo service neo4j start`\n",
    "2. Check status by running `sudo service neo4j status`. Here you can check the _bolt_ port, change the cell below if different from 7687\n",
    "3. You can query the db by using the neo4j browser, the address can be found also in the result of 'status', e.g. \"Remote interface available at http://localhost:7474/\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7fd05df296a0>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# initialize the neo4j driver, wrappped into Neo4jHierarchy object\n",
    "h = Neo4jHierarchy(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"admin\")\n",
    "h.clear()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Hierarchy\n",
    "\n",
    "A hierarchy is represented by at least 2 graphs with a typing relation (homorphism) between them.\n",
    "\n",
    "\n",
    "Each graph in the database is represented by a unique label which enables us to match quickly the nodes of this graph. Each node of a graph has then the labels *node* and *graphLabel*. We can match these nodes by using the query:\n",
    "\n",
    "> MATCH (n:node:graphLabel) RETURN n\n",
    "\n",
    "\n",
    "The edges of a graph are labeled as *edge* and the typing edges are labeled as *typing*. We can then easily find the image of a node with the query:\n",
    "\n",
    "> OPTIONAL MATCH (n:node:graphLabel)-[:typing]->(m) RETURN m\n",
    "\n",
    "The hierarchy skeleton is represented by nodes labeled as hierarchyNodes. It enables us to know which graphs are the ancestors of a graph we want to rewrite for example."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Adding a graph to the hierarchy (Action Graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Here we create a first graph called *ActionGraph*. This graph represent people and the relationship between them."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "nodes = [\n",
    "    (\"a\", {\"name\": {\"Jack\"}, \"age\": {43}, \"hobby\": {\"hiking\", \"music\"}}), \n",
    "    (\"b\", {\"name\": {\"Robert\"}, \"age\": {35}, \"hobby\": {\"sport\", \"music\"}}),\n",
    "    (\"c\", {\"name\":{ \"Paul\"}, \"age\": {18}}),\n",
    "    (\"d\", {\"name\": {\"Joe\"}, \"age\": {12}}),\n",
    "    (\"e\", {\"name\": {\"Paul\"}, \"age\": {18}})\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"b\", {\"type\": {\"friends\"}}), \n",
    "    (\"a\", \"c\", {\"type\": {\"colleagues\"}}),\n",
    "    (\"b\", \"c\", {\"type\": {\"colleagues\"}}),\n",
    "    (\"d\", \"a\", {\"type\": {\"child_of\"}}), \n",
    "    (\"d\", \"e\", {\"type\": {\"enemies\"}}),\n",
    "    (\"e\", \"e\", {\"type\": {\"likes\"}})\n",
    "]\n",
    "h.add_graph('actionGraph', nodes, edges)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Adding a second graph to the herarchy (Meta Model)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Here we create a second graph called *MetaModel*. Which represent the types of people (*Adult* or *Child*) and the relationships between them."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "nodes = [\n",
    "    (\"a\", {\"type\": {\"Adult\"}, \"age\": {43, 35, 18}, \"name\": {\"Paul\", \"Jack\", \"Robert\"}, \"hobby\": {\"hiking\", \"music\", \"sport\"}}),\n",
    "    (\"b\", {\"type\": {\"Child\"}, \"age\": {12, 18}, \"name\": {\"Paul\", \"Joe\"}})\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"a\", {\"type\": {\"friends\", \"colleagues\"}}),\n",
    "    (\"b\", \"a\", {\"type\": {\"child_of\"}}),\n",
    "    (\"b\", \"b\", {\"type\": {\"friends\", \"enemies\"}})\n",
    "]\n",
    "h.add_graph('metaModel', nodes, edges)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Typing"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Here we create a typing of the *ActionGraph* by the *MetaModel*."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7fd05dcb3160>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mapping = {\n",
    "    \"a\":\"a\",\n",
    "    \"b\":\"a\",\n",
    "    \"c\":\"a\",\n",
    "    \"d\":\"b\",\n",
    "    \"e\":\"b\"\n",
    "}\n",
    "h.add_typing('actionGraph', 'metaModel', mapping)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "True\n"
     ]
    }
   ],
   "source": [
    "h.check_typing('actionGraph', 'metaModel')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Classic update functions"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We still can use the modification functions on these graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "#ag.merge_nodes1([\"b\", \"c\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true,
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "#ag.clone_node(\"e\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Graph rewriting and propagation up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", (\"y\",  {\"type\": {\"Child\"}, \"age\": {12, 18}, \"name\" : {\"Paul\", \"Joe\"}})])\n",
    "pattern.add_edges_from([(\"y\", \"x\",  {\"type\": {\"child_of\"}}), (\"y\", \"y\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "rule.inject_remove_node_attrs(\"y\",  {\"age\": {18}})\n",
    "rule.inject_remove_edge_attrs(\"y\", \"x\",  {\"type\": {\"child_of\"}})\n",
    "#rule.inject_remove_node(\"x\")\n",
    "#rule.inject_remove_edge(\"y\",\"y\")\n",
    "#rule.inject_clone_node(\"y\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAFTpJREFUeJzt3X2QXXWZJ/Dv73bnPSCvCRKUCCIhiI5IUJEdgcESJSJa\ni7VKqTBYs6NiKeXMuo7jy+66jqOUO1VbU+XKqviuuyLMwMyIurKg7joSCApIEIRRQ0xIIFE66U5y\n7z37R3co7O2ETjg5N/f251OVIk2fW/VA3d9zn+85v3NuqaoqAAAATWr1ugAAAGDmEUQAAIDGCSIA\nAEDjBBEAAKBxgggAANA4QQQAAGicIAIAADROEBkgpZR/KaWcO+nfnVVKWTvFsf+7lPLWJ/z8F6WU\nB0spI6WUtaWUrzdRM9CfJvrN6ETP2FBKubqUsrDXdQEHlkm9Yv0Te8XE3z8y6filpZSqlDI88fMx\npZRrSimbSim/LaXcVUq5pAf/KewHgggppbwlyZuSnFtV1cIkpyX5X72tCugDr57oGadmvG/8ZY/r\nAQ5Mu3rFHyR5QZL37cVrv5jk10mOTXJ4xueVDbVXSE8M97oADggrktxYVdUvkqSqqvVJPt3bkoB+\nUVXVQ6WUf0ry3F7XAhy4qqpaX0q5MeOBZLpWJLmiqqqtEz+vrr8yesUVEZLkR0neXEr581LKaaWU\noV4XBPSPUsozkrwqBgRgD0opxyR5ZZL79+JlP0ryt6WUf1NKeeb+qYxeEURmhqNLKVue+CfJmbt+\nWVXVl5K8M8krktyc5OFSynt7VCvQP66b6Cc/yHjv+GiP6wEOTNeVUh7L+Barh5N86Am/+7NJ88lP\nJ732oiTfT/KBJA+WUu4opaxopGr2O0FkZlhXVdUhT/yT8cHhcVVVfbmqqnOTHJLkT5P8p1LKK3pR\nLNA3LpzoKcdWVfX2qqpGe10QcEC6sKqqg5KclWRZkiOe8LsrJ80nz3viC6uq2lxV1b+vqurkJIuT\n3JHxYFMaqp39SBDh91RVtbOqqv+Z8TMS9nsDALWoqurmJFcnuXIfX79p4rVHJzmsvsroFUFk8Mwq\npczd9SfTeCBBKeWSUsr5pZSDSimtUsork5yc5J/3e7UAwEzyN0leXkp5/nQOLqX8dSnluaWU4VLK\nQUneluT+qqoe2a9V0ghPzRo8/zjp5x9O4zW/S/IXSb6UZCjJL5O8raqqH+zxVQAAe6Gqqo2llC8k\n+WCSx6bxkvlJrk3y9CSjGT9JesH+q5Amlaqqel0DAAAww9iaBQAANE4QAQAAGieIAAAAjRNEAACA\nxu3VU7OOOOKIaunSpfupFGBv3XbbbZuqqjqy13XsLb0EDjz6CVCX6faTvQoiS5cuzapVq/a9KqBW\npZRf9rqGfaGXwIFHPwHqMt1+YmsWAADQOEEEAABonCACAAA0ThABAAAaJ4gAAACNE0QAAIDGCSIA\nAEDjBBEAAKBxgggAANA4QQQAAGicIAIAADROEAEAABoniAAAAI0TRAAAgMYJIgAAQOMEEQAAoHGC\nCAAA0DhBBAAAaJwgAgAANE4QAQAAGieIAAAAjRNEJvnEJz6Rd7zjHY//vGHDhixevDjbtm3rYVVA\nv9FLgLroJwwqQWSSyy67LNdcc01GRkaSJJ/+9Kfzxje+MfPnz+9xZUA/0UuAuugnDCpBZJLDDjss\nF1xwQb74xS+m3W7nqquuytvf/vZelwX0Gb0EqIt+wqAa7nUBB6J3vvOdufjii7No0aKcdNJJOeGE\nE3pdEtCH9BKgLvoJg8gVkSmccsopOfzww/Pud7/79/ZkAuwNvQSoi37CIBJEduOtb31rWq1WVq5c\n2etSgD6mlwB10U8YNILIbtx00025/PLL02r5XwTsO70EqIt+wqDxTp5k3bp1OfHEE3Pfffe59Ans\nM70EqIt+wqBys/okRx99dO69995elwH0Ob0EqIt+wqByRQQAAGicIAIAADROEAEAABrnHpFJ1j9S\n5Xs/7mZka3L4IckfvaiVQw4qvS4L6DNVVeWuX1RZdXeVdic5bknJH76wZNawfgLsnZ3tKt+/vcov\n1lYZHkpOW17y3GeXlKKf0N8EkQkj26p84G/b+dGdVZJkx85k7pzkyi90svIPW/l3lwwZIIBpue9X\n3bz3b9rZ8Giyc2fS7Sbz5iatVvJnbx7Kq1821OsSgT5xwy2dfOLznXS7yejYeB+ZNStZdFjy8XcN\n54RjbW6hf3n3JhnbUeWyD+/Mj35aZcfO8RCSJGPbx//+D9/v5s//SzvdbtXbQoED3oMPVfnjD7Xz\ny9+M95BON6mSbBtLRrYlH/tsJ9/8XqfXZQJ94O9u6uSvPtPJyLbxHlJlvKeMbU9+9Zvkjz/czgNr\nzSb0L0EkyTe/28mvNyQ72lP/fvuOZNXdVf7vTy12YM/+81XtjI7t/vdjO5IrP9/JyDb9BNi9raNV\nPn51J2M7dn/M6Fjykat2M7xAH5jxQaSqqnzxH7rZvoeFniSj25MvXO8sJrB7Dz1c5e4HqjxZxGiV\n5B9/oJ8Au/dPP+zkyW4BqZLc82CVX29wYoP+NOODyNj25JEt0zt2zb9Y6MDurXmwyqxp3Hk3uj1Z\nvUY/AXbv9nuqjG5/8uNmDY/3HuhHMz6I7A23qgMAQD1mfBCZOyc58tDpHXvScaIIsHvLjyvZOY3t\n2vPmJC9crp8Au3fa8lbmzXny49rt8d4D/WjGB5FSSt60spW5s/d83Lw5yZtf7ZGbwO49/chdz/bf\n83FVlbzqTP0E2L1XvrT1pPeblSTLjy9ZskgQoT/N+CCSJK89ZyjHPj2ZPWvq38+dnbz4lJIXn2Kh\nA3v2/rcOZ/7c3W/lnDs7ee+lQ5k/Vz8Bdm/e3JL3XTq02xOlJcn8eeM9B/qVIJJkzuyS//7hWflX\nLyiZPSuZM6tKSTfz5iRzZiWvObuVj7172DeYAk9q6dElV//HWTnuGeOhY6jVTatUmT83OXhh8oE/\nGcoFZ7kaAjy5lS8bygf/7VCetjDjJzhKN8NDVebOTp51TPK5/zCcZy0xm9C/xOgJ8+eWfPyKWdm4\nucrff29L1vx8bc588fKcc3orBy2wyIHpO+6Ykv/x8dm558Furv3Wr1KllTNXHJOXvqBkeEg/Aabv\nFWcM5Y9e1Mr/uaPK3994Z559/NK8bMVBOek455Lpf4LIJEceWvLKl4xm8ZxfZuXZp/S6HKCPnfSs\nVn77gvWZN29env/8Z/a6HKBPDQ+V/OELSx5+8L6cc84zcthhQgiDwTt5Cp1OJ62W/zXAU9ftdjM0\nZCsW8NSZTxg03s1T6HQ6BgegFgYHoC7mEwaNT8cpWOhAXfQToC76CYNGEJmChQ7URT8B6qKfMGgE\nkSlY6EBd9BOgLvoJg0YQmYKFDtRFPwHqop8waASRKXjKDVAXgwNQh263m1KKL1dmoAgiU/CUG6Au\nTmwAdXBSg0Fk2p6CxQ7UxYkNoA5mEwaRT8cpWOxAXfQToA6urjKIBJEpGByAuugnQB3a7bZewsAR\nRKZgcADqop8AdXBFhEEkiEzB4ADURT8B6uB+MwaRd/QUnHUA6iKIAHXQSxhEgsgU7MME6uLEBlAH\nQYRBJIhMweAA1KXdbttOATxlggiDyKfjFOzDBOqw65uQ9RPgqRJEGEQ+HadgsQN10EuAuugnDCJB\nZAoWO1AHvQSoi23jDCJBZAqGB6AOBgegLraNM4i8o6cgiAB1MDgAdTGbMIh8Qk7BYgfq0Ol0Mjw8\n3OsygAFgNmEQCSJTsJ0CqIMrIkBdBBEGkU/IKRgegDoYHIC66CcMItP2FCx2oA56CVAX/YRBJIhM\nwWIH6qCXAHWxbZxBJIhM0u12k8TWLOApMzgAdbFtnEHkHT2JwQGoS7vd1k+AWngKH4NIEJnEGQeg\nLk5sAHUxnzCIvKMnsacbqIvBAaiL+YRB5BNyEgsdqIt+AtRFP2EQCSKTWOhAXfQToC76CYNIEJnE\nQgfqop8AdXHPGYNIEJnE4ADURT8B6uIpfAwiQWQSZxyAuggiQF3MJwwiQWQSZxyAuhgcgLp4Ch+D\nyDt6EoMDUBeDA1AXV1gZRD4hJzE4AHUxOAB10U8YRCbuSSx0oC76CVAX/YRBJIhMYqEDddFPgLro\nJwwiQWQSCx2oi34C1EU/YRAJIpNY6EBd9BOgLt1u1z2sDBzv6EkMDkBdPIUPqMOuB+mUUnpdCtRK\nEJnE4ADUxVP4gDo4Scqg8gk5icEBqEun08nw8HCvywD6nCDCoDJxT2KxA3VxYgOog9mEQeUTchKL\nHaiLfgLUwbZxBpUgMonBAaiLfgLUwdVVBpV39SQGB6Au+glQB72EQSWITGKxA3WxnQKog9mEQSWI\nTGJwAOrSbrf1E+ApE0QYVILIJPZhAnXxTchAHQQRBpVPyEk89x+og29CBuoiiDCoBJFJXBEB6mBw\nAOpi2ziDyqn/CWvXrs3NN9+c2267LRs3bszy5ctzxhln9LosoA/9+Mc/zt13351bb701CxcuzKmn\nnprjjz++12UBfei6667LAw88kM2bN2fLli0577zzsnDhwl6XBbVw6n/Cjh07snXr1mzdujWPPfZY\ntm7d2uuSgD41OjqakZGRjI2NZfPmzdm5c2evSwL61MjISEZGRjI6OppHH3201+VArQSRJGvWrMlL\nX/rSPPLII+l2u/n2t7+dj370o70uC+hDa9asyUUXXZRNmzZlaGgo119/fd7znvf0uiygD61Zsybv\nete78uijj6bVauX666/PpZde2uuyoDa2ZiVZtmxZrrjiinzqU5/Kc57znKxevTqf+9znel0W0IeW\nLVuWSy+9NFdffXVOPvnk3H777bnxxht7XRbQh5YtW5bXve51+cY3vpEzzjgjt956a+66665elwW1\ncUVkwsqVK3PUUUflu9/9bt7ylrfk4IMP7nVJQJ86++yzs2jRonznO9/JZZddlqc97Wm9LgnoUy96\n0Yty+OGH59prr81ll12WQw89tNclQW0EkQljY2NZt25dZs+enZGREU/OAvbZ9u3bs379+syePTu/\n+93vPO0G2CdVVWXHjh15+OGHM3fuXP2EgWPannDllVfm2GOPzbnnnpuvfe1reeSRR3pdEtCnPvOZ\nz2TJkiW54IIL8uUvfzkbNmzodUlAH+p0Ornmmmty1FFH5eKLL85XvvKVrF27ttdlQW0EkYw/Gm/V\nqlV5/etfn4MPPjgrV67MBz/4wbTb7V6XBvSZ6667LnfeeWfOP//8HHHEEVm5cmUuv/xy/QTYa9de\ne21+/vOf55xzzsnixYvzmte8Jm94wxv0EwaGm9WTXHjhhTn66KNz++23p9Vq5cwzz8wVV1zhG9aB\nvXbhhRem0+nk3nvvfbyffPKTn9RPgL22cuXKbN68Offff39KKTnrrLPy2c9+ttdlQW1cEZnQ6XTS\n7XZTSkkSezCBfdbpdFJV1eP3muknwL7odDpJxr9ZvdVq6SUMHEFkgsEBqEu323ViA3jKnhhESil6\nCQNHEJlgcADq0m63f+/EhqfwAfvCFREGnU/HCbu2ZhkcgKdq14kNV1iBp0IQYdCZtidMDiIWO7Cv\n3HMG1GFXENl1hVUvYdAIIhPcIwLUxYkNoA7dbvfxfwoiDKIZ/zzJqqryvYfW5v3rfp275g2n87yT\ncn13Rx5btzbvOOaYzPXITWCaxtrtfPW+e/Oh9lg2LlmUUiUndHfk+N+syzlLjnn8CgnAk/nN1q35\n+M/uzNXd7dl68omZU5KztmzKiVu25IRDDul1eVCLGX1FpKqq/Okt38trv3VDVm8fzc5S0m21sj5V\nPnz3T7Pimq/n0bGxXpcJ9IFHx8ay4pqv510/vCXrU6VTStqtkntS5bXfuiFvu+WmVFXV6zKBPvDP\nG9Zn+de+lP/2wP15LEm3VTJaSr498lhO/cZXc80v7ut1iVCLGR1EPvmT1fnKfT/P1im+oXRbp5P7\nf7slF37rhh5UBvSbC791Q+7/7ZYp+8nWdjtfvu/efPInq3tQGdBPNo6O5rwb/i6/27kjOya2Zu3S\nSbKt3c4lN303P9m0sTcFQo1mbBBpd7v5q9Wrsm2KoWGXHd1uVm/amDssdmAPVm/amNWbNv5/Q8MT\nbWu387HVq9LewzEAV/3sruzsdvZ4zFink79efVtDFcH+M2ODyM3rHkpnGgPB9k4nn7/3ngYqAvrV\n5+/9Wcb2cFJjl3a3m1t+81ADFQH96qp77s5oZ89BpFtV+eaDv5jWHAMHshkbRB4eHc10dmt3qipr\nR0b2ez1A/3poZGumMw5USTZsG93f5QB9bPP26d2bWpI8tnPn/i0G9rMZG0QOnzs303l+TauUHDV/\n/n6vB+hfi+fPT2saT8QqKTl87twGKgL61cGzZ0/ruG5VZeGsWfu5Gti/ZmwQOevoJck0osi8oaG8\n6TnL9n9BQN9603OWZe40nu9fyq7eAzC1S05cnjlP0k9KkvOPfVaGWzN2jGNAzNh38OyhoVzx/D/I\n/D18T8hwKTnxkENz+uKjGqwM6DenL1qcEw85NMN7uCoyf3g4VzzvBZntC8mAPXjbyadk1pMEjHnD\nw3nfqac1VBHsPzM2iCTJX77w9LzqmUuzYIowMm9oKMcsPCjXv+rVPagM6CellNzwqlfnmIUHZd4U\nQWPB8HDOP3Zp3v/CFT2oDugnT1+wINedtzILhoczq/z+mNYqJfOHh/Nfz3xZVixa3KMKoT4zOoi0\nSsnXXn5erj7n5Vlx5KK0Mn65c8mCBfnI6S/JHRe9IUfNX9DrMoE+cNT8BbnjojfkI6e/JEsWLEjJ\neINdceSiXH3Oy/PVc8+b1n0kAGcvOSZ3vP6N+ZPlz82C4VkpSWa3WrnouGfnlgv/dS5ZtrzXJUIt\nyt580+9pp51WrVq1aj+W01tVVaVbVRmy55I+UUq5raqqvrs+P+i9JEk63W5apaQIH/QJ/eTA1e52\n3Q9CX5luP9n9DRIzUCklQ4YGoAZOaAB1EUIYVN7ZAABA4wQRAACgcYIIAADQOEEEAABonCACAAA0\nThABAAAaJ4gAAACNE0QAAIDGCSIAAEDjBBEAAKBxgggAANA4QQQAAGicIAIAADROEAEAABoniAAA\nAI0TRAAAgMYJIgAAQOMEEQAAoHGCCAAA0DhBBAAAaJwgAgAANE4QAQAAGieIAAAAjRNEAACAxgki\nAABA4wQRAACgcYIIAADQOEEEAABonCACAAA0ThABAAAaJ4gAAACNE0QAAIDGCSIAAEDjSlVV0z+4\nlI1Jfrn/ygH20rFVVR3Z6yL2ll4CByT9BKjLtPrJXgURAACAOtiaBQAANE4QAQAAGieIAAAAjRNE\nAACAxgkiAABA4wQRAACgcYIIAADQOEEEAABonCACAAA07v8BM0dLNEUIoDkAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7fd05df29d30>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'x': 'a', 'y': 'b'}]\n"
     ]
    }
   ],
   "source": [
    "mm = h.access_graph('metaModel')\n",
    "instances = mm.find_matching(pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Rewriting rule to Cypher: \n",
      "\n",
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_y:metaModel { id : 'b'}) , (lhs_x:metaModel { id : 'a'})  , (lhs_y)-[lhs_y_lhs_x:edge]->(lhs_x), (lhs_y)-[lhs_y_lhs_y:edge]->(lhs_y)\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH lhs_y_lhs_x, lhs_y_lhs_y , lhs_y as p_y, lhs_x as p_x \n",
      "\n",
      "// Removing properties from node 'y' of P \n",
      "FOREACH(dummy IN CASE WHEN 'age' IN keys(p_y) THEN [1] ELSE [] END |\n",
      "\tSET p_y.age = filter(v in p_y.age WHERE NOT v IN ['18'])\n",
      "\tFOREACH(dumy2 IN CASE WHEN size(p_y.age)=0 THEN [1] ELSE [] END |\n",
      "\t\tREMOVE p_y.age))\n",
      "\n",
      "\n",
      "// Removing properties from edge y->x of P \n",
      "WITH p_y, p_x, lhs_y_lhs_y, lhs_y_lhs_x MATCH (p_y)-[p_y_p_x:edge]->(p_x)\n",
      "FOREACH(dummy IN CASE WHEN 'type' IN keys(p_y_p_x) THEN [1] ELSE [] END |\n",
      "\tSET p_y_p_x.type = filter(v in p_y_p_x.type WHERE NOT v IN ['child_of'])\n",
      "\tFOREACH(dumy2 IN CASE WHEN size(p_y_p_x.type)=0 THEN [1] ELSE [] END |\n",
      "\t\tREMOVE p_y_p_x.type))\n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH p_y_p_x, lhs_y_lhs_y, lhs_y_lhs_x , p_x as rhs_x, p_y as rhs_y \n",
      "\n",
      "// Return statement \n",
      "RETURN p_y_p_x, lhs_y_lhs_y, lhs_y_lhs_x, rhs_y, rhs_x\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'x': 'a', 'y': 'b'}"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mm = h.access_graph('metaModel')\n",
    "mm.rewrite(rule, instances[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Rewritting ancestors of metaModel...\n",
      "-->  actionGraph\n",
      "// Matching of the nodes to clone in 'actionGraph'\n",
      "OPTIONAL MATCH (node_to_clone:node:actionGraph)-[t:typing]->(n:node:metaModel)\n",
      "WITH node_to_clone, collect(n) as sucs, collect(t) as typ_sucs, count(n) as number_of_img\n",
      "WHERE number_of_img >= 2 AND node_to_clone IS NOT NULL\n",
      "FOREACH(t IN typ_sucs | DELETE t)\n",
      "WITH node_to_clone, sucs, number_of_img-1 as number_of_clone\n",
      "UNWIND range(1, number_of_clone) as clone_number\n",
      "// create a node corresponding to the clone\n",
      "CREATE (cloned_node:node:actionGraph) \n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, node_to_clone.id as original_old, sucs, node_to_clone, clone_number \n",
      "// set the id property of the original node to NULL\n",
      "SET node_to_clone.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET cloned_node = node_to_clone\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET cloned_node.id = toString(id(cloned_node)), cloned_node.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET node_to_clone.id = original_old\n",
      "WITH cloned_node, toString(id(cloned_node)) as clone_id, sucs, node_to_clone, clone_number \n",
      "\n",
      "//create a map from original node id to the clone\n",
      "WITH {original_node:node_to_clone.id, clones:collect(cloned_node)+[node_to_clone]} as orig_id_to_clone, collect({clone_id:clone_id, clone:cloned_node}) as clone_maps, sucs, node_to_clone\n",
      "WITH collect(orig_id_to_clone) as orig_ids_to_clone, collect({orig:node_to_clone, clone_maps:clone_maps}) as all_orig, sucs\n",
      "WITH apoc.map.groupByMulti(orig_ids_to_clone, 'original_node') as orig_ids_to_clone, all_orig, sucs\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(orig_ids_to_clone) | \n",
      "\tpairs + [k, REDUCE(values=[], v in orig_ids_to_clone[k] | \n",
      "\t\tvalues + CASE WHEN v.clones IN values THEN [] ELSE v.clones END)])) as orig_ids_to_clone, all_orig, sucs\n",
      "UNWIND all_orig as original_map\n",
      "WITH original_map.orig as node_to_clone, original_map.clone_maps as clone_maps, sucs, orig_ids_to_clone\n",
      "UNWIND clone_maps as clone_map\n",
      "WITH clone_map.clone_id as clone_id, clone_map.clone as cloned_node, sucs, node_to_clone, orig_ids_to_clone\n",
      "WITH [] as sucIgnore, [] as predIgnore, sucs, node_to_clone, orig_ids_to_clone, cloned_node, clone_id \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (node_to_clone)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, id: suc.id, edge: out_edge}) as suc_maps, predIgnore, sucs, node_to_clone, orig_ids_to_clone, cloned_node, clone_id \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(node_to_clone) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, id: pred.id, edge: in_edge}) as pred_maps, suc_maps, cloned_node, sucs, orig_ids_to_clone, node_to_clone, clone_id \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE\n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL AND suc_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[suc_map.id] \n",
      "\t\t\tWHEN suc_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE\n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL AND pred_map.id IN keys(orig_ids_to_clone)\n",
      "\t\t\t\tTHEN orig_ids_to_clone[pred_map.id] \n",
      "\t\t\tWHEN pred_map.neighbor IS NOT NULL\n",
      "\t\t\t\tTHEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "// copy self loop\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (self_loop IN CASE WHEN suc_map.neighbor = node_to_clone THEN [suc_map.edge] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:edge]->(cloned_node) \n",
      "\t\tSET new_edge = self_loop))\n",
      "WITH cloned_node, sucs, orig_ids_to_clone, node_to_clone, clone_id \n",
      "OPTIONAL MATCH (node_to_clone)-[out_typ_edge:typing]->(suc_typ:node)\n",
      "WITH collect({neighbor: suc_typ, edge: out_typ_edge}) as suc_typ_maps, cloned_node, sucs, orig_ids_to_clone, node_to_clone, clone_id \n",
      "OPTIONAL MATCH (pred_typ:node)-[in_typ_edge:typing]->(node_to_clone) \n",
      "WITH collect({neighbor: pred_typ, edge: in_typ_edge}) as pred_typ_maps, cloned_node, sucs, orig_ids_to_clone, node_to_clone, suc_typ_maps, clone_id \n",
      "// copy all incident typing edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_typ_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (cloned_node)-[new_edge:typing]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_typ_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:typing]->(cloned_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH collect(cloned_node)+[node_to_clone] as nodes_to_typ, collect(clone_id) as clone_ids, sucs, orig_ids_to_clone, node_to_clone\n",
      "FOREACH (i IN range(0, size(sucs)-1) |\n",
      "\tFOREACH(source in [nodes_to_typ[i]] |\n",
      "\t\tFOREACH(target in [sucs[i]] |\n",
      "\t\t\tMERGE (source)-[restored_typing:typing {  }]->(target)\n",
      ")))\n",
      "RETURN clone_ids\n",
      "// Removal of nodes in 'actionGraph'\n",
      "MATCH (n:node:actionGraph)\n",
      "OPTIONAL MATCH (n)-[:typing]->(x:node:metaModel)\n",
      "FOREACH(dummy IN CASE WHEN x IS NULL THEN [1] ELSE [] END |\n",
      "\tDETACH DELETE n\n",
      ")\n",
      "// Removal of node properties in 'actionGraph'\n",
      "WITH n, x\n",
      "WHERE x IS NOT NULL AND REDUCE(invalid = 0, k in filter(k in keys(n) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(x) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in n[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN x[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH n, x, [x, n] as node_to_merge_props\n",
      "\n",
      "//Perform the intersection of the properties of node_to_merge_props\n",
      "WITH [] as new_props, x, node_to_merge_props, n\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(node_to_merge_props[0]) | pairs +\n",
      "\tCASE WHEN ALL(other in node_to_merge_props WHERE k in keys(other))\n",
      "\tTHEN\n",
      "\t\tREDUCE(inner_pairs = [], v in node_to_merge_props[0][k] | inner_pairs +\n",
      "\t\t\tCASE WHEN ALL(other in node_to_merge_props WHERE v in other[k])\n",
      "\t\t\tTHEN\n",
      "\t\t\t\t{key: k, value: v}\n",
      "\t\t\tELSE\n",
      "\t\t\t\t[]\n",
      "\t\t\tEND)\n",
      "\tELSE\n",
      "\t\t[]\n",
      "\tEND) as new_props, x, node_to_merge_props, n\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, x, node_to_merge_props, n\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, x, node_to_merge_props, n\n",
      "WITH n.id as n_id, x, node_to_merge_props, new_props, n\n",
      "SET n = new_props\n",
      "SET n.id = n_id\n",
      "\n",
      "// Removal of edges attributes in 'actionGraph'\n",
      "MATCH (n:node:actionGraph)-[rel_pred:edge]->(m:node:actionGraph)\n",
      "OPTIONAL MATCH (x:node:metaModel)-[rel:edge]->(y:node:metaModel)WHERE (n)-[:typing]->(x) AND (m)-[:typing]->(y)\n",
      "FOREACH(dummy IN CASE WHEN rel IS NULL THEN [1] ELSE [] END |\n",
      "\tDELETE rel_pred\n",
      ")\n",
      "WITH rel, rel_pred\n",
      "WHERE rel IS NOT NULL AND REDUCE(invalid = 0, k in filter(k in keys(rel_pred) WHERE k <> 'id') |\n",
      "\tinvalid + CASE\n",
      "\t\tWHEN NOT k IN keys(rel) THEN 1\n",
      "\t\tELSE REDUCE(invalid_values = 0, v in rel_pred[k] |\n",
      "\t\t\tinvalid_values + CASE\n",
      "\t\t\t\tWHEN NOT v IN rel[k] THEN 1 ELSE 0 END)\n",
      "\t\tEND) <> 0\n",
      "WITH rel, rel_pred, [rel_pred, rel] as edges_to_merge_props\n",
      "\n",
      "//Perform the intersection of the properties of edges_to_merge_props\n",
      "WITH [] as new_props, edges_to_merge_props, rel, rel_pred\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(edges_to_merge_props[0]) | pairs +\n",
      "\tCASE WHEN ALL(other in edges_to_merge_props WHERE k in keys(other))\n",
      "\tTHEN\n",
      "\t\tREDUCE(inner_pairs = [], v in edges_to_merge_props[0][k] | inner_pairs +\n",
      "\t\t\tCASE WHEN ALL(other in edges_to_merge_props WHERE v in other[k])\n",
      "\t\t\tTHEN\n",
      "\t\t\t\t{key: k, value: v}\n",
      "\t\t\tELSE\n",
      "\t\t\t\t[]\n",
      "\t\t\tEND)\n",
      "\tELSE\n",
      "\t\t[]\n",
      "\tEND) as new_props, edges_to_merge_props, rel, rel_pred\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, edges_to_merge_props, rel, rel_pred\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, edges_to_merge_props, rel, rel_pred\n",
      "SET rel_pred = new_props\n",
      "\n",
      "Rewritting ancestors of actionGraph...\n"
     ]
    }
   ],
   "source": [
    "h._propagation_up('metaModel')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Graph rewritting and propagation down"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([(\"w\", {\"name\":{\"Paul\"}}), \"x\", \"y\", \"z\"])\n",
    "pattern.add_edges_from([(\"x\", \"w\"), (\"y\", \"x\"), (\"y\", \"z\"), (\"z\",\"z\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "rule.inject_add_node_attrs(\"x\", {\"age\":{10}})\n",
    "rule.inject_add_edge_attrs(\"x\", \"w\", {\"relation\":{\"brothers\"}})\n",
    "rule.inject_add_node(\"new_node\", {\"name\":{\"Will\"}})\n",
    "rule.inject_add_edge(\"new_node\", \"y\")\n",
    "merged_node = rule.inject_merge_nodes([\"w\", \"z\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rhs_typing = {\n",
    "    'metaModel': {'new_node':'a', merged_node: 'a'}\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xl8VHWe7//XqarsCyFsIZCFnRAC2diVBqICtuNua9vd\nTve0rbTaXnvu+OjpO3Pb9t7fz3HGsafXWdB7Z0Zb22lpRUAEO6CyLwkkEHYIqQRIQhKykLVSVef+\nEUmzJSRQdSrL+/l45PEwqVNVn/igPjnv7/l+v8cwTRMREREREREr2QJdgIiIiIiIDD4KIiIiIiIi\nYjkFERERERERsZyCiIiIiIiIWE5BRERERERELKcgIiIiIiIillMQERERERERyymIDCCGYZQYhnHH\nVT9bZBjGmesc+7lhGE9e9v3/MAzjtGEYjYZhnDEM47+sqFlE+qcv+03Llz2j0jCM/zAMIzLQdYlI\n33JVr6i4vFd8+d//31XHJxuGYRqG4fjy+7GGYfzBMIxqwzDqDcMoMgzj2wH4VcQPFEQEwzD+HPgW\ncIdpmpFANrApsFWJSD/wZ1/2jEw6+sbfBrgeEembLvWKdCAD+HEvnvs2UAYkAcPoOF+p9HmFEhCO\nQBcgfcIsYKNpmqcATNOsAFYGtiQR6S9M0zxrGMYnwPRA1yIifZdpmhWGYWykI5D01Czgh6ZpNn35\n/X7fVyaBoisiArALeMIwjBcNw8g2DMMe6IJEpP8wDCMBuBudIIhINwzDGAssB0724mm7gN8YhvGY\nYRiJ/qlMAkVBZHCINwyj7vIv4LZLD5qm+VvgB8BS4AvgvGEYPwpQrSLSf6z+sp9so6N3vBLgekSk\nb1ptGMZFOqZYnQdeuuyxv7rq/OTAVc99BNgK/E/gtGEYBYZhzLKkavE7BZHB4ZxpmjGXf9Fx4tDJ\nNM13TNO8A4gBVgD/2zCMpYEoVkT6jfu/7ClJpmk+Y5pmS6ALEpE+6X7TNKOARcBUYPhlj/3jVecn\nMy5/ommataZp/rVpmqnAKKCAjmBjWFS7+JGCiFzBNM120zTfp2NEQvO9RURExCdM0/wC+A/gH2/y\n+dVfPjceiPVdZRIoCiIDT5BhGKGXvujBhgSGYXzbMIyvGoYRZRiGzTCM5UAqsNvv1YqIiMhg8nPg\nTsMwZvbkYMMw/t4wjOmGYTgMw4gCvg+cNE2zxq9ViiW0a9bAs/6q77f34DkNwP8AfgvYASfwfdM0\nt3X7LBEREZFeME2zyjCMt4CfABd78JRw4ENgNNBCxyDpvf6rUKxkmKYZ6BpERERERGSQ0dQsERER\nERGxnIKIiIiIiIhYTkFEREREREQspyAiIiIiIiKW69WuWcOHDzeTk5P9VIqI9FZ+fn61aZojAl1H\nb6mXiPQ96ici4is97Se9CiLJycnk5eXdfFUi4lOGYTgDXcPNUC8R6XvUT0TEV3raTzQ1S0RERERE\nLKcgIiIiIiIillMQERERERERyymIiIiIiIiI5RRERERERETEcgoiIiIiIiJiOQURERERERGxnIKI\niIiIiIhYTkFEREREREQspyAiIiIiIiKWUxARERERERHLKYiIiIiIiIjlFERERERERMRyCiIiIiIi\nImI5BREREREREbGcgoiIiIiIiFhOQURERERERCynICIiIiIiIpZTEBEREREREcspiIiIiIiIiOUU\nRERERERExHIKIiIiIiIiYjkFERERERERsZyCiIiIiIiIWE5BRERERERELKcgIiIiIiIillMQERER\nERERyymIiIiIiIiI5RRERERERETEcgoiIiIiIiJiOQURERERERGxnIKIiIiIiIhYTkFEREREREQs\npyAiIiIiIiKWUxARERERERHLKYiIiIiIiIjlFERERERERMRyCiIiIiIiImI5BREREREREbGcgoiI\niIiIiFhOQURERERERCynICIiIiIiIpZTEBEREREREcspiIiIiIiIiOUGfRD5t3/7N5599lkA9uzZ\ng2EY7N27F4BnnnmGlStXBrI8EelH1E9EpLdutm/ce++9pKenk56eTmJiIhkZGZbVLOIrgz6I5OTk\nsGnTJgA2bdrEvHnzrvg+JycnkOWJSD+ifiIivXWzfWPNmjUUFBTwxRdfEBMTw09+8hPLahbxlUEf\nRCZOnEhLSwtnzpxh06ZNvPLKK2zatImysjLa2tqYMGFCoEsUkX5C/UREeutW+kZ7ezsPPvgg3/nO\nd3jggQcsrFrENwZ9EAFYsmQJ69ato7KykkWLFlFeXs7HH3/MkiVLAl2aiPQz6ici0ls32zeefPJJ\nUlNT+eEPf2hRpSK+pSBCx2XRV199lQULFgCwYMECXn31VU2jEJFeUz8Rkd66mb7x05/+lLq6On7+\n859bVaaIzymI0DES4XQ6Oz/wOTk5OJ1OjWCKSK+pn4hIb91M33j55Zc5evQomZmZpKen8+ijj1pV\nrojPGKZp9vjg7OxsMy8vz4/liEhvGIaRb5pmdqDr6C31EpG+R/1ERHylp/1EV0RERERERMRyjkAX\nICIiIiLXOn/+PHfdddc1P3/wwQe1Xa8MCAoiIiIiIn3QyJEjKSgoCHQZIn6jqVkiIiIiImI5BRER\nEREREbGcpmYBptuF+9RnuJ07Mb1u7CMmE5RyD7bw2ECXJiL9jLf5Au1H1uGpOo5hc+BImodjwmIM\nR3CgSxORfsZTfZL2Ix/jbazEFhaDY/Jd2EfPxDCMQJcm4hODPoi4S3fT8sf/BZjQ3gKAp2wvrn2/\nJSjtYULmfE8feBG5IdM0adv9Bu0HVwEGeFwAuMv2wLZfEnbnT3AkzglskSLSL5htjbRs+Bs8VcfA\n3Q548WDQfupzjPDhhN/zD9ii4gJdpsgtG9RTs9znCmjZ+BK0N3eGEKDjBMLTTnvRh7TteTNwBYpI\nv9G2503aiz4ET3tnCAE6ekt7My0bX8J9rjBwBYpIv2B63DSv+SGeysPgbgO8lx6B9hbMhrM0f/As\nZmt9IMsU8YlBHUTatv4CPG1dH+Bupf3AKrwttdYVJSL9jrellvYDq8Dd2vVBnjbatv3CuqJEpF9y\nn96Ct/4seN3XP8D0Yrou4jr4gbWFifjBoA0inppivBfLe3Rs+5FP/FyNiPRnPe0R3oZzeGqK/VyN\niPRnrsL/AndL9wd52nEVfYhpmtYUJeIngzaIeGtLwLDf+ECPC2/1cb/XIyL9l7f6+JXTsbpi2Dt6\nj4hIF7z1Z3t2YHtzx5dIPzZogwj2oF4cq91uRKQbvekRvek9IjL49GSQFMA0waZ+Iv3boA0i9rjp\nXc+/vFxQGI6kuf4vSET6LUfSXAgKv/GBXndH7xER6YJjTCb0YLfOZkcsnsF7GicDxKD9F2wLG4o9\nYfaNRx4MO45xt1tTlIj0S45xt4PRfTs1sWFPmI0tbKhFVYlIfxSc/ugNr7K2eQwK2ieydu1ampqa\nLKpMxPcGbRABCF34Q4ywmC7DiBs7jZnPYWgqhYh0w7AHEbb0ZXCEXPdxj2nQSij2eT+wuDIR6W/s\nI6cSNP3BLvtJmwcOVtlYf7iR8vJyPvzwQ6qqqiyuUsQ3BnUQsYXHEv7IGzjG3dYx+hAUgdsIxm3a\ncTYGs6H9NnaX3GDnChEROqZThP/Zz7CNmNJxAhEUjosg3KaNorpI1nMXRSfLAl2miPQDoXOfImT+\ncxhhsRAUjukIw4WDVo+Nj0+H8H9OjMTt8VJYWMiFCxdYs2YNxcXakU/6n0F/Z3Vb2FDC7vop3pZ6\nvJWHqK+r5dPdRzh44QIuVyOTQ85TWlpKYmJioEsVkT7OPmoaEQ/9K966Ujy1Ts4Vl7DzZB27nIdI\n8DbCwYNMnz6dkJDrj3SKiFwSPO0eglLuxlNxCLPlAgV5BzhQ4WHP+X1ED4nEZrMxevRoCgoKSElJ\nITc3l6ysLLKysgJdukiPDeorIpezhQ3BkTyfYelfZdi4GYwZM4aamhpaWlrIy8vTXt0i0mO2mESC\nxt3O+IWPYQsbQnJyMqWlpbS1tVFYqLuri0jPGIYNx+g0gsZ/hYm3PURwaDijR48mKiqKiIgIIiIi\nmDJlCkeOHKGiooL8/Hxyc3Nxu3uwGY9IH6Agch3Z2dkEBQUxZswYSktLqa6upqSkJNBliUg/ExQU\nxMyZM4mNjcVut1NVVUVRUREtLZryKSK9Ex8fT3x8PAkJCZw/f54xY8YQGRnJsGHDmDFjBmVlZRQX\nF3Pq1CnWrFmjRezSLyiIXEdsbCzjx48nPj6eCxcu0NTUpKsiInJTUlNTCQsLIzk5GafTicvl0lUR\nEbkp2dnZBAcHM2rUKMrKyrDb7WRmZhIbG0t6ejpNTU0cOnSIiooKLWKXfkFBpAuXroqMHTuW0tJS\namtrOXXqVKDLEpF+xuFwkJGRQUxMDCEhIZw/f55Dhw7R3Kw7IotI78TFxZGQkEBCQgJVVVW0trZS\nWlrKAw88wKhRo0hNTSU0NJTCwkJqampYs2aNzl2kT1MQ6UJMTAwTJ04kPj6epqYmxo8frwXrInJT\nUlJSiIiIICkpiaqqKm6//XbCwsICXZaI9EOXBkpHjx5Na2sr8+fPJyoqivvuu4/k5GQmTpzI6NGj\nO3fU2rRpk2Z1SJ816HfN6k5WVhYRERHMmjWLmpoagoO7v8GQiMj12O125s6di9vt5sSJE7jdbowe\n3DlZRORqI0aMIDMzk7vuuostW7YQGhoKdKxJW7p0KXv27AEgLCyMI0eOkJyczL59+6irq2PRokU4\nHDr1k75DV0S6ER0dzezZs8nIyKC6ulpzLfuJ9evXk56e3vkVHBzMRx99FOiyZJCbMGECU6ZMYc6c\nOezfvx+PxxPokuQG1Eukr8rOziY5OZnp06eTn5/f+XPDMJgzZw6LFi3SInbpFxREesBut5ORkcHe\nvXsDXYr0wN13301BQQEFBQU8++yzZGdns3Tp0kCXJQJ0jGYOHz6cI0eOBLoUuQH1Eunrpk+fTllZ\nGbW1tVf8fPLkydxzzz3XLGKvq6vD6/UGqFqRaymI9NDUqVOpr6+noqIi0KVID23cuJGf/exnrFmz\npvPStUhfkJ2dTUFBgfb67yfUS6SvCg4OZubMmVdcFbkkLi7uikXsYWFheDwerRWRPkVBpIdsNhuZ\nmZnk5eUFuhTpgcLCQlasWMFHH33E8OHDA12OyBWGDRtGXFwchw4dCnQpcgPqJdLXpaamUlFRQU1N\nzTWPXVrEPm7cOL773e+yYMECPvroI8rLywNQqci1FER6YdKkSTQ2NnLu3LlAlyLdOHv2LA899BC/\n/e1vmTx5cqDLEbmu7OxsCgsLcblcgS5FuqBeIv2Bw+EgPT29y4HSS4vYJ0+ezLRp01iyZAm5ubkc\nPXrU4kpFrqUg0gs2m43s7GytFenj3nzzTaqqqnj22Wc7F5l+9tlngS5L5AoxMTEkJCRQVFQU6FKk\nC+ol0l+kpKRQXV3N+fPnb3jsmDFjuPfeeyksLGTnzp2aqiUBZfTmH2B2drY52KcmmabJqlWrmDt3\nLgkJCYEuRwY5wzDyTdPMDnQdvaVe0qGhoYHVq1fz6KOPEhISEuhyZJBTP+nfDh8+TElJCXfffXeP\njm9rayM3NxebzUZOTo5uUSA+1dN+oisivWQYBllZWboqIiK3LDo6muTkZA4cOBDoUkSkn+vtpjoh\nISEsX76c6OhoVq9eTUNDg58rFLmWgshNGDduHKZpUlJSEuhSRKSfy8zM5PDhw7S2tga6FBHpx25m\nUx2bzcaCBQuYPn26FrFLQCiI3ATDMMjOziYvL09zK0XklkRGRjJhwgQKCgoCXYqI9HOTJk2iqamp\n15vqaBG7BIqCyE1KSkrC4XBQXFwc6FJEpJ/LzMzk2LFjNDc3B7oUEenHbDbbTU8fv7SI/cCBA+zc\nuVM3PhRLKIjcguzsbPLz8/VhFZFbEh4ezuTJk3VVRERu2YQJE3C5XJSVlfX6uUOGDOG+++6jtraW\njRs3antx8TsFkVswduxYQkNDOXnyZKBLkcuYXpOmKpPG8yZej6bOSf+Qnp7OiRMnaGxsDHQpchmP\ny+RiuUlLrXqJ9A+Xpo/f7KY6ISEhLFu2TIvYxRIKIrdo1qxZ7Nu3T1dF+gBXk8mOn3n5xWSTX6ea\n/HOayS8mmmz7ey9tF3USIX1bWFgYKSkp7N+/P9ClCFBXYvLxc15eTzD5lwyTX0wyWTnHy6H3Ta0N\nlD4vOTn5ljbVuXoRu27kLP6iIHKLRo8eTVRUFMePH7/u40ePHiUhIQGn0wnAyy+/zGOPPWZliYNC\na73Jfywx2fb30FwFnjZwt0LLBdjxM/i/t5s0X9DJg/RtM2fO5PTp012OQKqfWKN8n8mbt5kc+F1H\nH3G3gLcdqo/C+udN1j6tMCJ9m2EYzJo1q8tNdXraS6ZNm0ZOTg6bNm3iyJEjfq9bBh8FER+4dFXE\n4/Fc89jUqVN55ZVXePTRR/n000959913WblyZQCqHNjWft+ktrjjpOFq7laoPwOrv6MTB+nbQkJC\nSE1NZd++fdd9XP3E/9ytJr970MR1EUz3tY+3N8OxtbDv/6ifSN+WmJjY5aY6vekl8fHx3HvvvRw8\neJAdO3ZoBoj4lIKID4wcOZLY2Ngut7z71re+xdSpU7n//vt59913iY6OtrjCge1iuUlxLni6WVPn\nbYczu6C2WCcP0relpaVRWlpKXV3ddR9XP/GvIx+Cp737Y9qbYcfr6KqI9HndbarTm14yZMgQ7r//\nfurq6tiwYYMWsYvPKIj4SHZ2Nvv378ftvnYIzeVycejQIWJiYqisrAxAdQPbifVg9OBfsumFY+v8\nX4/IrQgODmbGjBnk5+df93H1E/8qfMekvQf7BbTWQ5Vmqkgf192mOr3tJcHBwSxbtoyYmBgtYhef\nURDxkeHDhzNq1CgOHz58zWMvvvgiWVlZ/PGPf2TFihWcOXMmABUOXG0N4Gm/8cikxwVtDRrBlL4v\nNTWVc+fOceHChWseUz/xr7b6nh1ns4Pron9rEfGFrjbVuZleYrPZmD9/PmlpaVrELj6hIOJDWVlZ\nFBYW0t7+p+v6q1ev5vPPP+fnP/85qampvPTSS3z961+/7pUT6T2v10uNqwTTdoO5FIAjHKLiDQuq\nErk1QUFBzJw5k7y8vCt+rn7iX83NzbSFngd6NrARGef/mkRu1fU21bnVXpKSkqJF7OITRm/muGZn\nZ5tX/2GUK23evJmhQ4eSkZER6FIGvMrKSrZs2cKFiotU//RxDHdwt8c7QuEHRw3Chg6cMGIYRr5p\nmtmBrqO31EtuzO12895777Fs2TKGDx8e6HIGNNM0OXr0KLt376bhQCwX37oToz2k2+fEpcNffDGw\nxvLUTwau8+fPk5uby6OPPordbvfZ6zY0NLBhwwbGjh3L3LlzsdkG1mdCbl5P+4n+xfhYZmYmBw8e\n1EIuP3K5XGzbto2PPvqI8vJyDp0ooH7SJgjq+qqIIwxmPsGACiEysDkcDjIyMq65KiK+VVdXx9q1\na9m6dSuVlZUcbFiHJ7IGbNfugniJIwwWv6ReIv3HjTbVuVnR0dFaxC63REHEx2JiYkhMTOTAgQOB\nLmVAKikp4fe//z1FRUWcPXuW/fv3M2TIEMY9UUZ4phN7qBcuPz8wICgCJi6DO/9OJw7Sv0ydOpUL\nFy5oUbofeDwe8vPzWbVqFWVlZRw7dowTJ04wYeJ4Rj6/meBRzTjCr5wxYAvquLJ61z/AuCXqJ9K/\ndLepzq24ehF7fX0PF1qJAI5AFzAQZWVl8eGHHzJ9+nRCQ0MDXc6A4PV6yc3NpaSkhMbGRo4fP47D\n4SA9PZ2wsDCmTJnCnL9IovqAnd2/Mjmzu+N58Zkw53mDhHkdN3gS6U/sdjuZmZnk5eXx1a9+NdDl\nDBh1dXV8+umn1NXVcf78eYqLixkxYgRZWVmEhIQwa1YGKc9Gcfxjgz2/Nqlzgj0Ept4H2U8ZDB2n\nXiL9z+Wb6syYMcOnr31pEfuRI0dYs2YNOTk5xMfH+/Q9ZGBSEPGDqKgoxo0bx4EDB5g9e3agyxkQ\nbDYbpmlSXFxMZWUl48aNIy4ujujoaBYuXNjZ8MbOhrFv6yRBBo7JkydTUFBAeXk5o0ePDnQ5A0J4\neDgNDQ2d02inTZtGdHQ0iYmJ3HbbbURGRgIw7UGY9qD6iQwcWVlZfPzxx6SkpBAUFOTz109JSWHI\nkCFs2rSJrKwspk2b5vP3kIFFU7P8JCMjgyNHjtDS0hLoUgaEM2fOUF5ejtfrJSsri/j4eDIyMnj4\n4Yc16iIDms1mIysri7179wa6lAHB6/Vy9OhR6uvriYmJISMjg1GjRpGTk8OyZcs6Q4jIQBQbG8uY\nMWMoKiry23vEx8dz3333UVRUxPbt23UndumWroj4SWRkJJMmTWLvzkJCaqdSccpFcJiNKfPDGZcZ\npmlCPdTa2srOnTupqKggJyeHuXPncvToURYuXEhsbGygyxOxxMSJE9m/fz+H9pZSeTCChio3UcMd\npC+NYtjY7neLkz+prq5my5YthISE8L3vfY/du3cTEhLCnDlzCAnpfpcskYEiKyuL1as/IsI1gVN7\nXLhavMRNCGbm0ihCI32zo9alRey5ubls2LCBnJwcfcbkuhRE/MQ0TRoKxrPlrTocQdW0t3Ysetz1\nfh0RsXae+Md44ibqQ9md48ePs3v3biZNmsQjjzyCw+HANE2mTJmiICeDSluTl6o/ZvBOUQs22vC4\nwe6Az/9vLeOzw/j6/x/nsxOIgcjtdpOXl8eJEyeYM2cOkydPBiAnJ0fbjcqg01IVivPdWZxoqsDT\n1vG3NCjUYN0/VfOVJ4aS871Yn/yNvbSIfdeuXaxevZoXX3yR9evXM3369Ft+bRk41IH9ZOM/17Dj\nd42YHntnCAFwtZjUnnXzr0+eocrZ97e5e+2113j22Wc7v6+srGTUqFE0Nzf77T0bGhpYt24dRUVF\nLF++nLlz5+JwdGRmwzAUQmRQcbu8vLHiLOWHwHTb8Hy54Y3HDW6XSXFeMyufPovb1benPwSilwCU\nlZXx/vvv09LSwiOPPNIZQgCFEBl0qpwu/vXJM7RccHSGEID2VhN3m8mWt2vZ8Osan73fpUXsM2fO\npKWlxWc7AAaqn4jvqQv7QV1FO9vfrbsigFzN1ezl43+qsrCqm/Pd736XP/zhDzQ2NgKwcuVKHn/8\nccLDw33+Xl6vl4KCAlavXk1iYiL333+/buQmg17BhotUOV14urhNjtsF1aUuCjZctLawXrKylwC0\ntLSwefNmtm3bxu23387ixYu1i6EMCIZh8MorrzBr1izGjx/PH/7wh87Hdu/ezeLFi8nKyupcmA7w\n4x//mNdee42P/6mKwjPreDVvCk3tHYHj98ef5HT9NqAjkOx4r466ij81nG9/+9usWLGCJUuWMGnS\nJJ544gku3Qy7srKSBx54gBkzZpCWlsZbb73V+bytW7eSlpZGWloav/71rwkJCWHPnj0cPnyYY8eO\nsXz5cmbNmsXMmTP593//9179P7C6n4j/KIj4we4/1HOjO9abJpza28LFat/u5+1rsbGx3Hvvvbz9\n9tu43W7eeOMNnnnmGZ+/z/nz5/nggw84d+5cZ1PTaKUIbHm7tttBDeg4edjyVq1FFd0cq3oJwLFj\nx1i1ahURERE88sgjjB071i/vIxIo0dHR7N27l7fffpvnn38e6NiWesWKFbz77rvk5+ezbt06nn76\naerq6sjJyWHjhlxO7W2hpH4nYyLScV7cicfbzrmmA4yNzOp8bdM02bXqynuBFBUVsX79eg4dOkR+\nfj65ubkAPP/880yfPp0DBw7w6aef8td//dcUFRXR1tbGY489xq9+9SsOHjzIwoULOXv2LIsXL6aw\nsJB7772X119/nb1797Jt2zZeffXVXt1s0cp+Iv6lNSJ+4DzQ2uXo5eVMw82ez44zZ3lin96p5Qc/\n+AHf+MY3GDlyJCkpKUyaNMlnr93e3s7evXspLi5m7ty5TJw40WevLTIQVJf2oJkAVaUuiouLGTt2\nLMHBfXMBuz97CUB9fT1bt27F5XKxfPlyXVGVAeuxxx4DYO7cuZw7d47W1lZ27NjB6dOnWb58eedx\nhmFw8uRJFixYQH7+o8yb2c6Zxn0sSfgRR2s3EBU0ihFhkwiyh3U+x9MORdvPM/OhdkaNGgXA/fff\n33lFMTMzk1OnTnHnnXeSm5vL66+/DsDo0aO5++67+eyzz/B6vYSHh7No0SIAvva1r/HUU08RGRnJ\ntGnTcDqd3HPPPURFRWEYBm1tbRw5coSpU6f2+P+Bv/uJWENBxA96OpDv9XopOlTEqdptDBs2jKSk\nJJKTk/vcH8+0tDSGDRvGCy+8wG9+8xufva7T6WT79u3Ex8fz8MMPa9qEyHUYBnR/PeQSk9zcXGw2\nG/Hx8SQlJZGUlNSnBjn81Uu8Xi+FhYUcPHiQjIwMUlNTdUVVBrRLfy/t9o5NKtxuN6ZpMmPGDLZs\n2XLd50yZOJ2D59cRGTSCxKi5bC57laigOJKi511zbGPTRdau3UZISAgVFRUkJyfT3t5OUFAQdrv9\npu7Ofml9p8PhYOTIkbzzzjuUlpaybNkyhgwZ0uvX81c/EWupU/vBpLnhBIXeeEG11w2HnFsoLi6m\nuLiYvLw8PvjgA9555x22bdtGU1OTBdX2zJNPPonNZuOee+655ddqbm4mNzeXnTt3smjRIhYtWqQQ\nItKF+Kk9213PFVJOYWEhTqeT48ePs337dt59910++OAD8vPzbzhd1Cq+7CXwp2mdFRUVPPjgg6Sl\npSmEyKA0f/58Tpw4wWeffdb5s71793Z+9pfdncPnp39BUvQ8HLZgooLjOFjzIclRVwYR02inyrOf\nw4cPU1paSl1dHceOHeM///M/Wb9+PRcv/mk92h133MEbb7wBQEVFBevXr2fJkiVMmTKFlpYWtm7d\nCsCqVauoq6sDYMqUKYSHh3Py5ElmzpzJmjVr+OKLL2hoaOj17+zrfiLW0xURP8i+bwi5b1zo/iDD\nS+SEGkamjaempoZTp07R1tZGbGwsw4YNo6GhgaysrO5fw0KfffYZzz333C39gTdNk2PHjrFnzx5S\nUlJYtGj/wSRRAAANQklEQVRR525YInJ9X3kilvd/WoGrpesgYTjcxM+voX1oAhcuXODgwYPYbDaG\nDRtGfX3HXO++0k980UsAXC4Xe/fu5fTp08ybN48JEyb4qEKR/mno0KGsWbOGF198kRdeeAGXy8X4\n8eNZu3YthmGwdPmdvPy/X2Lc0I7gkRQ1j7ON+xkdMeOK17HZbExZYqO+eRg1NTVUV1cTHByM0+mk\nsbGRtra2zmN/+ctf8vTTTzNjxgxM0+TVV18lNTUVgN/97nc888wzGIbBwoULSUxMBDquiKxdu5YX\nXniB1157jba2Nux2O2+88QYLFizo1e/sq34igWP0ZpQsOzvbzMvL82M5A8eeD+tZ97Oq6y4ytdkh\nbIjBnX/TRGWdk4qKCqDj5n0XLlygpqYGwzBYvnx55/SKiIgIq38FAM6dO8fixYuJi4vjk08+uekd\nKerq6tiyZQter1c3I/QhwzDyTdPMDnQdvaVe0nNer8nbf3WOU3tbrttPgkINxqbZSPvmeZylJZ2j\nio2NjdTU1FBTU0N8fDwLFy4kKSmJsWPHEhQUZPWv4bNeAlBSUsL27dtJSEjQzQh9SP1k4Gu84OaX\n3yilqdaD13Pt40EhBnP+HMInllFaWkpbWxter5e6urrO85O5c+cyY8YMkpKSGDVqlE+21G9oaGDj\nxo2MHj2a+fPn3zBY+LKfiH/0tJ8oiPhR4acNrHu9mvZWLx5Px9oRrweS00N55OU4ood3XA1obW2l\ntLSUkpISzpw5g9vtJjMzk9jYWJxOJ6WlpURFRZGcnExSUhLDhg0L8G/Wcx6Ph4KCAg4dOkRWVhbT\npk3TfUB8SCcOg4PHbbLhV9Xs/qAemw08HrDbweuF2Q8OYfkPhmN3dHyu6urqcDqdOJ1/GuRYtmwZ\nFy9exOl0UllZSVxcXMAHOW5Gc3Mz27dv58KFC9x+++3Ex8cHuqQBRf1kcLhY7eb3P62gZH8rti/7\niM0OwaE2vvqXw0lfGg10rL2qrKzE6XRSUtIxyBEeHs7SpUs7e0xTUxOJiYk+GeRwuVxs2rQJr9fL\nHXfcoQGGfk5BpI/wek2K81qoLnXhCDaYODucmLiuP6gej4ezZ88SGxvbucj06mbg9Xo7TyLi4+P7\n7CXJiooKtmzZwpAhQ1iwYEGfWjQ7UOjEYXBpa/ZybHsTTbUeIobambIggpDwrj//LS0tnD179ord\n6FwuF2fOnOlXgxymaXLkyBHy8vKYNm0aGRkZnYt0xXfUTwaXuop2Tu5pxu0yOd9yhJ+8/v1rjnnu\nued48sknO46vq6OxsfGK7bAbGxs7Q4kvBjlM02TXrl2UlpaydOlSYmJibv4XlIBSEBnA6urqKCkp\nwel0Ultby9ixY0lOTiYhIaFPjCC4XC727NlDSUkJCxYsYNy4cYEuacDSiYPcikuDHJf6SV8c5Kit\nrWXr1q2Ypsntt9+uaZ1+pH4it+LSIEdJSQllZWVER0d39pPeDnIcPXqUvXv3snjxYt0HqJ9SEBkk\nWlpaKC0txel0cvbsWUaMGNH5wY+Ojra8ntOnT7N9+3aSkpKYM2dOn72fwUChEwfxpdra2s7RzUAP\ncng8Hvbv79i5Jzs7m5SUFE3r9DP1E/EVr9dLRUVFZz+5mUGO8vJycnNzyczM7FwAL/2Hgsgg5Ha7\nOXfuXOfoZmhoaOcHf+TIkX79I97Y2Mj27dupr69n4cKFxMXF+e295E904iD+cmmQo6SkhHPnzlk6\nyFFeXs7WrVuJiYlhwYIF/WodS3+mfiL+crODHL1dxC59h4LIIGeaJlVVVZ0f/JaWls6TiDFjxvRo\n29yapou8lf8Zb+d/Tm1zI6FBwdydksXTc5cyeUR85/scPnyY/Px8UlNTSU9P19xtC+nEQazgdrs5\ne/ZsZz+5NMiRnJzMiBEjejTIcaTyDCt3beSTY/toa29nWEQUf569mG9mLmJoeMf6MZfLxa5duygr\nK2PBggUkJyf7+TeTy6mfCEBz8XEqfvsmFzatx9vaiiNmKCMf/iajHv4mQUNvfR1Zc3Nz50yOngxy\nuFwuNm/ejNvt5s477yQoOIjNJw7yzzs+4UB5CV7TZOLw0TwzfzlfTckiyK7bAvQFCiJyhYaGhs7R\nzaqqqs47LycmJl5327vDFWU8/PY/4HK30+pu7/y53bARZHfwd3d/k5yEFLZs2YLNZmPhwoVaVBYA\nOnEQq93MIMc7+77gpY3v0e5x4zG9nT8PdQQRFhTMqid+RFBjGzt27CA5OZnZs2drWmcAqJ9I1dpV\nlPzd3+B1t3dsz/clIyQUW3AIKSvfI2LyNJ+9X08HOUzTZPfu3RSXnOZTbyU7So/T3N52xWuFB4Uw\ndeQY3vvmXxEeHPj1soOdgoh0qa2tjbKyMpxOJ2VlZcTExHSeSMTGxnKxrYV5v/wRda1d39k92Gbn\nL0am8dBtdzB16lTN3Q4QnThIoDU0NHSeRFxvkGOn8xjfevefrhjQuJwBRDiC+dvxC7njK4s1rTOA\n1E8Gt4sH8jn6/cfxtrZ2eYw9Oob0tdtwREb5/P0vDXJcml7e2tp6zSDHD//rX1l9Ip/2ywY0Lhfi\nCGLxhOm8+bXnfF6f9E5P+4muXw1CISEhTJw4kYkTJ+L1eikvL8fpdLJhwwZsNhuHjUZa3a5uX8Pl\n9XA41MXfpqRYVLWI9EXR0dGkpaWRlpZ2xSDHrl27iImJ4d/O7esyhACYgNs0sU2KVwgRCaCzK3/R\nbQgBMF1tVK//kLivPeHz9zcMg5EjRzJy5Ehmz57dOchx8OBBNm/ezLBRI1lzan+XIQSgzd3OZyeL\nOFNXzdiY4T6vUXxPQWSQs9lsjBkzhjFjxjB//nxqamr45VuvdnvicMnO0mM0uVqJCA61oFIR6euu\nHuQ4evoUR4o+vuHzWj3tvJX/OY9nfsWCKkXkap7mJhrydtzwOG9rC+fff9svQeRq7733Xud/t7e3\n80X+VjxeN9xgvbqJyUeH9vDsgrv9XKH4grYfkCsMGzaMZtPdo2Mddjv1Lc1+rkhE+iObzUbY0GiC\nHT2703JN80U/VyQiXXE31GP0cJF3e90FP1dzraCgIBxR4WC78TRwl8dNxcU6C6oSX9AVEbnGkNBw\nqpsabnic2+MhOjTMgopEpD+KCY2g3eu58YFfHisigWGPjMLswUwIgEavycqVK/1cEWzZsuWK7yuj\nbJijHGDvPow4bHZGRFh/HzW5OQoico2vZ9zO6198REt79+tEZiVMIjJEQURErm9oeCRpcYnsO1vc\n7XHhQcF8Q9OyRALGERlF5MxsLubv6vY4W2gYk7+9gq986ymLKvuTVq+bn1Xto2NlWdfsNht/ljrL\nmqLklimIyDUeTb+NX2xd1+0xYY5gXlj4ZxZVJCL91V9+5T6+9/5vuh3YcNgdPDRjnoVVicjVxj71\nAsf+23fwtrZ0eYxhdzDivkctqeepp64NOxXr3+b3hTu63FAn2O5gbuJkxsWO8nd54iNaIyLXGBoW\nyW8f/yERwaEEXXVzQgODMEcwP855mPnJUwNUoYj0F4smTOe/L7yPsKBgrp5QEWy3ExkSyu++8d+J\n0tVVkYCKzp5HwnM/whYaCldtyW84grCFRzDlN2/hiB4SoArhp0u/TnbCBMKDrr3PUFhQMONiR/Ev\nD60IQGVys3RFRK4ra+wENq/4X7y5+4/8bv9Wmlyt2G127pw8k2fmLydjzPhAlygi/cSK+cuYlTiR\n32z/hM0nD+LxeogMCeObmQv5i9l3Mjp6aKBLFBEg7uvfITItg3P/8S/Ubc3F9HiwhUcw8v7HiHv8\nu4TExQe0vmC7g3ce/0vWHNrDP+/4hKPnzwImCTEj+P68ZTw8cz5h1wkp0nfphobSI26vB7th040L\n+xjdgEz6G9M08ZheHDb7jQ8WS6mfyOVM0wSPB8PRd8esvaYX0+xYFyJ9i25oKD6lkwYR8QXDMHAY\n6icifZ1hGNCHQwiAzbBxzZxP6VcUIUVERERExHIKIiIiIiIiYjkFERERERERsZyCiIiIiIiIWE5B\nRERERERELKcgIiIiIiIillMQERERERERyymIiIiIiIiI5RRERERERETEcgoiIiIiIiJiOQURERER\nERGxnIKIiIiIiIhYTkFEREREREQspyAiIiIiIiKWUxARERERERHLKYiIiIiIiIjlFERERERERMRy\nCiIiIiIiImI5BREREREREbGcgoiIiIiIiFhOQURERERERCynICIiIiIiIpZTEBEREREREcspiIiI\niIiIiOUURERERERExHIKIiIiIiIiYjkFERERERERsZyCiIiIiIiIWE5BRERERERELKcgIiIiIiIi\nllMQERERERERyymIiIiIiIiI5RRERERERETEcoZpmj0/2DCqAKf/yhGRXkoyTXNEoIvoLfUSkT5J\n/UREfKVH/aRXQURERERERMQXNDVLREREREQspyAiIiIiIiKWUxARERERERHLKYiIiIiIiIjlFERE\nRERERMRyCiIiIiIiImI5BREREREREbGcgoiIiIiIiFhOQURERERERCz3/wBDuGWliSLABgAAAABJ\nRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7fd05a8255f8>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'x': 'a', 'w': 'c', 'y': 'd', 'z': 'e'}]\n"
     ]
    }
   ],
   "source": [
    "ag = h.access_graph('actionGraph')\n",
    "instances = ag.find_matching(pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Rewriting rule to Cypher: \n",
      "\n",
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_y:actionGraph { id : 'd'}) , (lhs_z:actionGraph { id : 'e'}) , (lhs_x:actionGraph { id : 'a'}) , (lhs_w:actionGraph { id : 'c'})  , (lhs_x)-[lhs_x_lhs_w:edge]->(lhs_w), (lhs_y)-[lhs_y_lhs_x:edge]->(lhs_x), (lhs_y)-[lhs_y_lhs_z:edge]->(lhs_z), (lhs_z)-[lhs_z_lhs_z:edge]->(lhs_z)\n",
      "\n",
      "// Renaming vars to correspond to the vars of P\n",
      "WITH lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z , lhs_y as p_y, lhs_z as p_z, lhs_x as p_x, lhs_w as p_w \n",
      "\n",
      "// Merging nodes '{'w', 'z'}' of the preserved part into 'w_z' \n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, p_z, p_y, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, p_w, lhs_z_lhs_z\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_w) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_w[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_z, p_y, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, p_w, lhs_z_lhs_z\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(p_z) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in p_z[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, p_z, p_y, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, p_w, lhs_z_lhs_z\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, p_z, p_y, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, p_w, lhs_z_lhs_z\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, p_z, p_y, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, p_w, lhs_z_lhs_z\n",
      "SET p_w = new_props\n",
      "WITH p_w as rhs_w_z, p_z, p_y, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "// set appropriate node id\n",
      "SET rhs_w_z.id = toString(id(rhs_w_z))\n",
      "SET rhs_w_z.count = NULL\n",
      "WITH toString(id(rhs_w_z)) as uid19a8a635c72e449098fdbacc5c3331be, p_z, p_y, rhs_w_z, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_maps, [] as pred_maps, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "OPTIONAL MATCH (rhs_w_z)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(rhs_w_z)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "OPTIONAL MATCH (p_z)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(p_z)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN [id(rhs_w_z),id(p_z)] THEN [toString(el['id'])] ELSE [] END) as self_loops, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, self_loops, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, self_loops, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (rhs_w_z)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(rhs_w_z)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (rhs_w_z)-[new_rel:edge]->(rhs_w_z)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_typings, [] as pred_typings, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "OPTIONAL MATCH (rhs_w_z)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "OPTIONAL MATCH (pred)-[:typing]->(rhs_w_z)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "OPTIONAL MATCH (p_z)-[:typing]->(suc)\n",
      "WITH suc_typings + collect(suc) as suc_typings, pred_typings, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "OPTIONAL MATCH (pred)-[:typing]->(p_z)\n",
      "WITH pred_typings + collect(pred) as pred_typings, suc_typings, p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "FOREACH(suc in suc_typings |\n",
      "\tMERGE (rhs_w_z)-[:typing]->(suc))\n",
      "FOREACH(pred in pred_typings |\n",
      "\tMERGE (pred)-[:typing]->(rhs_w_z))\n",
      "DETACH DELETE (p_z)\n",
      "\n",
      "\n",
      "// Adding node 'new_node' from the rhs \n",
      "CREATE (rhs_new_node:actionGraph) \n",
      "SET rhs_new_node.id = toString(id(rhs_new_node)) \n",
      "WITH toString(id(rhs_new_node)) as rhs_new_node_id , p_z, p_y, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, p_x, rhs_new_node, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z\n",
      "\n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH p_z, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, rhs_new_node_id, rhs_new_node, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, lhs_z_lhs_z , p_x as rhs_x, p_y as rhs_y \n",
      "\n",
      "// Adding properties to the node 'w_z' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_w_z) THEN [1] ELSE [] END |\n",
      "\tSET rhs_w_z.name = ['Paul'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_w_z) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Paul'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_w_z.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_w_z.name = rhs_w_z.name + [val])))\n",
      "// Adding properties to the node 'x' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'age' IN keys(rhs_x) THEN [1] ELSE [] END |\n",
      "\tSET rhs_x.age = [10])\n",
      "FOREACH(dummy IN CASE WHEN 'age' IN keys(rhs_x) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in [10] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_x.age THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_x.age = rhs_x.age + [val])))\n",
      "// Adding properties to the node 'new_node' from the rhs \n",
      "FOREACH(dummy IN CASE WHEN NOT 'name' IN keys(rhs_new_node) THEN [1] ELSE [] END |\n",
      "\tSET rhs_new_node.name = ['Will'])\n",
      "FOREACH(dummy IN CASE WHEN 'name' IN keys(rhs_new_node) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['Will'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_new_node.name THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_new_node.name = rhs_new_node.name + [val])))\n",
      "// Adding edge 'new_node->y' from the rhs \n",
      "MERGE (rhs_new_node)-[rhs_new_node_rhs_y:edge {  }]->(rhs_y)\n",
      "\n",
      "\n",
      "// Adding properties to the node 'new_node' from the rhs \n",
      "WITH p_z, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, rhs_new_node_id, rhs_new_node, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, rhs_x, rhs_y, lhs_z_lhs_z MATCH (rhs_x)-[rhs_x_rhs_w_z:edge]->(rhs_w_z)\n",
      "FOREACH(dummy IN CASE WHEN NOT 'relation' IN keys(rhs_x_rhs_w_z) THEN [1] ELSE [] END |\n",
      "\tSET rhs_x_rhs_w_z.relation = ['brothers'])\n",
      "FOREACH(dummy IN CASE WHEN 'relation' IN keys(rhs_x_rhs_w_z) THEN [1] ELSE [] END |\n",
      "\tFOREACH(val in ['brothers'] |\n",
      "\t\tFOREACH(dummy IN CASE WHEN NOT val IN rhs_x_rhs_w_z.relation THEN [1] ELSE [] END |\n",
      "\t\t\tSET rhs_x_rhs_w_z.relation = rhs_x_rhs_w_z.relation + [val])))\n",
      "WITH p_z, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, rhs_new_node_id, rhs_x_rhs_w_z, rhs_new_node, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, rhs_x, rhs_y, lhs_z_lhs_z \n",
      "\n",
      "WITH p_z, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, rhs_new_node_id, rhs_x_rhs_w_z, rhs_new_node, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, rhs_x, rhs_y, lhs_z_lhs_z OPTIONAL MATCH (new_node_metaModel:node:metaModel {id:'a'})\n",
      "MERGE (rhs_new_node)-[:tmp_typing]->(new_node_metaModel)\n",
      "// Return statement \n",
      "RETURN p_z, rhs_w_z, uid19a8a635c72e449098fdbacc5c3331be, rhs_new_node_id, rhs_x_rhs_w_z, rhs_new_node, lhs_y_lhs_x, lhs_x_lhs_w, lhs_y_lhs_z, rhs_x, rhs_y, lhs_z_lhs_z\n",
      "\n"
     ]
    },
    {
     "ename": "DatabaseError",
     "evalue": "org.neo4j.values.storable.NoValue cannot be cast to org.neo4j.values.virtual.NodeValue",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mDatabaseError\u001b[0m                             Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-20-0ab754fc6582>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0mag\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mh\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0maccess_graph\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'actionGraph'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 2\u001b[0;31m \u001b[0mag\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrewrite\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrule\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0minstances\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mrhs_typing\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mrhs_typing\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m/home/johnpaul/anaconda3/lib/python3.5/site-packages/ReGraph-1.0-py3.5.egg/regraph/neo4j/graphs.py\u001b[0m in \u001b[0;36mrewrite\u001b[0;34m(self, rule, instance, rhs_typing)\u001b[0m\n\u001b[1;32m    714\u001b[0m         \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    715\u001b[0m         \u001b[0;31m# Execute query\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 716\u001b[0;31m         \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mexecute\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    717\u001b[0m         \u001b[0;31m# Retrieve a dictionary mapping the nodes of the rhs to the nodes\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    718\u001b[0m         \u001b[0;31m# of the resulting graph\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/johnpaul/anaconda3/lib/python3.5/site-packages/ReGraph-1.0-py3.5.egg/regraph/neo4j/graphs.py\u001b[0m in \u001b[0;36mexecute\u001b[0;34m(self, query)\u001b[0m\n\u001b[1;32m     74\u001b[0m         \u001b[0;34m\"\"\"Execute a Cypher query.\"\"\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     75\u001b[0m         \u001b[0;32mwith\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_driver\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msession\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 76\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     77\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     78\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/johnpaul/anaconda3/lib/python3.5/site-packages/neo4j_driver-1.6.0b1-py3.5-linux-x86_64.egg/neo4j/v1/api.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, statement, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    335\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhas_transaction\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    336\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 337\u001b[0;31m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    338\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    339\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/johnpaul/anaconda3/lib/python3.5/site-packages/neo4j_driver-1.6.0b1-py3.5-linux-x86_64.egg/neo4j/bolt/connection.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    288\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    289\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 290\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    291\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    292\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0maddress\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/johnpaul/anaconda3/lib/python3.5/site-packages/neo4j_driver-1.6.0b1-py3.5-linux-x86_64.egg/neo4j/bolt/connection.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    328\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_last_run_statement\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    329\u001b[0m             \u001b[0mlog_debug\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"S: FAILURE (%r)\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 330\u001b[0;31m             \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mon_failure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msummary_metadata\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    331\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    332\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_last_run_statement\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/johnpaul/anaconda3/lib/python3.5/site-packages/neo4j_driver-1.6.0b1-py3.5-linux-x86_64.egg/neo4j/v1/result.py\u001b[0m in \u001b[0;36mon_failure\u001b[0;34m(metadata)\u001b[0m\n\u001b[1;32m     69\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0macknowledge_failure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     70\u001b[0m             \u001b[0mon_footer\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 71\u001b[0;31m             \u001b[0;32mraise\u001b[0m \u001b[0mCypherError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m**\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     72\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     73\u001b[0m         \u001b[0mrun_response\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mon_success\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mon_header\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mDatabaseError\u001b[0m: org.neo4j.values.storable.NoValue cannot be cast to org.neo4j.values.virtual.NodeValue"
     ]
    }
   ],
   "source": [
    "ag = h.access_graph('actionGraph')\n",
    "ag.rewrite(rule, instances[0], rhs_typing=rhs_typing)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "h._propagation_down('actionGraph')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Removing a graph from the hierarchy"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can also remove a graph from the hierarchy. All its nodes and connections (edges and typing edges) are removed."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "#h.remove_graph('MetaModel')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "#here we clear the hierarchy\n",
    "#h.clear()\n",
    "#h.drop_all_constraints()\n",
    "#h.close()\n",
    "#"
   ]
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python [default]",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
