{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "\n",
    "from regraph import Rule, plot_rule\n",
    "from regraph.neo4j.graphs import Neo4jGraph\n",
    "from regraph.neo4j.cypher_utils import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "g = Neo4jGraph(\"bolt://localhost:7687\", \"neo4j\", \"admin\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "res = g.clear()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7eff205f06a0>\n",
      "<neo4j.v1.result.BoltStatementResult object at 0x7eff205f07b8>\n"
     ]
    }
   ],
   "source": [
    "nodes = [\"a\", \"b\", \"c\", \"d\", \"e\", \"f\"]\n",
    "edges = [(\"a\", \"b\"), (\"d\", \"b\"), (\"a\", \"c\"), (\"e\", \"a\"), (\"f\", \"d\")]\n",
    "g.add_nodes_from(nodes)\n",
    "g.add_edges_from(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7eff20a80f60>\n"
     ]
    }
   ],
   "source": [
    "g.add_node(\"x\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7eff205f0080>\n"
     ]
    }
   ],
   "source": [
    "g.add_edge(\"x\", \"c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7eff205f0278>\n"
     ]
    }
   ],
   "source": [
    "g.remove_edge(\"x\", \"c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7eff205f02b0>\n"
     ]
    }
   ],
   "source": [
    "g.remove_node(\"x\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['e', 'f', 'a', 'b', 'c', 'd']"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('e', 'a'), ('d', 'b'), ('a', 'b'), ('a', 'c'), ('f', 'd')]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.edges()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' }) WITH [] as ignoredNodes, x OPTIONAL MATCH (x)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(x) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x OPTIONAL MATCH (same_id_node:node { id : 'a'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, x WITH same_id_node, same_id_node_new_count, 'a' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as uid, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x MERGE (new_node:node {id : uid }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (new_node)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(new_node)) RETURN uid \n",
      "Created clone by the name:  a1\n"
     ]
    }
   ],
   "source": [
    "res_clone_1 = g.clone_node('a')\n",
    "print(\"Created clone by the name: \", res_clone_1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' }) WITH [] as ignoredNodes, x OPTIONAL MATCH (x)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(x) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x OPTIONAL MATCH (same_id_node:node { id : 'a_clone'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, x WITH same_id_node, same_id_node_new_count, 'a_clone' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as uid, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x MERGE (new_node:node {id : uid }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (new_node)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(new_node)) RETURN uid \n",
      "Created clone by the name:  a_clone\n"
     ]
    }
   ],
   "source": [
    "res_clone_2 = g.clone_node('a', 'a_clone')\n",
    "print(\"Created clone by the name: \", res_clone_2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "res_merge = g.merge_nodes([\"a\", \"b\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'a_b'"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res_merge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", \"y\", \"z\", \"a\"])\n",
    "pattern.add_edges_from([(\"x\", \"y\"), (\"y\", \"z\"), (\"z\", \"z\"), (\"z\", \"a\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node), (y:node), (z:node), (a:node), (x)-[:edge]->(y), (y)-[:edge]->(z), (z)-[:edge]->(z), (z)-[:edge]->(a) RETURN x, y, z, a\n",
      "Instances:  [{'x': 'a1', 'y': 'd_c', 'z': 'a_b', 'a': 'd_c'}, {'x': 'a_clone', 'y': 'd_c', 'z': 'a_b', 'a': 'd_c'}, {'x': 'e', 'y': 'a1', 'z': 'a_b', 'a': 'd_c'}, {'x': 'e', 'y': 'a_clone', 'z': 'a_b', 'a': 'd_c'}]\n"
     ]
    }
   ],
   "source": [
    "instances = g.find_matching(pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "clone_name1, _ = rule.inject_clone_node(\"y\")\n",
    "clone_name2, _ = rule.inject_clone_node(\"y\")\n",
    "rule.inject_remove_edge(clone_name2, \"z\")\n",
    "rule.inject_remove_node(\"x\")\n",
    "rule.inject_merge_nodes([\"y\", \"a\"])\n",
    "rule.inject_add_node(\"new_node\")\n",
    "rule.inject_add_edge(\"new_node\", \"z\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzt3Xl8VPW9N/DP78ySneyTbRISyCQh\nkAAhkV0WcQlYlKLWonLxKVioXK+9rU9bb6vVp/XeWpdqFyv2WisiFUG0VgoIDRBAZA2ENRNIQvY9\nkG328/wRmbImA5JzZpLP+/XK62UyZybfBPOd8zm/5QhZlkFERERERKQkSe0CiIiIiIho8GEQISIi\nIiIixTGIEBERERGR4hhEiIiIiIhIcQwiRERERESkOAYRIiIiIiJSHIMIEREREREpjkFkABFClAsh\nZl32telCiKqrHLtNCLH4os+fFkKUCSE6hBBVQogPlKiZiHzTV/2m+6ueUS+E+LMQIljtuojIu1zW\nK+qEEO9c6BVf/fcvLjs+WQghCyG0X31uFEKsE0I0CSHOCSGKhRCLVPhRqB8wiBCEEP8G4BEAs2RZ\nDgaQC2CrulURkQ/4xlc9IwdAHoCfqlwPEXmnC71iDICxAH5yHc9dCaASwFAAkQAWAqi/6RWSKrRq\nF0BeIQ/AJlmWTwOALMt1AFaoWxIR+QpZlquFEP8AMErtWojIe8myXCeE2ISeQOKpPADfl2W586vP\nD938ykgtHBEhANgDYKEQ4ikhRK4QQqN2QUTkO4QQiQBmgycIRNQLIYQRQD6A0ut42h4AvxdCPCiE\nSOqfykgtDCKDQ7wQou3iDwBTLjwoy/J7AP4dwJ0AtgNoEEL8WKVaich3fPxVP9mJnt7xgsr1EJF3\n+lgI0Y6eKVYNAJ696LEfXnZ+cuSy594PoBDAzwCUCSGKhBB5ilRN/Y5BZHCokWU57OIP9Jw4uMmy\nvEqW5VkAwgAsBfC8EOJONYolIp9x71c9Zagsy9+TZblb7YKIyCvdK8tyCIDpADIARF302EuXnZ9k\nX/xEWZZbZVn+sSzLIwHEAChCT7ARCtVO/YhBhC4hy7JdluUP0XNFgvO9iYiI6KaQZXk7gHcAvHSD\nz2/66rnxACJuXmWkFgaRgUcnhPC/8AEPNiQQQiwSQswRQoQIISQhRD6AkQC+7PdqiYiIaDD5DYDb\nhRAeLVgXQvxKCDFKCKEVQoQAWAagVJbl5n6tkhTBXbMGng2Xfb7Lg+ecB/A0gPcAaABUAFgmy/LO\nXp9FREREdB1kWW4UQryLnjUf7R48JRDAegBxALrRc5F0bv9VSEoSsiyrXQMREREREQ0ynJpFRERE\nRESKYxAhIiIiIiLFMYgQEREREZHiGESIiIiIiEhx17VrVlRUlJycnNxPpRDR9Tpw4ECTLMvRatdx\nvdhLiLwP+wkR3Sye9pPrCiLJycnYv3//jVdFRDeVEKJC7RpuBHsJkfdhPyGim8XTfsKpWURERERE\npDgGESIiIiIiUhyDCBERERERKY5BhIiIiIiIFMcgQkREREREimMQISIiIiIixTGIEBERERGR4hhE\niIiIiIhIcQwiRERERESkOAYRIiIiIiJSHIMIEREREREpjkGEiIiIiIgUxyBCRERERESKYxAhIiIi\nIiLFMYgQEREREZHiGESIiIiIiEhxDCJERERERKQ4BhEiIiIiIlIcgwgRERERESmOQYSIiIiIiBTH\nIEJERERERIpjECEiIiIiIsUxiBARERERkeIYRIiIiIiISHEMIkRENGC89dZbyM7ORlZWFrKzs/He\ne++pXRIR+Sj2k/6nVbsAIiKim8VkMmH79u0IDw9HVVUVxowZgylTpiA5OVnt0ojIx7Cf9D+OiBAR\nkc958cUXsXz5cvfn9fX1iImJwS233ILw8HAAgNFoRFxcHKqqqtQqk4h8APuJehhEiIjI5yxZsgRr\n165FR0cHAGDFihVYsGABAgMD3cds27YNbW1tGDdunFplEpEPYD9RD4MIERH5nPDwcMydOxcrV66E\nw+HAW2+9hWXLlrkfP378OBYuXIjVq1cjICBAxUqJyNuxn6iHa0SIiMgnPfHEE1iwYAEMBgNGjBiB\ntLQ0AIDZbMbs2bPx5ptvYsqUKSpXSUS+gP1EHRwRISIinzRq1ChERkbiySefxOOPPw4AOHPmDO68\n8068/vrryM/PV7lCIvIV7CfqYBAhIiKftXjxYkiShDlz5gAAfvSjH6G5uRnPPPMMxowZgzFjxmDT\npk0qV0lEvoD9RHmcmkVERD6roKAAy5cvh0ajAQB8+OGHKldERL6K/UR5HBEhIiKfU1NTg/T0dJjN\nZvc0CiKiG8F+oh6OiBARkc+Jj4/HqVOn1C6DiAYA9hP1cESEiIiIiIgUxyBCRERERESKYxAhIiIi\nIiLFcY0IERH5vG5bNw6W7kOntRPRQ6KRnTIWGkmjdllE5IMa2upx7GwxXC4nhsWmIiV2uNolDVgM\nIkRE5LNsDhve+Ox1fLbvY0iSBpBlQAB+On98546lmDv+m2qXSEQ+oq61Fr9e90scLjsIrUYHQIbT\n5URi9FD88JtPIzNxlNolDjicmkVERD7J4XTgP//0OP6+bz0sdgu6rJ3osnWhy9qF1o4W/O7TV/C/\nm/+odplE5ANqW2qw+PWHcaB0L2wOW08/sXbBareitKYE//HmUhwuO6R2mQMOgwgREfmkT/asw6mq\nE7DarVd93GK34K87VuJMXanClRGRr/nvD59DR3c7XLLrqo9b7Rb8bOX/hdPlVLiygY1BhIiIfI4s\ny1i9YyWsdkuvx9kdDqwpfF+hqojIF9W0VOP42eJrhpALbA4r9pzcpVBVgwODCBER+Zy2zla0tjf3\neZxLdmKfeY8CFRGRrzpSdsijzS26rF3YW8J+cjMxiBARkc9xOB2QJM/ewjiVgoh643A6IHt8rL1f\naxlsGESIiMjnhAdH9OyS5YFhMdx6k4iuLcXDHuGvD0BaQkY/VzO4MIgQEZHP0Wq0+MYt86DT6Ho9\nLkAfgAdvfUShqojIF2UmjUJEcESfx8myC7ePvUuBigYPBhEiIvJJC6YtRHBAMCRx9bcyvVaPdGMm\nck3jFa6MiHyJEAI//ObT8NP5XfMYf50/vnPHMgT6BSlY2cDHIEJERD4pIiQSbzz+DhIiExGgD4CA\nAABoJS30Wj/kpU3Ei4++5vFaEiIavHJN4/HcQ/+DQL8gBOgD3V/31/lDr/XDo7c/hgdvfVjFCgcm\n3lmdiIh8VnxEAt774VocKS/ClqKNON91DvERCZiddw8So5LULo+IfMikEVPxt2c+x7birdhX8gWc\nLhcyE0fiznF3IyQgRO3yBiQGESIi8mlCCIxOGYvRKWPVLoWIfJxeq8cdY/Nxx9h8tUsZFDheTURE\nREREimMQISIiIiIixTGIEBERERGR4hhEiIiIiIhIcQwiRERERESkOAYRIiIiIiJSHIMIEREREREp\njkGEiIiIiIgUxyBCRERERESKYxAhIiIiIiLFMYgQEREREZHiGESIiIiIiEhxDCJe5qGHHkJubi6y\nsrIwb948tLa2ql0SEfko9hMiIvJmDCJe5rXXXsP+/ftRXFyMkSNH4le/+pXaJRGRj2I/ISIib6ZV\nuwC61LvvvotVq1bBZrOhs7MTaWlpapdERD6K/YSIiLwZR0S8SGFhId544w1s3LgRxcXF+MUvfgGL\nxaJ2WUTkg9hPiIjI2zGIeJG2tjaEhoYiMjISVqsVb7/9ttolEZGPYj8hIiJvxyDiRfLz8zF8+HBk\nZGQgPz8fOTk5apdERD6K/YSIiLwd14h4Ea1Wiw8++EDtMohoAGA/ISIib8cRESIiIiIiUhyDCBER\nERERKY5BhIiIiIiIFMcgQkREREREimMQISIiIiIixXHXLC/TUXcGHbVmCI0W4cNyoA8OV7skIvJB\nssuFtjOHYDnfAF3gEESk3gJJq1O7LCIiIjcGES/ReuYgjq76GdqrT0HS6AABuOw2xIy9A6Me+gX8\nQiLVLpGIfMTZHe/j1McvwWHthIDo+aKQMOzOJTDNeQJC0qhbIBERERhEvELTiV3Y9/oiOG3dAACX\n3eJ+rO7gP9Bauh9Tn93IMEJEfTqx9r9RvvVtdz+52OkNf8D5s8cxbtmbEBJn5hIRkbr4TqQyl8OG\n/X9YctWTBgCQnQ5Yzzfi6MqnFa6MiHxNW1nRNUMIADht3Wg8uh01+z5VuDIiIqIrMYiorO7gRsgu\nZ6/HyE4H6g9vga29RaGqiMgXnd70Jpx2a6/HOG1dOL3h9wpVREREdG0MIiqrK9oMp6Wzz+MkrR4t\npfsUqIiIfFXTsR2A7OrzuPPVJ/sMLPQvRUVFmDx5MgIDA3HfffepXQ4R+TD2k0sxiKjM5fHJgAyX\nw96vtRCRb+trdPUCIUmQ2U88ZjAY8Morr+DVV19VuxQi8nHsJ5diEFFZ6NAsSDq/Po+TXU4Ex6Uq\nUBER+apAQ7JHx2n9g6HxD+rfYnzQiy++iOXLl7s/r6+vR0xMDMLCwjB+/Hj4+fXdq4mIAPYTTzGI\nqCxx6oOA3PdxAVFJGGLM6P+CiMhnDb/zu9D4BfZ+kEaH5JmLIIRQpigfsmTJEqxduxYdHR0AgBUr\nVmDBggUIDOzjd0pEdBn2E88wiKjMP9SA5NsehUYfcM1jXJIWARMWKVcUEfmkuNw5CIxKgtDor/q4\nCwJOyQ8hY+5RuDLfEB4ejrlz52LlypVwOBx46623sGzZMrXLIiIfxH7iGQYRXHv4rKurS5HvP+K+\npzF0+kJIWj0k7b9OIFySDg5oUG64A8W1VrS2tipSDxHdODX7iaTVY+KP1iIsJbvn4oboafEyevpJ\npxyA6tSHsGtfEZxOz9aTDDZPPPEE3njjDXzyyScYMWIE0tLS1C6JBoHr7RsPPfQQcnNzkZWVhXnz\n5vH8wEuxn/SNQQTqD58JSULmt36Gmf+zG8NnPw7D6FmIHnMnukxzcTp9GYpqHbBardi+fTtcrr53\nxCEi9ajdT/RBYZj8k48x8UfrkDRtAQzZMxExejZa0h7Esbj7cfJsI1pbW3Hw4EFF6vE1o0aNQmRk\nJJ588kk8/vjjapdDg8T19o3XXnsN+/fvR3FxMUaOHIlf/epXSpZLHmI/6RvvrI5Lh8+WLFmCt956\nC1u2bFG8Dv/wWKTf8wP351GnT+P81q2IiYlBaWkpdDodjhw5gjFjxiheGxF5xlv6SVhyNsKSs92f\n27dtg+XkSRQVFaGurg5FRUVISUlBVFSU4rV5u8WLF+Ppp5/GnDlzAADl5eWYMmUKurq6YLFYYDQa\n8dxzz+E73/mOypXSQHG9fePdd9/FqlWrYLPZ0NnZySvtXoz9pHcMIl954oknsGDBAhgMBq8ZPhs+\nfDjOnDkDp9OJQ4cOobGxEfv378fQoUMRHh6udnlEdA3e2E8mTpyIqqoqpKWlobi4GOHh4di2bRvm\nzZsHjUajdnlepaCgAMuXL3f/XpKTk1FVVaVyVTTQedo3CgsL8cYbb2D37t2Ijo7G+++/jxUrVihc\nLXmK/aR3nJr1FW8dPpsyZQoCAwORlpaG06dPu6doybIHW20RkSq8sZ/4+fnh1ltvRXBwMBISEmA2\nm9HS0oJDhw6pXZrXqKmpQXp6Osxms9f8u9Hg4WnfaGtrQ2hoKCIjI2G1WvH2228rWCV5iv3EMwwi\nF1m8eDEkSXIPn3mDgIAATJ48GUOGDIHBYEB1dTVyc3O59SaRl/PGfpKUlIS0tDQYjUbYbDa4XC6v\nGK3xFvHx8Th16hS2b9/OLTZJFZ70jfz8fAwfPhwZGRnIz89HTk6OghWSp9hPPMOpWRe5fPjMW6Sm\npuLMmTMwmUyoqamB3c47IhN5O2/tJxMnTkR9fT0eeeQRlJaWel19RIOZJ31Dq9Xigw8+ULAqov7D\nIIKe4bMZM2YgNjYWr7/+utrlXNWsWbMgSRLq6+vx+eefIy4uDv7+/mqXRUSX8fZ+4ufnh/vvvx+S\nJMHf3x+FhYW466671C6LaFDz9r5B1F8YRPCv4TNvJkk9s+hiYmKQmpqKXbt24bbbblO5KiK6nC/1\nk7Fjx2L9+vUoKSnhFC0iFV2tbzz//PP46KOPrjh28+bNMBgMSpVG1K+4RsQH5ebmoqmpCWVlZWqX\nQkQ+TJIkTJ8+HXv27FHsBq6+RpZldFo6YHPY1C6FBplnnnkGRUVFV3wwhPguh9OBju4OOF28oewF\nHBHxQVqtFtOmTcOWLVs4RYuIvpbIyEhkZmZix44dnKJ1kabzjfjrjvfw973rYXP0LOzPMGbi4ZmP\nYvKIW7lhCBF57ETlMbz7z7ex5+TOr3qHwLRRM/HwjEcxPC5V7fJUxRERHxUbG4vhw4dj9+7dapdC\nRD4uJycHHR0dMJvNapfiFU7XlmLhyw/go90foMvaBYfTAZfswvHKo3h+9U/xyvr/4RbqROSRT/d+\njCfefAy7T+yA0+WEw+mAw2lHwZHPsfT3i1B4dJvaJaqKQcSH5eXlobGxEeXl5WqXQkQ+7MIUrS++\n+GLQT9GyOWz4/lvL0GFph8PpuOJxi60bmw5+hg37/6ZCdUTkS05VncDrf/s1rHbrFRcvXLILVrsF\n/++vP0V18+C9wSGnZgHotHRg08EN2H2iEA6nHenGTNw74T7ERcSrXVqvLp6iFRsbyylaRF6gtqUG\nH+9Zi1NVx6HV6DBpxFTcNW4OAv2C1C6tV1FRUcjMzERhYSHuvPNOtctRzY6j/4TVbu31GIvdgr9s\n+RNm587lFC3qN7Iso7j8MD7d+xHq2+oQGhiG2blzcUv6RGgkbrvtC1Zte6fP9WUOlxNrd/0V/zH3\nhwpV5V0GfRDZdmQrfrnmWQj0vLkAwJHyIqzb9VfMzr0HT97zlHuHGW908RStmTNnql0O0aDlcrnw\nm09exIb9f4NLdrmvph8pL8IbG17Hfz3wHKZne/dOdzk5Ofjoo49gNpthMpnULkcVn+39BN22vkeF\n2jpbUdFQhuSYYQpURYNNW2cbnvrf5ahorIDVbnFfTd9n3oPggCF4dckfkBiVpHKV1BtZlrHz2PY+\np3E6nHZ8fugfgzaIeO8ZtgL2lezBL9c8A6vd4g4hQM+uBjaHDRsPfIrf/f1VFSv0TF5eHhoaGjhF\ni0hFv/v7q9h44O+wOWyXTOmx2LphtVvwyzXPYF/JHhUr7BunaAHnu897dJxGo0V7d3s/V0ODkc1h\nw7//cQlO15bCYuu+5ES2y9qFxnP1+N7v/w9aO1pUrJL6Ynfa4ZQ92x3LYuvu52q816AOIr/5at7e\ntVjsFvzty3VoOt+kYFXXT6vVYvr06di5cyes1t6nFBDRzdd0vgmffLnukgsal7ParXjtb79WsKob\nExUVhREjRqCwsFDtUlQRGhDm0XEOpx2RIZH9XA0NRtuObEFDWx0crivXKAE9V9q7rJ1YU/i+wpUp\nJzk5GUePHlW7jK9FIzTQaXQeHRsSMKSfq/FegzaIlFSfROO5Bo+O3bDvk36u5uuLjY3FsGHDLtlF\n6+TJk0hMTERFRQUA4Oc//zkefPBBAMCGDRswZswY94der8cnn3j/z0nkjT7b9zE8WSnQcK4BJdUn\n+72erysnJwft7e0oLS3t89iB0Es6Oztx+PBhrF27FgY5HnqtX5/PSYhMRHykUYHqaLD564730N3H\nFXK7046P96wdcLu3XegnNTU1mD9/vk/2k6amJuzevRvvv/8+0iNHQhK9n2rrtXrMHf9NharzPoM2\niFQ2ne3zfw6gZ4h09+FdKCsrg8Nx9asT3uKWW25BfX29O3hkZGTghRdewLe+9S1s3rwZq1evxooV\nKwAAs2fPdt8c6fHHH0dubu6gXqBK9HWcri316IZ3kpBQ2XRWgYq+Ho1Gg2nTpnk0RctXe4ndbofZ\nbMaGDRuwdu1anDt3DpMnT8ZTi3+MmLCYXhcD++n88NhdjytYLQ0mtS3VHh3XbenCpi2bUFpaCovl\n6qOxQgi88MILyMvLw7Bhw7Bu3Tr3Y19++SVmzJiBcePGYdy4cfjss88AAD/5yU/w61/3jN6uWbMG\nkiShoaHnwu3s2bOxefPma9a0aNEiLF26FDNnzoTJZMLChQvdYam+vh7z5s1DdnY2srKy8O6777qf\nV1hYiKysLPz85z/Hrbfeiri4OHz7299Gbm4uUlJSkJ+fj7y8PIwePRp//vOfPfr9KKmzsxNFRUX4\n8MMP8fnnn0Ov12Pu3Ln4ycJnoNfqe32uTqPDPRPmK1Sp9xm0i9U9HS4DgLaWNmzatAk6nQ4JCQlI\nTk7G0KFDERAQ0I8VXr8Lu2ht3boVsbGx8PPzwyOPPIKtW7fi3nvvRWFhIYYMuXT4b9OmTXj55ZdR\nWFjIXbeIbpCfrvc3mgtcLifsVns/V3NzREdHIyMjAzt37sQdd9zR5/G+0EtkWUZNTQ1KSkpQUVGB\n2NhYZGRk4I477oBW+6+3w9889kcsf2MxWjtbL5m7rZE00Gq0eOyu5Zg0YqoaPwINAhqNZ6dmLtmF\nY0eP4WxZz8WN6OhoJCYmwmg0wmAwuDfaGTJkCPbt24ddu3bhgQcewPz589HW1oalS5diw4YNiIuL\nQ21tLfLy8nD06FHcdttteOmll/DUU09h69atmDBhAv75z39i/vz5+PLLLzFlypRe6zp69Ci2bNkC\nSZIwduxYbNmyBbfffjueeOIJjBo1CuvXr0dtbS1ycnKQk5MDk8mEBx98EKtWrcL06dOxZs0a/Pa3\nv8Vf/vIX7N69G3fffTdWrVqFjIwMtLe3Izc3FxMnTkRGRsbX+0V/TXa7HWVlZTCbzWhqasKwYcMw\ndepUxMbGuo8JRShe+LeX8V/v/hAOlxP2iy5Y6bV+0Gl1eHnx7xAxiKd5DtogMjplLBzOvk8IhEug\n7ngDPvziQ8TFxSEpKQklJSXw9/dHbGysO5SEhoYqUHXf4uLi3FO0ZsyYAZvNhmPHjiEsLAz19fWX\nHHv48GEsXboUmzZtQnR0tEoVE/m+yZnTsOPotj53W3I4Hag+UYvVp1fDaDQiMTER8fHx0Os9CzJK\nu7CLVmlpKVJTr333X2/vJS0tLTCbzSgtLUVAQADS0tIwYcKEa15Mig414C//uQZbD2/CBzveQ8O5\neug0ekzOvBUPTF2AYbGD+07I1L/Gp0/C1qJNcMmuXo/TWHVYv249goKCEB8fj8TERNTV1eHgwYPQ\n6/UwGnumDt59990AgAkTJqCmpgYWiwW7d+9GWVkZ8vPz3a8nhEBpaSkmT56MBx54ADabDbt27cJL\nL72EtWvXIiEhAVlZWQgMDOy1rnvvvdd9MSInJwenT5/G7bffji1btuDll18G0HOuMmfOHBQUFMDl\nciEwMBDTp08HAKSnp0MIgd/+9rdobW3FiRMn3NPKAcBqteLEiROqBBFZllFdXQ2z2YyKigrExcVh\nxIgRGDp0KDSaq4+i5prG470frsPHX6zFPw58ik5LJ0ICh+Ce8d/EN26Zh7DgcIV/Cu8yaINIaFAY\nJmdOQ+GxgqvetOoCvdYP9876NpqbmlFRUYGDBw/CarUiPDwcRqMRCQkJCAsLw6OPPuo1JxO33HIL\n1q5di4qKCrzyyisYN24c3nnnHeTn52P37t0wGo2orq7G/PnzsXLlSqSlpaldMpFPm5I5DXqtDt29\nzM7SarS4deRMfOehxWhpaUFVVRWOHTuGgoICREVFua9kRkZGes29KTQaDaZPn46NGzciISHhqifu\n3tpLuru7UVpaCrPZjO7ubphMJsyePRvh4Z696fvr/TEn7x7MybunnyslutS3pj7U5/1stEKLiUNv\nhTEjGdXV1aisrMSePXvQ1dUFg8GAhIQENDY2AgA2btyIxx57zH2i7HA4IMsysrOzsWPHjqu+/ujR\no7F69WrExcVhxowZ+MEPfgCj0ejRbQIuHhHVaDSXTGu/vLcJIS5Z53KhnwQFBSE5ORmyLCMqKgpF\nRUV9ft/+1NLSgpKSEpSWliIoKAgmkwkTJ070ePQ3OtSAJXd9D0vu+l4/V+p7Bm0QAYAfzPsxTlYe\nQ+P5hquGEX+dP56e9zz8bAEoLy9HbGwsZFnG+fPnUVlZicrKSpw4cQLh4eEIDAxEdnY2hg4dirAw\nz3Zd6S8Xpmi9+OKLKCgowN69e+Hv749nn30W3/72t1FQUIA//elPaGxsxPLly93Pe/XVVzFjxgwV\nKyfyTVqNFi/828v4wZ+WX3XnLK1Gi+ghBvznvB8BACIiIhAREYHs7Gw4HA7U1NSgqqoKW7duhc1m\nc4+WXOvkX0nR0dFIT09HYWHhVadoeVMvcTgcqKiogNlsRl1dHZKTkzF+/HjEx8d7Tbgj6ktaQgYe\nnvEo3it4B9ar9BN/nT8mZ96KJdOXo6qqCgaDAUlJPfcU6ejoQEVFBWpqatwn70eOHMGBAweQlZXl\nfo1JkybBbDajoKDA/be6b98+5ObmQgiB2267Dc8++yyWLl0KPz8/GI1GvPPOO1i1atUN/1yzZs3C\nihUr8Nxzz6Gurg4bNmzA97//faSmpqK7uxs7duxAQUEBampq0N3djfnz57tP9FeuXIlHHnkEQM9G\nPPHx8VdMNb/Zurq63BczrFYrUlNTcffdd6t+jjfQiOvZcSE3N1fev39/P5ajvPau8/jdZ69ia9Fm\n6DRaQAjYHTZkJo3Cv3/jBzDFp7uPbWlpQXl5OcrLy9HU1LOlb2dnJ2JjY9HW1obKykoAgMFgwOjR\no5GSkqLqtItdu3bBbre7hztp4BFCHJBlOVftOq7XQOwlQM9ufL/99BWcqDwKnVYPyDLsTgduG3MH\nls/5PkIC+37jbG9vR2VlJaqqqlBTU4MhQ4YgMTERiYmJl8z7VpLT6cRHH32EnJwcDB8+XPHv3xtZ\nllFXV4eSkhKUl5cjOjoaJpMJKSkpl6z7oL6xn3iXzw9txJ82/QGtna3QSBrIsgs6rR4PTV+EB6Ys\nuKQXdHV1oaqqyv1hsVjgcrmwbNkyPP/887BYLKitrcWf//xnrFy5ElOnTkVDQwOeeuoptLa2wmaz\nYdiwYfj0008hSRK++OILTJo0CXv37kVeXh5efPFFPP/882htbYVOd+01tosWLUJubq77wsTFn9fX\n1+O73/0uzpw5A1mW8dRTT2FZj7LKAAAOsUlEQVThwoUAeharf+9730NAQABmzpyJ1atX47PPPsOo\nUaNgNpvx5JNPorKyEk6nEzExMVizZg2ioqJu+u/c4XCgvLwcZrMZ9fX1SE5ORlpaGuLi4ngx4zp5\n2k8GfRC5oNPSgVPVJ+F0OpAUnYyY8Nhej+/o6HCHkunTpyM4OBidnZ2oqKhAcXExTp06BaBndMJk\nMiE1NRWJiYmKTruw2+1Yt24dJk2a5L5aQgMLTxy8U31rHc42lkOj0SI9IQNB/sE39Doulwv19fXu\nYHL+/Hn3XPDExEQEB9/Y696IhoYGbNq0Cffdd5/qozQA0NbWBrPZDLPZDL1ej7S0NKSmpvY5f52u\njf3E+8iyjNO1ZrS0NyM4IATpxhG97uh24TlNTU3uvjFjxgyEhISgo6MDBw8exOHDh3HyZM824hkZ\nGRg9ejRycnIU7SfeRJZl1NbWwmw2o6ysDDExMTCZTEhOTubFjK+BQURlNpsNlZWVOH36NIqLi+Fw\nOCCEwJAhQ5CWluaeD97fb+g1NTUoKCjAfffdBz+/vvfGJ9/CE4fBpbu7G1VVVe4TDH9/f/c0rri4\nuH5/09y7dy/OnTuH22+/vV+/z7VYLBacPn0aZrMZHR0dSE1NhclkQmTk4N1x5mZiPxlcKioqsH//\nfhw9etS98DozMxM5OTlIT09XZfRVSW1tbe51H35+fu6LxryYcXMwiHgRp9OJmpoaVFRU4MSJE2hv\nb3efMCQkJLivbsbExPTLHz6naA1cPHEYvGRZRnNzs3u9WnNzM2JiYtzBxNNF2dfD6XRi3bp1yM3N\nxbBhw27661/re549exZmsxk1NTVISkqCyWRCQkLCgD9RUhr7yeBlsVhw+PBhHD58GCdOnEBnZyfS\n09MxatQojBs37pJpUEVFRVi0aNEVr7F8+XIsXrxYwaqvn8Vica/76OzsRGpqKtLS0hAREaF2aQMO\ng4iXkmUZjY2NKC8vx5kzZ9DU1OReQ6LVamE0Gt0nEiEhITfle9rtdqxduxaTJ0/mFK0BhicOdIHN\nZkNNTY07mMiy7B55NRqNN22tmlJTtOrr61FSUoIzZ84gMjLSve7DW3YnHIjYT+iCC9sAHzlyBKWl\npQgPD0dmZiZGjx6N7Oxsn5qy5HQ63ZtY1NbWIikpCWlpaYiPj+fFjH7EIOIjzp07515rUl9fD39/\nf0iSBLvdjsDAQPeJRHx8/Nf6w78wRev+++/nG/kAwhMHupYLG2hUVVWhrq4OERER7n4SHR39tdaq\nffnll2hvb8esWbNu+DUuXJQxGAzur50/f9697kOSJJhMJphMpkE7d11p7Cd0NQ6HA8ePH8ehQ4dw\n/PhxNDc3IyUlBVlZWcjJyXHfr0RNdrsd7e3tl4xs1NXVwWw2uy9mpKWlISUlpdfF9nTzMIj4oO7u\nblRUVKC8vBw1NTUICAiAXq+Hy+VCR0cHDAaD+0Ti4j+26upqWK3WPq967ty5E06nE9OmTVPixyEF\n8MSBPOFwOFBXV+cOJt3d3e6REqPReMmc6FOnTiEkJASxsbHXvFr4daZotba2uudld3Z2Yt68eWhq\naoLZbEZbW5t73Yc33hhxoGM/IU+0tbXhwIEDOHz4MEpKSuDn54fMzExkZ2dj7Nix7i13nU4njh07\n1m9TRS++uWBZWRmCgoKQn5/v7i+SJLk3seDFDOUxiPg4u92OqqoqlJeX4+zZswgICEBQUBAkSUJb\nWxtcLpd7CtfRo0dRV1cHIYQ7rMTEx+CL9gP4Y/E7KDtXAUkIjI3OQmbrcNxz611oDKhFq60ZMoAw\nXTgyQ7Jh9B8KSXCY0pfwxIFuREdHh3vRe3V1NUJCQpCYmIjY2Fhs3rwZLpcLOp3OvUOX0Wi8Ys/+\nhoYGbNqyEWPzs3Haegrdzi5IQkKcnxEjQrIRpf9XkLj45oJNTU1wuVxobW1FQ0MDQkNDMWXKFJhM\nJiQmJnKqhIrYT+h6tTXsxbEvf4HO5h2AbEOXNQANnRMQkfQtxMYNw/HjxwEAQUFB7l6SkJBw1c1z\nOhzncbLjGMq7SuGQHdBJegwLNCE9eCQCNUHu41paWtwjp11dXbDb7WhsbERDQwNGjhyJsWPHIi0t\nrV+29yXPMYgMIC6XC7W1te7REkmSEBkZCZ1Oh/b2dqxfvx7+/v6IiIhAWFgY9CF+WKlZj2bRBjvs\n7teRhIRHc+5BSngCdJdN89IKLSJ0UZgRdSc0wnfmfg52PHGgr8vlcqGhoQFVVVU4dOgQdu3ahdDQ\nUISHhyM8PNy9DiQ0NPSSqaJWdOPv1R/BKTmAy7KDRmiRETgKwc1hMJvN7jUr7e3taGhoQENDAwID\nA2EwGDBs2DD3jcpIXewndD3KjvwaZYdfgMtpBeD61wPCD3anH9YU5OLM2Z57rRmNRiQlJSEgIOCS\ni6YXporWWCuxs6UALtkF+aLXkiBBEhImBE1DW0XP1M3m5ma4XC60tLSgoaEBbW1tCA8PR0xMDCZP\nnoypU6cq/8ugK3jaT3jG6QMkSUJCQgISEhIwadIkNDU1udeVVFVV9YQPvR42mw1msxl7TEfRFtoB\nl3Bd8jrfyLgVyRHxPTduvIxDdqDZ1og9rTsxOWK6Qj8ZEalNkiTExsYiNjYWDocDNpsNra2taG1t\nxdmzZ6HRaBAeHo6IiAi0tLTg6NGjkCQJQTO1kPVO4CpLTZyyA0fPF8FyzInOcos7fMiyDIPBgDFj\nxiAgIABarRaJiYmw2+2ct03kQxoq/oayw/8Nl7P7ygdlK3QaOx6cdQSHapehoqIKpaWl2LNnD4YM\nGYK4uDgkJSWhtrYW+/fvh1+4HroJLkC68sK4Cy64ZBcK27ag65AL5xrPo6GhAY2NjQgMDERMTAzS\n0tKg1WoRFBR00zb5IeUwiPigqKgoREVFITc3F5WVldi+fTuKi4vR0NAAjUGHc6EdcEmXhhB/rR/y\njKOuGkIucMKJyu5ydDu7EKDhPtpEg01CQgIsFgsqKythMBggyzI6OzvR2tqKqqoqnDhxomca15h4\n+EsGSL0seBcaQB5qx6H1hxAVFYW0tDT39C6j0ci7nxP5sNOHnoXL2XXtA2QXtFIXxmY4YDDkweFw\nwOFwuO/8vmvXLlgsFhgMBkz9znhEIwLialc1LrwcZDTqa1F2qgoxMTHutSg6nQ4pKSm8+7kP4zuA\nj0tMTMTDDz8MAGhubsbTW56Hq/3KqwojY4bDJbuu+PrlBICz3WVIDx55s0slIi934Z5GsiyjpaXl\nkl23EhMT4XQ60dbWhiHpgZB0fb/h+4f5YeLM8UC3hPDwcPfC0aCgoD6fS0Teqav9DLrby/s8TnZ1\nITpwP2Z946fuzTIMBgOSk5MB9OySd/bsWUSMCIOQeu8nklZCYl48otp7wkZCQgLS0tJ49/MBgP96\nA0hkZCSC4kIgd1wZRIL1AdBImj5fwwknLFcbaiWiQUMIgcjISERGRmLMmDGw2+3ue5RUVVXBHtnh\n2evIAqaRJmQljebCUaIBwt7dCCHpAA/OFWzdtdBoNO7p5QDQ2dnp3iwj2hAFjc7h0ffV+EmYMCGP\ndz8fYBhEBpjogChohAZO2XnJ17tsFjhdTmj7CCMSNPDT+PdniUTkY3Q6HYYOHYqhQ4cCADbX/R1N\nzvo+n6fVa5GTNQ6hurD+LpGIFKL1i4Ds8iw8NDTbsGLFims+Lssygl0aoO/rpPDT+iE7O9vTMslH\nMIgMMPcOn423j70Hp/PSIHKs4TTuyZzh0Wsk+if3Q2VENFBkhI7EntYWOGR7r8cFSAEYog1VqCoi\nUkLgkFT4Bcahu/10r8dptMEYP/kZxKTc1+txu1q2obyztNfpWRIkJAek3lC95N24YfsAMyIiDVlR\nmdBJl2bMLrsFh2tPwea89omDBA3i/Y0I0vLGP0R0bUb/odCJ3ne50ggtRoWM5eJRogFGCIHhY5+B\n1OumNgIaXTCik+b2+XqZIdnQ9rKRTs/3lLh2dYBiEBmA/nfW60gMTkDAZVOs1h//J2rPN8Fx2WgJ\n0HPSEKoLw8Rw3nWdiHonCQm3Rc2Gn+QH6SpzKjRCC1NgBoYFmVSojoj6W+ywbyFxxDJI2ivDiJD8\noPOLwLg7N0HS6Pt8rXBdBMaHTYVGaK7YOUtAQCO0mBpxG4K13Jp3IOLUrAEo3D8M/7h3DT4o+Rhv\nFr+Dms46AEB6uAkjA8dhZORwnOgoxnlHGwAgRDMEmSHZSA5MhUZ4MFGTiAa9IbpQzDHMR0nnCZR0\nHofNZYWAgEEfh5Eh2Yj1T1C7RCLqR6bcXyIyYRbKi19CS+02QHZB5xcOY8YyJI5YCr1/tMevlRw4\nHGG6cBxvL8bZ7jK44IRGaJESMBwZIVmc4jmA8c7qg4DT5YQkpCumSFz4t+fUCd/FOyGTt3DJLggI\n9hMfxn5CN0qWZciyE5J0c65vu2QXJMFJO76Md1Ynt2tt28sTBiK6WXjSQDR4CSEgxM07pWQ/GTz4\nL01ERERERIpjECEiIiIiIsUxiBARERERkeIYRIiIiIiISHEMIkREREREpDgGESIiIiIiUhyDCBER\nERERKY5BhIiIiIiIFMcgQkREREREimMQISIiIiIixTGIEBERERGR4hhEiIiIiIhIcQwiRERERESk\nOAYRIiIiIiJSHIMIEREREREpjkGEiIiIiIgUxyBCRERERESKYxAhIiIiIiLFMYgQEREREZHiGESI\niIiIiEhxDCJERERERKQ4BhEiIiIiIlIcgwgRERERESmOQYSIiIiIiBTHIEJERERERIpjECEiIiIi\nIsUxiBARERERkeIYRIiIiIiISHEMIkREREREpDgGESIiIiIiUhyDCBERERERKY5BhIiIiIiIFMcg\nQkREREREihOyLHt+sBCNACr6rxwiuk5DZVmOVruI68VeQuSV2E+I6GbxqJ9cVxAhIiIiIiK6GTg1\ni4iIiIiIFMcgQkREREREimMQISIiIiIixTGIEBERERGR4hhEiIiIiIhIcQwiRERERESkOAYRIiIi\nIiJSHIMIEREREREpjkGEiIiIiIgU9/8BB7zuhFohUiEAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7eff18427780>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'a': 'd_c', 'x': 'a1', 'y': 'd_c', 'z': 'a_b'}"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "instances[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'f'}), (y:node { id : 'd'}), (z:node { id : 'a_b'}), (a:node { id : 'c'}) , (x)-[x_y:edge]->(y), (y)-[y_z:edge]->(z), (z)-[z_z:edge]->(z), (z)-[z_a:edge]->(a)WITH ['a_b'] as ignoredNodes, z, y, a, x OPTIONAL MATCH (y)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(y) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, z, y, a, x OPTIONAL MATCH (same_id_node:node { id : 'y2'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, z, y, a, x WITH same_id_node, same_id_node_new_count, 'y2' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as y2_clone_id, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, z, y, a, x MERGE (y2:node {id : y2_clone_id }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (y2)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(y2)) WITH z, a, y, y2_clone_id, x WITH [] as ignoredNodes, z, a, y, y2_clone_id, x OPTIONAL MATCH (y)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(y) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, z, a, y, y2_clone_id, x OPTIONAL MATCH (same_id_node:node { id : 'y1'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, z, a, y, y2_clone_id, x WITH same_id_node, same_id_node_new_count, 'y1' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as y1_clone_id, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, z, a, y, y2_clone_id, x MERGE (y1:node {id : y1_clone_id }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (y1)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(y1)) WITH z, a, y, y1_clone_id, y2_clone_id, x DETACH DELETE x WITH z, a, y, y1_clone_id, y2_clone_id OPTIONAL MATCH (y)-[:edge]->(suc_y) OPTIONAL MATCH (pred_y)-[:edge]->(y) OPTIONAL MATCH (a)-[:edge]->(suc_a) OPTIONAL MATCH (pred_a)-[:edge]->(a)  WITH COLLECT(suc_y) as sucs_y, COLLECT(pred_y) as preds_y, COLLECT(suc_a) as sucs_a, COLLECT(pred_a) as preds_a, z, a, y, y1_clone_id, y2_clone_id  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'd_c' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , z, sucs_a, preds_y, a, preds_a, y, sucs_y, y1_clone_id, y2_clone_id UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['d_c' + same_id_node.count] ELSE ['d_c'] END AS y_a_id CREATE (y_a:node { id : y_a_id }) FOREACH(s IN sucs_y | CREATE UNIQUE (y_a)-[:edge]->(s))  FOREACH(s IN sucs_a | CREATE UNIQUE (y_a)-[:edge]->(s)) FOREACH(p IN preds_y | CREATE UNIQUE (p)-[:edge]->(y_a))  FOREACH(p IN preds_a | CREATE UNIQUE (p)-[:edge]->(y_a)) FOREACH(n IN sucs_y + preds_y + sucs_a + preds_a | FOREACH(dummy_var IN CASE WHEN n IN [y, a] THEN ['dummy'] ELSE [] END | CREATE UNIQUE (y_a)-[:edge]->(y_a)) ) DETACH DELETE y, a WITH z, sucs_a, preds_y, preds_a, sucs_y, y_a_id, y1_clone_id, y2_clone_id, y_a  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'new_node' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , z, sucs_a, preds_y, preds_a, sucs_y, y_a_id, y1_clone_id, y2_clone_id, y_a UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['new_node' + same_id_node.count] ELSE ['new_node'] END AS new_node_id CREATE (new_node:node { id : new_node_id }) CREATE UNIQUE (new_node)-[:edge]->(z) RETURN z, sucs_a, preds_y, preds_a, new_node, sucs_y, new_node_id, y_a_id, y1_clone_id, y2_clone_id, y_a \n",
      "\n",
      "\n",
      "Rewriting rule to commands: \n",
      "\n",
      "CLONE y AS y2.\n",
      "CLONE y AS y1.\n",
      "DELETE_NODE x.\n",
      "DELETE_EDGE y2 z.\n",
      "MERGE [y, a] AS 'y_a'.\n",
      "ADD_NODE new_node {}.\n",
      "ADD_EDGE new_node z {}.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g = g.rewrite(rule, instances[0])\n",
    "print(\"\\n\\nRewriting rule to commands: \\n\")\n",
    "print(rule.to_commands())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'new_node': 'new_node', 'y_a': 'd_c', 'z': 'a_b'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rhs_g"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('x', 'y'), ('y', 'z'), ('z', 'z'), ('z', 'a')]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pattern.edges()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
