{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "\n",
    "from regraph import Rule, plot_rule\n",
    "from regraph.neo4j.graphs import Neo4jGraph\n",
    "from regraph.neo4j.cypher_utils import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "g = Neo4jGraph(\"bolt://localhost:7687\", \"neo4j\", \"admin\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "res = g.clear()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7ff9e1777860>\n",
      "<neo4j.v1.result.BoltStatementResult object at 0x7ff9e1777978>\n"
     ]
    }
   ],
   "source": [
    "nodes = [\"a\", \"b\", \"c\", \"d\", \"e\", \"f\"]\n",
    "edges = [(\"a\", \"b\"), (\"d\", \"b\"), (\"a\", \"c\"), (\"e\", \"a\"), (\"f\", \"d\")]\n",
    "g.add_nodes_from(nodes)\n",
    "g.add_edges_from(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7ff9e1777128>\n"
     ]
    }
   ],
   "source": [
    "g.add_node(\"x\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7ff9e1777048>\n"
     ]
    }
   ],
   "source": [
    "g.add_edge(\"x\", \"c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7ff9e1777160>\n"
     ]
    }
   ],
   "source": [
    "g.remove_edge(\"x\", \"c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7ff9e1777278>\n"
     ]
    }
   ],
   "source": [
    "g.remove_node(\"x\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['e', 'd', 'a', 'b', 'c', 'f']"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('f', 'd'), ('e', 'a'), ('d', 'b'), ('a', 'b'), ('a', 'c')]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.edges()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' }) WITH [] as ignoredNodes, x OPTIONAL MATCH (x:node)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(x:node) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x OPTIONAL MATCH (same_id_node:node { id : 'a'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, x WITH same_id_node, same_id_node_new_count, 'a' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as uid, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x MERGE (new_node:node {id : uid }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (new_node)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(new_node)) RETURN uid \n",
      "Created clone by the name:  a1\n"
     ]
    }
   ],
   "source": [
    "res_clone_1 = g.clone_node('a')\n",
    "print(\"Created clone by the name: \", res_clone_1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' }) WITH [] as ignoredNodes, x OPTIONAL MATCH (x:node)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(x:node) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x OPTIONAL MATCH (same_id_node:node { id : 'a_clone'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, x WITH same_id_node, same_id_node_new_count, 'a_clone' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as uid, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x MERGE (new_node:node {id : uid }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (new_node)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(new_node)) RETURN uid \n",
      "Created clone by the name:  a_clone\n"
     ]
    }
   ],
   "source": [
    "res_clone_2 = g.clone_node('a', 'a_clone')\n",
    "print(\"Created clone by the name: \", res_clone_2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "res_merge = g.merge_nodes([\"a\", \"b\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'a_b'"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res_merge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", \"y\", \"z\", \"a\"])\n",
    "pattern.add_edges_from([(\"x\", \"y\"), (\"y\", \"z\"), (\"z\", \"z\"), (\"z\", \"a\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'x': 'f', 'y': 'd', 'z': 'a_b', 'a': 'c'}]\n"
     ]
    }
   ],
   "source": [
    "instances = g.find_matching(pattern, nodes=['a_b', 'a1', 'c', 'f', 'd'])\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "clone_name, _ = rule.inject_clone_node(\"y\")\n",
    "clone_name, _ = rule.inject_clone_node(\"y\")\n",
    "rule.inject_remove_edge(clone_name, \"z\")\n",
    "rule.inject_remove_node(\"x\")\n",
    "rule.inject_merge_nodes([\"y\", \"a\"])\n",
    "rule.inject_add_node(\"new_node\")\n",
    "rule.inject_add_edge(\"new_node\", \"z\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzt3XlcVfeB///XufeyiuyoCCooIigg\nKhrXKC6xCpqkSU2aznTamXQmnfpNbaedSefRafpNfzOPfrtM+838OvlNMl2ztCaNSVxwibu4rwiu\nKOCGILLIDnc5vz8MTBYXELiXe3k/Hw8fjwDnct6XyMfzPudzzscwTRMRERERERF3sng6gIiIiIiI\nDDwqIiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi4nYq\nIj7EMIwywzAWfupz8wzDuHqHbXcahvHsxz7+Z8MwSg3DaDQM46phGKvdkVlEvNNH403LR2NGpWEY\nvzUMI8TTuUSkf/nUWFFhGMbvOsaKj/77//nU9gmGYZiGYdg++jjeMIx3DcO4aRjGLcMwCg3D+IoH\n3or0ARURwTCMvwL+ElhommYIkAVs82wqEfECyz4aMyYDU4HveziPiPRPHWNFJjAJ+F43Xvs6cAUY\nBUQBXwYqez2heITN0wGkX5gKbDZN8yKAaZoVwKuejSQi3sI0zWuGYWwE0jydRUT6L9M0KwzD2Mzt\nQtJVU4FvmabZ9NHHx3s/mXiKrogIwAHgy4ZhfNcwjCzDMKyeDiQi3sMwjBHAUnSAICL3YBhGPLAE\nuNCNlx0AfmUYxtOGYYzsm2TiKSoiA8NwwzDqPv4HmN3xRdM03wD+F7AY2AXcMAzjBQ9lFRHv8f5H\n40k+t8eOf/NwHhHpn943DKOB21OsbgAvfuxr3/nU8cnJT732C8Ae4F+AUsMwThiGMdUtqaXPqYgM\nDOWmaYZ//A+3Dxw6mab5pmmaC4Fw4DngJcMwFnsirIh4jcc+GlNGmab596Zptng6kIj0S4+ZpjkY\nmAekANEf+9rPPnV8kvHxF5qmWWua5gumaU4AhgInuF1sDDdllz6kIiKfYJqm3TTNd7h9RkLzvUVE\nRKRXmKa5C/gd8LMHfP3Nj147HIjsvWTiKSoivsfPMIzAjj904YEEhmF8xTCMHMMwBhuGYTEMYwkw\nATjY52lFRERkIPklsMgwjC7dsG4Yxv8xDCPNMAybYRiDga8DF0zTrO7TlOIWemqW78n71Md7u/Ca\neuCfgTcAK3AJ+Lppmvn3fJWIiIhIN5imWWUYxh+4fc9HQxdeEgy8B8QCLdw+Sbq87xKKOxmmaXo6\ng4iIiIiIDDCamiUiIiIiIm6nIiIiIiIiIm6nIiIiIiIiIm6nIiIiIiIiIm7XradmRUdHmwkJCX0U\nRUS66+jRozdN04zxdI7u0lgi0v9oPBGR3tLV8aRbRSQhIYEjR448eCoR6VWGYVzydIYHobFEpP/R\neCIivaWr44mmZomIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiI\niIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiI\niNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNupiIiIiIiIiNup\niIiIiIiIiNupiIiIyIBw4sQJZs2aRXBwME8++aSn44iIl9JY0ntUREREZEAYMmQI//7v/84vfvEL\nT0cRES+msaT3qIiIiIhP+clPfsLKlSs7P66srGTo0KGEh4fz0EMPERAQ4MF0IuItNJb0PRURERHx\nKV/72tf485//TGNjIwCvvvoqzzzzDMHBwR5OJiLeRGNJ31MRERERnxIREcHy5ct5/fXXcTgcvPba\na3z961/3dCwR8TIaS/qezdMBREREetvzzz/PM888w5AhQ0hNTSU5OdnTkUTEC2ks6Vu6IiIiIj4n\nLS2NqKgoVq1axTe+8Q1PxxERL6WxpG+piIiIiE969tlnsVgs5OTkAFBWVkZ8fDzf/va3ycvLIz4+\nnl//+tceTiki/Z3Gkr6jqVkiIuKTduzYwcqVK7FarQAkJCRw9epVD6cSEW+jsaTv6IqIiIj4lPLy\ncsaNG0dxcbGmUojIA9NY0vdURERE+sBrr71GRkYG6enpZGRk8MYbb3g60oAxfPhwzp07x65du/SY\nTfEJGk88Q2NJ39PULBGRPjB27Fh27dpFREQEV69eJTMzk9mzZ5OQkODpaCLiZTSeiK/SFRERkR64\n28q706ZNIyIiAoD4+HhiY2M1p1hE7knjiQw0KiIiIj3QlZV3d+7cSV1dHVOmTPFUTBHxAhpPZKBR\nERER6YH7rbx7+vRpvvzlL/PHP/6RoKAgDyYdmEzT5Fr7dY43FXKs8SSX267iMl2ejiVyRxpP+jeH\n6eBCSwnHGgsoaCqixl7r6UheT/eIiIj00N1W3i0uLmbp0qX813/9F7Nnz/ZwyoHnenslO27toc1s\nx2E6APAzbFixMTdsJiMD4j2cUOSzNJ70P6ZpUth8mqNNBcDtQmLB4CgFhNvCWBQ+j8HWEA+n9E66\nIiIi0kN3Wnm3pKSExYsX8/LLL7NkyRIPJxx4KtpvsKl2K02u5s4SAmA3HbSarWyt28WlNs2xl/5H\n40n/c6ypgKONJ3CYjs7xxIWJEyc1jlreq95Ao7PJwym9k4qIiEgv+PTKu//0T/9EdXU1P/jBD8jM\nzCQzM5PNmzd7OOXAYJomO2/l48B5122cONl1a6+maUm/pPGk/2h0NlHQdOqu44mJSbvZzqGGo25O\n5hs0NUtEpBd8euXdd955x8OJBq4b9ipazNb7bufCyeW2qyQEjnRDKpGu03jSf5xuPgeY99zGxKSs\n7QptrnYCLP7uCeYjdEVERKQHtPJu/1PlqO7SlQ676aDKXu2GRCJdo/Gk/7lur8TJ/ccTi2GhzlHn\nhkS+RVdERER6oGPlXfFOhqcDiHyMxhPvpbHkweiKiIiI+JQYWzSWLvzz5mfYiPGPcUMiEfFWw/2G\ndWk8cZouImzhbkjkW1RERETEpwzxiybYev81FqxYGeE/3A2JRMRbjQ8ed9+rHQYGiYGj8Nf9Id2m\nIiI+4+zZs4wYMYJLly4B8MMf/pCnn37aw6lExN0Mw2BEVSz3eGgWVqzMC5uNxdA/gyJyd4EEEFIe\nhHGX8cTAIMDw56GQye4N5iM0AovPSElJ4d/+7d946qmn2LJlC3/84x959dVXPR1LBhjTNKlor+RM\n83nOtRRT72jwdKQB5+jRo1w5eYlFg+YSYgnBZtiwYGBgYDNsBFuCeCQ8mxEBcZ6OKnJPDtNJaetl\nTjef40JLKe2udk9HGlDsdjsbN24ksjqMh0Kz8DP88DNsGBhYsGDFSoxfFI9H5RJsDfZ0XK+km9XF\np/zlX/4l27Zt47HHHmPPnj2EhoZ6OpIMIFfarpFff4BWVxsmJga3H/oY4xfF3LBZhFoHezqiTzNN\nkwMHDlBeXs7y5csJCgpilDmSSvsNbthvYmISbYtkuH8shqFbS6X/Mk2T400nOdl8CgCXaWIxDFz1\nJmODRjNj8DRshtXDKX1bW1vb7RISGcmcOXMwDIPxg8Zxqe0K9c6G21M7A+IIt4V5OqpXUxERn9Le\n3s6pU6cIDw+nsrLS03FkACltvcyOW3tw3mE+UKW9iverN/B4VC6DrSEeSOf7XC4Xe/bsoa6ujtzc\nXAICAoDb07SG+Q9lmP9QDycU6RrTNNldv4+S1rJPLKLn/Ggpi+KWEmodt8iNeERTC/tIc3MzeXl5\nxMfHM3369M7PWw0rowMTPBfMB+lvsPiU7373u0yZMoUPP/yQ5557jqtXr3o6kgwADtPBzvr8O5YQ\n6Fh5105+/QE3JxsYnE4n27Zto6mpiZycnM4SIuKNKuw3KGm9dNeVvJ04qbZXc67lgpuTDQwNDQ2s\nXbuW0aNHf6KESN9QERGf8f7777Nz505++ctfMmHCBF588UW++MUv4nA4PB1NfFxJa9n9Ft7FxOR6\newVNzma3ZBooHA4HmzdvxjRNFi9ejM2mC/3i3U42ncLBvf/dcuDkZHORmxINHHV1daxbt460tDQm\nT9bN5+6gIiI+47HHHqOgoIDAwEAA/uZv/oY9e/bowET63NW26/c9cACwGFZu2KvckGhgaG9vJy8v\nj+DgYBYuXIjVqjnz4v0q7De6tF2DswmHqRNtveXmzZusX7+erKws0tLSPB1nwNARmohID7lwdW1D\n8/aVEem5lpYW8vLyiI2NZcaMGbr5XHxI18cI0zS1pHcvqKioYMuWLcyZM4fExERPxxlQdEVERKSH\nhvrFYOP+Z+NduIi0RbghkW9rbGxk7dq1jBo1ipkzZ6qEiE/p6urcAUYANkPnk3vqypUrbNmyhfnz\n56uEeICKiIhIDyUHjenSOcxIW7ge9dhDt27dYu3ataSmppKVleXpOCK9LiN4Arb7TFixYiU9OFUl\nvIdKSkrYuXMnixcvJj4+3tNxBiQVERGRHgqwBJAVknnPqyI2bMwK1RNYeqKmpoZ169YxefJkMjIy\nPB1HpE+MDIgnxi8K613GEwsGwdYgxgenuDmZbzl37hz79u1j6dKlDB2qx3t7ioqIiEgvyBg0gayQ\nSdiwfuJspp9hI8gSxNKIRcT4RXkwoXerrKxkw4YNzJw5k5QUHYCJ77IYFj4XsYCRAfFYsWL56FDN\nwPhoJe9oHo1cir/Fz8NJvVdhYSFHjx5l2bJlREVpXPYkTS4UEekl6YPGkxI0loutZVQ7arAYVuL9\nY4n3H64pFD1w7do1tm3bRnZ2NiNGjPB0HJE+ZzNsLAyfS6OzkQstpTS6mgg0AhgdlEhkF+8hkTs7\nevQoFy5cYPny5YSEaIFZT1MREZ/R0tTK6YNnKC8tB8NgRFI8qVPHERCkxc3EffwsfqQEj/V0DJ9R\nVlbG7t27WbRoEbGxsZ6OI+JWIdYQMkPSPR3DJ5imyf79+7l+/TrLly8nKCjI05EEFRHxEcd2nmD/\nxoMYhoHDfvu56leKr7I3bz9zH59D2kPjPZxQRLqruLiYgwcPsnTpUqKjoz0dR0S8lMvlYvfu3dy6\ndYvc3FwCAnSCsr9QERGvV5BfyIFNh3A6nJ/4vKP9diHZ/V4+fn5+jJuss9Qi3uLUqVMUFBSQm5tL\neLimoojIg3E6nWzfvh273U5OTo4WOe5ndLO6eDWH3cG+DQc6r4LcbZtd7+/B5erionMi4lHHjx+n\nsLCQZcuWqYSIyANzOBxs3rwZ0zRZvHixSkg/pCIiXu3CyYtd2s7pcHL53JU+TiMiPXXw4EEuXrzI\n8uXLGTx4sKfjiIiXam9vZ8OGDQQHB7Nw4UKs1vsvOivupyIiXq2mshZ7u/2+2zkdTmpu1LohkYg8\nCNM02b17N9evX2fZsmUEBwd7OpKIeKmWlhbWrVtHTEwMc+fOxWLR4W5/pf8zA0heXh6ZmZmdf/z9\n/fnggw88HatHrFYrdOGpqIZh6GyISC/qzfHE5XKxfft26uvrycnJ0Y2kIgNIbx+bNDY2snbtWkaN\nGsXMmTP16PR+TkVkAFm6dCknTpzgxIkTfOMb3yArK4vFixd7OlaPjEyO79KcT8OAEWPj3JBIZGDo\nrfHE4XCwZcsWHA4HS5Yswc9Pi7SJDCS9eWxy69Yt1q5dS2pqKllZWb2cVPqC7toZgDZv3szPf/5z\n9uzZQ2BgoKfjPDCXy0VVQxUuw3nP7QzDICo2isihkW5KJjJw9GQ8aW9vZ/PmzQwaNIh58+Zp+oTI\nANbTY5Pq6mo2btxIVlYWKSkpfZBQ+oJG/QGmoKCA5557jrVr1xITE+PpOA+soqKCNWvWcOXKFXK+\nsgS/gDufRTUMA/8gfz73F4vcnFDE9/VkPGltbWX9+vVERESQnZ2tEiIygPX02KSyspK8vDxmzpyp\nEuJldEVkALl27RpPPPEEr7/+OsnJyZ6O80BaW1s5ePAgV65cYcaMGYwZMwaAp775JDvf28P10utY\nbbfvBXE6nIwYG8e8zz9MaGSoJ2OL+JyejCdNTU1s2LCBhIQEpk2b1kcJRcQb9PTY5Nq1a2zbto3s\n7GxGjBjRBwmlL6mIDCD//d//TVVVFStXruz83C9+8Quys7M9mKprTNPk7NmzHD58mLFjx7JixQr8\n/f07vx45NILPP7echtoGbl6vBmBIfAyDQgd5KrKIT3vQ8aS+vp4NGzaQmppKZmZmX8cUkX6uJ8cm\nZWVl7N69m0WLFhEbG9uXMaWPGKZpdnnjrKws88iRI30YR+Szbt68SX5+PoZhMGfOHCIjda9HB8Mw\njpqm6XV35GksGVhM08QwDGpqati4cSOTJk1i/Pjxno4ln6LxRLxBx3hy/vx5Dh06xOc+9zmio6M9\nHUs+pavjia6ISL/V3t7O4cOHKSkpYdq0aSQnJ+sxfCJe5sKFCxQVFZGVlcWOHTuYMWMGSUlJno4l\nIl7GNE327NmDzWYjLCyMgoICcnNzCQ8P93Q06QEVEemXiouLOXjwIKNGjWLFihVaV0DEC505c4Y9\ne/ZQV1fHrl27WLlyZed9XSIiXeVyudixYwcXL17k8uXLBAUF8fzzzzN48GBPR5Me0mNKpF+pra1l\n3bp1FBYW8sgjjzBnzhyVEBEvVFBQwJ49e6iurubMmTPExsZSXFzs6Vgi4mU61hq6ePEiJSUlVFVV\nERYWxuXLlz0dTXqBrohIv2C32zl27Bjnzp1jypQpjB8/XtOwRLzUoUOHOHHiBDdu3KCkpIQJEyYQ\nHh6uKVki0i0daw2Vl5dTXFxMc3MzGRkZhIeHExenRYp9gYqIeFxpaSn79+8nNjaWL3zhCwQFBXk6\nkog8ANM02bt3L6dPn6a8vJwrV66Qnp5OaGgoixYtYuTIkZ6OKCJeorW1lY0bN1JZWcm5c+ew2+2k\np6cTERFBTk6OpmX5CBUR8Zj6+nry8/NpamoiOztbj94T8WIul4tdu3ZRXFzMlStXuH79OhkZGYSG\nhrJ48WKGDx/u6Ygi4iWamprIy8vj5s2bnDlzBsMwSEtLIzo6mqVLlxIcHOzpiNJLVEQGANM0aW7Y\nRu2Nl2lpOgCmE5t/POEx3yAs8ktYrO5da8PhcFBQUMCpU6fIzMwkLS1NqyqLeAmXq4X6mj9Rd+M/\nsLdfAsNKQNBkLl17mOLiKEpLy6iurmbixImEhoaydOnSB1opWUR8n6O9nNqb/0V99eu4nHUYliAC\ngj/H0ZOpVFUFc+rUKQICAkhOTmbYsGEsWbJE9436GBURH2eaJjeuPE9D3RpMV3Pn5x3tl6ku/yG3\nql4hfuxmbH5D3JLnypUr7N27l6ioKD7/+c8TEhLilv2KSM85HbVcKf4cDvvV/xlPTBdtzQeJDj3O\niCHxHDuWxcSJEwkLCyMnJ4eIiAjPhhaRfqml6TDXLn4e02wHsx0A09VMc/37pIxax+WySQwaNJEx\nY8YQFxfH4sWL8fPz83Bq6W0qIj6urupXNNSuwTSbP/M102zB3n6V8pIvMCJ5Z5/eHN7Y2Mi+ffuo\nqalh1qxZjBgxos/2JSJ9o7z0GextpYD9M1+zWdsZFXeJR5cmUNcUSU5ODqGhoe4PKSL9ntNRTfnF\nJzBdjZ/5msXiAlwsevgYJ85NIzI6gYULF2K1Wt0fVPqciogPM00HNZX/fscS8j8ctLddoLX5CEGD\npvZ6BpfLxcmTJzl58iQTJkxgwYIFGkxEvFBbSxFtzQXcqYR08PNzkhi3j/jk1wgZrBIiInd2q/oP\nmKbjnttYrQ7Gjz1Aetb/1vRtH6Yi4sNamg7e9xcdwHS1Ul/9Zq8XkfLycvLz8xk8eDCPPfaYzo6K\neLH6mtW3p1Dch83PhmEeAR7p+1Ai4pVuVf8e02y55zaGAcEBHSc/dF+Ir1IR8WFOR3UXt3ThcFzv\ntf02Nzdz4MABKioqmDlzJgkJCb32vUXEMxz2CsDZhS1NnI6avo4jIl7M5bzVpe0MLLic9VgseuCF\nr1IR8WFWWxRgdmFLCzZbzx+d63K5OH36NMeOHSMlJYUVK1Zgs+mvmIgvsPkNA6zcv4xYsNoi3ZBI\nRLyVxRqGy1l33+1MXFisWi/El+ko0YcFBE3F4QDrfaZWOl1+tDkX9WhfN27cID8/Hz8/P5YtW6Yn\n5Yj4GFvgMpyu/8JquXcRcToc2F2ZbkolIt7ItD6K0/kKVuvd7zkzMQgZvACLJdCNycTddPePj3K5\nXGzbtpPSqw9jt9+rb9qw2hI4cLiRtWvXUlFR0a39tLa2snv3brZs2UJGRoZKiIgPamhoYNOWi9Q3\nxOJw3P2fDcMIxm58gbVrN7F7924aGz/7RBwRGdguXbrE7v2ROF33flKny2nDP+Q5N6UST1ER8UFO\np5MtW7ZQWlrKjvzhnL04Eofzs8/eNowg/PzjSUxdy5NPfoGUlBR27NjBxo0buXnz5j33YZomZ8+e\n5Z133sFms7FixQqSkpL66i2JiIfU19ezbt06ampqeGvNZBqbQnHeaTyxBDMo7HNMyPwFTz31FEFB\nQbz77rvs27ePlpZ735QqIgNDWVkZH374IWVltfzk5Xja7X44XZ98kqbLZWC3Wzl9cRn5+2pxuVwe\nSivuoKlZPsbpdPLhhx9y6dIlLly4QFNTExU1f01QeSXjk4/Q3nrkYyurryQs8pnOldWTk5NJSkri\n7NmzbNq0iWHDhpGVlUV4ePgn9lFdXU1+fj6mabJkyRKio6M98VZFpI/V19ezfv16amtrKSwsJCJi\nGAXnv0NaymWGRn2I46OV1QODpxAx5JsMCl2MYRgEBAQwdepU0tLSOH78OG+//TapqalMnDhRqyKL\nDFClpaVs27aNK1eusH37dmbOXMjhomhmTLmExcjD5azDJIDK6vHsPzKaihshpKbe4MSJE0yePNnT\n8aWPqIj4kI4rIZcvX6a4uJiWlhbS09OJjIxk7oKvEhwcfN/vYbFYGD9+PMnJyZw6dYq1a9cycuRI\npkyZQkBAAEeOHOHChQtMmzaNcePG9ekiiCLiOR1XQurq6jh58iSRkZEkJiaSOHoM02Z9HYvl/9z3\newQFBTFz5kwyMjI4duwYq1evJj09nbS0NK2QLDKAlJSUdJaQHTt2MHv2bBITE5k+42HGpaR8Ytuy\nLVsIiyihpOw4lZWVHD16lBEjRhAToydn+SJNzfIRDoeDzZs3f6KEpKWlERUVxbJly7pUQj7OZrMx\nceJEnn76aUJCQnjllVf40Y9+RGNjIytWrCAlJUUlRMRH3bp1i7Vr11JbW8vJkyeJiooiMTGRpKQk\nsrOzu724WEhICA8//DCPPvooNTU1/OlPf6KoqAinsyuPAxYRb/bpEjJnzhwSExOZO3cuKZ8qIQBz\n5sxh0KBBjBs3jpKSElpaWtixYwcOx/3XRRPvoyLiAxwOB1u2bOHKlSucP3/+EyUkNze32yXk45qb\nm6moqGDEiBHMmDGD69evU1BQQGtray++AxHpL+rq6jqvhBQWFhIVFUVCQgJjx459oBLycWFhYSxY\nsIClS5dy7do1Vq9ezdmzZzUHXMRHXbx4kW3btnH58uXOEpKQkMC8efMYN27cHV8TFBTEww8/TEhI\nCHFxcZw/f57a2loOHTrk5vTiDpqa5QMuX77cWULa2tpIS0sjOjqa3NxcgoKCHuh7OhwOjh07xtmz\nZ5k8eTLjx4/HYrHQ1NTUOed7woQJpKen4+/v38vvSEQ8paCgoHM6VkxMDKNGjSI5OZm5c+f22lXQ\nqKgoFi9ezI0bNzh06BAnTpwgKyuLMWPG6EqriI9wOp0cOnSIS5cusWvXrs4Skp2dzdixY+/52lGj\nRpGSkoLL5aKmpoby8nKsVivp6ekMHqx1RXyJroj4gMTERKxWK21tbUyYMIGYmJgelZCysjLefvtt\nGhsbefLJJ0lLS+s8Czpo0CBmz57NY489Rn19PatXr+bkyZO6ZCriIyZPnsy1a9c6S8i4ceN6tYR8\n3JAhQ8jNzWXOnDkUFRXx7rvvcunSpV7fj4i4n9VqJS4ujn379jF37lwSExOZP3/+fUtIhxkzZhAW\nFsa4ceOoqqri4YcfVgnxQboi4uVcLhc7d+4kNjaWzMxMysrKyM3NJTCw+wsANTQ0sHfvXurr65k7\ndy5xcXF33TY0NJTs7Gxqa2s5fPgwhYWFTJo0iZSUlB5N3eiJL33pS5w7d462tjaSkpL4zW9+ozVN\nRLqhubmZjRs38vnPf56qqipCQkKYM2dOn1+liIuLIy4ujkuXLnH48GGOHz/OtGnTGD58eJ/u9240\nloj03JEjR3jjjTd46aWXuHz5MtOmTevWY/79/PzIzs7mwoULzJ8/n6KiIpKSkjx2jCF9wzBNs8sb\nZ2VlmUeOHOnDONIdLpeLHTt20NbWxiOPPILNZsPhcGCzda9fOp1OCgoKKCoqIiMjg4yMjG7/oldV\nVXH48GFu3bpFVlYWSUlJbp9icfPmzc5HCX//+9/H4XDw4x//2K0Z3M0wjKOmaWZ5Okd3aSzpf5qa\nmli/fj3JyclMmjQJp9OJxWJx+++xaZpcvHiRI0eOEBISwrRp0xgyZIhbMwzEsQQ0nkjvOXz4MK+9\n9horV64kIyPjgY5NPm3Tpk1ER0eTleV1f0UHpK6OJ7oi4qVcLhfbt2/HbrezePFirNbbCwJ19xf9\n6tWr7N27l4iICB5//PEHvuwZExPD0qVLuX79OocPH+6c852YmPhA3+9B/OEPf+DNN9+kvb2dpqYm\nkpOT3bZvEW/W1NTEunXrSElJITMzE6BzTHE3wzBISkpi9OjRnD9/nq1btxIVFcXUqVOJjIx0SwaN\nJSIP7tMlBLp/bHInDz/8MO+++y4jR450+8kJ6TsqIl7I5XKxbds2nE4njzzyyAMdMDQ1NbF//36q\nqqqYNWsWI0eO7JVssbGxLF++nMuXL3PkyBFOnDjB1KlTiY+P75Xvfzd79uzhlVdeYd++fcTExPDW\nW2/x6quv9uk+RXxBY2Mj69ev71xwsL+wWCykpKQwduxYzpw5w4YNGxg+fDhZWVmEhYX12X41log8\nuIMHD/LrX/+a559/nrS0tF4yW7yJAAAY/klEQVT93sHBwcyePZvt27fz5JNP9kq5Ec/T/0Uv43K5\n2Lp1Ky6Xi0WLFnW7hLhcLoqKijhx4gTjx49n3rx5ffLLPHLkSEaMGEFpaSn79u0jKCiIqVOnMmzY\nsF7fF9x+5GhYWBhRUVG0tbXxm9/8pk/2I+JLOkrI+PHjO89c9jdWq5W0tDTGjRtHUVERH3zwAQkJ\nCUyePJmQkJBe35/GEpEHs3//fn7729/yzW9+kwkTJvTJPhITE7l06RIHDhxg9uzZfbIPcS/d8eNF\nOkqIaZoPVEIqKipYs2YNV69e5dFHHyUrK6tPzygYhsHo0aN58sknGTduHNu3b2fjxo3cvHmz1/e1\nZMkSxowZQ0pKCkuWLGHy5Mm9vg8RX9LQ0MC6deuYMGFCvy0hH+fn58ekSZN46qmnCAwM5N1332Xf\nvn20tLT06n40loh03969e/n973/fpyWkw8yZMzuXLRDvp5vVvYTT6WTr1q0YhsHChQu7dTN5S0sL\nBw8e5Nq1a8yYMYPRo0f3YdK7czqdnD17luPHjzNs2DCysrIIDw/3SBZfoZtL5UE0NDSwfv160tPT\ne336hLu0tLRw/PhxiouLO6/oBAQEeDqWV9N4Ig8iPz+fN954g29+85ukpqa6ZZ/l5eWdU7Qe5Cmh\n0ve6Op7oiogXcDqdfPjhh1gslm6VENM0OX36NO+88w6BgYGsWLHCYyUEbk+xmDBhAk8//TQxMTGs\nXbuWnTt30tDQ4LFMIgNNfX0969atIyMjw2tLCNxefXnmzJk88cQTtLS0sHr1ao4fP47dbvd0NJEB\no6OEfOtb33JbCQEYPnw4SUlJ5Ofnu22f0jdURPo5p9PJli1bsNlsLFiwoMslpKqqivfff58LFy6Q\nm5vL9OnT8fPz6+O0XWOz2Zg4cSJPP/00ISEhrFmzhr1799Lc3OzpaCI+rb6+nvXr15OZmdnn0yfc\nJSQkhIcffphHH32UmpoaVq9eTVFREU6n09PRRHza7t27O0vIuHHj3L7/qVOnUltbS3Fxsdv3Lb1H\nRaQfczqdbN68GT8/P+bPn9+lEtLW1kZ+fj6bNm1iwoQJLFu2zG2PvOwuf39/srKyeOqpp7Barbzz\nzjscPHiQ1tZWAE6ePEldXZ2HU4r4hlu3brF+/XomTZrE+PHjPR2n14WFhbFgwQKWLFnC1atXWb16\nNWfPnsXlcmG32zl27Bjt7e2ejiniE3bu3Mlbb73FP/zDP3ikhMDtWRbZ2dns37+fxsZGj2SQntM9\nIv2Uw+Fgy5YtBAQEkJ2d3aUScv78eQ4dOkRCQgJTp071uvnSTU1NHDt2jNLSUuLi4jh//jw2m43k\n5GSmTJnSJ0/I8Xaa0y1d0VFCpkyZQkpKiqfjuEVlZSWHDx+mqamJwMBAKioqCAgIIDMzk7S0ND36\n8w40nkhXbN++nXfeeYdvf/vbjB071tNxOH78ONeuXSMnJ8ftC7DK3WlBQy/mcDjYvHkzQUFBzJs3\n774lpKamhvz8fBwOB4sXLyYmJsZNSXvXoEGDmDNnDhMnTuRXv/oVxcXFxMfH43A4KC4uJjU1lUmT\nJhEcHOzpqCJeo66ujg0bNpCVleWxM5eeMHToUHJzcykpKeGXv/wlbW1tJCQk0N7eTmFhIZMmTSI1\nNdVjCzeKeKNt27bx5z//me985zuMGTPG03EAmDhxIpcvX6aoqIj09HSP5UhISGD9+vVefe+dJ2hq\nVi/4yU9+wsqVKzs/rqysZOjQoQ90z4PD4WDTpk0EBwff90qI3W7nwIEDrF+/nqSkJB5//HGvLSEf\n19LSQlRUFOnp6dTX13PkyBGuXbtGYWEhf/rTnzh06BBtbW2feI3TdHHWeY0TzjIqXbc8lFyk53pz\nPKmrq2P9+vVMnTp1QJWQj6utrSUtLY2EhATKyso4ceIE169fZ9++faxevZpz587hcrk+8ZpGs5VC\n5yUKnZdoNFs9lFyka7o7ZnzpS18iKyuL9PR0Hn/8cWpra7u0n/5YQuD24qfZ2dkcP368y+9F+g9N\nzeoFtbW1pKamcuHCBUJCQvjRj35ETU0Nv/jFL7r1fTpKSEhICHPnzv3MJUaXy9VZTEpKSti/fz9x\ncXE89NBDBAUF9dr78TTTNCktLeXIkSPU1dXR0NBAWVkZra2tjBw5kiFDhhAQEEBGRgapaeP5Pbv5\nnX0n7TiwYNCOg4mWUXzHfzkTrQmefjt9SlMpfE9vjSe1tbVs2LCBadOmkZyc3Edp+z+73c6pU6c4\nceIEbW1tVFVVcenSJQIDAxk1ahShoaGEhYWRlZVFSGIUv7RvIM9xHD9uXylx4GSpbTLf8sslxhLq\n4XfTtzSeeKfujhk3b94kOjoagO9///s4HA5+/OMf33MfH374IWvWrOEf//EfSUxM7PX38HGGYfCv\n//qvvPfee1RXV/PTn/6UJ554Ari9cvsLL7xAfX09AC+99BI5OTl873vfw263M3PmTNrb23nmmWeo\nqKhgyJAhLF26lFWrVvHII4/ccX9f+cpXCAwM5Pz581y5coUZM2bw+9//HsMwqKys5LnnnuPixYuY\npsl3v/tdvvzlLwOwZ88e/v7v/56goCCmT5/OBx98wIYNG0hLS+PcuXOsWrWKmzdv0t7ezqpVq/jq\nV7/apz+3/kZTs9woIiKC5cuX8/rrr/O1r32N1157ja1bt3bre9jtdjZt2sTgwYM/U0Kam5vZv38/\nNpuNzMxM9u7dS1NTE/Pnzyc2Nra3347HdSyEmJiYSHFxMUePHmXw4MHU1dVRVlbG1atXGTVqFK32\nNv45fA3lMc20Wz75hJzDrov8Vev/yy8Dvso8m288HUgGht4YT2pqasjLy+Ohhx7qF3O4PcnPz4/M\nzEzGjx9PQUEBhYWFREdHc+PGDc6ePcugQYNISEjg/f2beCuilFZ/B07DpI3/eQzwB47D7HKc5t2g\n7zDMorWPpH/p7pjxhz/8gTfffJP29naamprue6Ji8+bNvP/++7zwwguMGjWqt+PfUWhoKIcPH2bv\n3r2sWLGCJ554grq6Op577jny8vKIjY3l+vXrTJ06laKiIhYsWMDPfvYzFi5cyBtvvMH06dPZvn07\nTzzxBAcPHrzvKuxFRUVs3boVi8XCpEmT2Lp1K4sWLeL5558nLS2N9957j+vXrzN58mQmT57M2LFj\nefrpp3nzzTeZN28eb7/9Nv/xH/8B3D6p/Mwzz/Dmm2+SkpJCQ0MDWVlZzJgxY8Dco9cdKiK95Pnn\nn+eZZ55hyJAhpKamdusMpN1uZ+PGjYSHhzNnzpzOEuJyuTh16hRHjhyhtbWVK1euUFBQwLx580hL\nS+vWoobeyDAMkpOTSUpK4uzZsxw7dozw8HBqamooKysjf8w1rkTacN7lx9CKnW+1/Y5d1v9NqKH7\nSsR79GQ86Sgh06dPJykpqQ9Tehd/f3+mTp1KWloax48f5/Tp0wwZMoTr169TWFjIqX8cTLMfmHe4\n19WJizqaWNX2W/4U9C33hxe5j66OGXv27OGVV15h3759xMTE8NZbb/Hqq6/e9ftu3LiRdevWubWE\nADz99NMATJ8+nfLyclpbW9m3bx+lpaUsWbKkczvDMLhw4QKzZs1ixYoVTJ8+nWeffZaf/exnbN26\nlbi4ONLT0+97b+ljjz3WuTDi5MmTuXjxIosWLWLr1q38/Oc/ByA2NpacnBx27NiBy+UiODiYefPm\nAbBixQr+9m//Frj94KAzZ850vge4/UTTM2fOqIjcgYpIL0lLSyMqKopVq1bxq1/9qsuva29vZ+PG\njURERHyihFRUVJCfn09NTQ01NTVcvHiRkJAQIiMjB0QJ+TiLxcL48eNJTk7unGIRFhnO/vlncfrd\nf2rhe/aD/JV/thuSivSOBx1Pqqur2bhxIzNmzOhXc7j7k46FEDMyMjh27BhWqxW/cREcHFaKeY9h\n1YmLM65rlLgqGW0Z6r7AIl3Q1TGjrq6OsLAwoqKiaGtr4ze/+c1dt83Ly2P9+vW88MILjBw5si9i\n31VHKeh4mITD4cA0TTIyMti9e/cdXzNx4kQ++OADEhISsNvt7N+/n/j4eObPn9/l/XXs0+FwdH78\n6WnyhmFwr9saTNMkOjqaEydO3He/opvVe9Wzzz6LxWIhJyenS9t3lJDIyMjOEtLa2squXbtYu3Yt\n5eXlnD59mosXL5KUlERqairBwcG0tLT08TvpnzoWQvziF79I7PQkXH73f0xfC+1scB53QzqR3tXd\n8aS6upq8vDxmzpypEtIFHQshrlixgqbM4HuWkA4mJrudp/s+nMgD6MqYsWTJEsaMGUNKSgpLlixh\n8uTJd9xu/fr1bNiwwSMl5G5mzpxJcXExO3bs6Pzc4cOHO0vBggULePHFF8nNzWXEiBEMGjSI3/3u\ndyxYsOCB97lw4cLOK0YVFRXk5eWRnZ1NSkoKLS0tnaXoz3/+M7du3X5Qzrhx4wgODub111/v/D5n\nz57tvK9FPklXRHrRjh07WLlyZZceB9ne3k5eXh7R0dHMmjULgDNnznDo0CFaWlq4du0aV69eJS4u\njpSUFAIDA5k6dSrjx48f8M/J9vf3Z8yEZAJat2Cn7b7bt5r2+24j0t90Zzy5efMmGzduZPbs2X1+\nI6mvCQsLY0TQKMz2U/fd1oFT44n0W10ZM2w2G6tXr77j1zoeiLN27Vo2b97M9773PeLj4/sqbrdF\nRESwdu1avvvd77Jq1Sra29sZPXo069atwzAMFixYwL/8y7+wYMECJk6cyJgxYzh16hTTpk174H2+\n/PLL/N3f/R0ZGRmYpsmPf/xjJky4fd/pH//4x86b1efPn99Z2Gw2G+vWrWPVqlX89Kc/xel0MnTo\nUN5+++1e+Tn4Gj01qxeUl5eTnZ3NsGHD2Lhx433nInaUkJiYGGbNmsXNmzfJz8/nxo0b1NXVceHC\nBQIDAxkzZgxBQUGMHTuWhx56SOtnfEy12UB28w9px3HP7QwMHrFm8H8D/9pNydxLT7nxPd0dTzpK\nyJw5c0hISHBPSB+zznGEF9vepvk+JzYGEcBLAU+TY7vzWWRvp/HEO3V3zLiTAwcOUFNTQ2trK9u2\nbet3JeRBlJeXs337dp588slPTL0S99BTs9xo+PDhnDt3rkvbtrW1kZeXx9ChQ8nKymLv3r2cPn2a\ntrY2SkpKqK+vZ/To0URHRxMREcGsWbMYPnx4H78D7xNlDCbLMpp9rvP33C4IP77sN9dNqUR6rjvj\nSVVVFZs2bVIJ6aFF1gx+wJ3PEn+cCSy0em7BNJE7udOY8dJLL7FmzZrPbLtlyxaGDBnyic/t37+f\nwsJCjh8/ztWrV/nP//xPry8hcPvnkpSURH5+PgsXLvR0HLkLFRE3amtrY8OGDcTGxhIdHc3q1atp\namri+vXrXL58mWHDhjFlyhQCAgKYMmUK6enpA+qm9O76tv9yjrX+X1q581QJf2yMt8Qz2TLazclE\n+t6NGzfYtGkTc+fOdevTbHxRoOHPN/w+x6/sm2ih/Y7bBOHPSr/PEWD4uTmdSPf94Ac/4Ac/+MF9\nt9u3bx9FRUUcP36cs2fPsmTJEoqLixkxYoQbUva9qVOnsmbNGj744ANefPHFz3x95cqVPPvssx5I\nJh1URNyktbWVDRs2MHjwYG7evElhYSH19fVcuHCh8ybs4OBgEhMTmTFjBiEhIZ6O3O+lWUfwq8Bn\n+V+tv8HE7DyAMDAIwo/xlnj+v8C/G/D31Ijv6Sgh8+bN6zc3knq7v/GbTyMt/Na+Axcmdm6vTeSH\nFQsGX/Wbx1f99PQ98R0dJeTYsWOcP3+epUuXMmTIEDIyMjwdrddYrVays7PJy8sjPz9fx1b9kIqI\nG7S2tvLBBx/Q2NhIbW0tbW1tlJaWUlNTw+jRoxkyZAihoaHMmjXLZ85CuMssawq7g19irf0w653H\naKGNRGMIf+E3l0mWBJUQ8TmVlZVs3ryZ7OxsjRe9yDAMVvnn8qRtBm/a93DYdRGAaZYknvGbTbwl\nysMJRXpPfn4+p0+f5ujRoxQXF7NkyRKGDh1KTk4OUVG+9Xc9Ojqa9PR0du7cSU5Ojo4L+hkVkT7W\n2trKr3/9a6qrqxk6dCiVlZWUlZURExNDVlYWAQEBZGZmkpmZ2aWn48hnhRiBPOM/h2eY4+koIn2q\noqKCLVu2MH/+fJ+Yw90fxVui+KeAxzwdQ6RPmKbZeW/q4cOHuXjxYueVkNzcXCIjIz0dsU9MnDiR\ny5cvU1RURHq67vPqT1REeqjd1c65lgsUNZ+h2dWC1bAwwj+OjEETcNU4efnllzsXtykoKABuLzwU\nEhLCiBEjmDVrFqGhoR5+FyLSH9Q7GihsPs2F1lIcpgN/w59xQUlMCE6hoapeJUREuqy8vYKCpiIq\n2itxYTLYGkLQNX+un73K4cOHKSkpGRAlBG4vjJydnc37771HmNnCreLjNFVXAjAoaijDM2cTmZiK\nofty3U5FpAfqnQ2sq9lEu6sdx0fziV2mi9K2y5S2XObqtrLO1TmLiopISEhg6NChhISEMHPmTD3v\nX0Q6lbVeZsetPbhw4eL2Y9VbzVYKm09T1HQGyyEnixYsIC4uzsNJRaQ/M02TfQ2HON9yEcfHHnF/\ny1lPXbRJ60Murq0vJycnh5iYGHJzc4mIiPBgYvcIGRRMakAjV/blYTFdnZ9vvHGNC9vXEDJ0BKk5\nf4HFqkNjd1L1e0Au08WGmi20uFo7S0gHExPTYjJsbjyOaBdOp5MpU6YwfPhwMjMzWbFihUqIiHSq\ncdSx49YeHDg7S0gHFy6chhPXNCsRw3z3jKWI9I5TzWc533LhEyWkg2Ez8I8IYPm/fn5AlRCA0t3r\ncTVUf6KEdHA57DRUXKZk9zoPJBvYVEQe0KW2q7SZbZjcfUFIq7+VsctSSE5OZuTIkTzxxBM89NBD\n+Pnp8Y8i8j8Kmopw8tl/HD/BgDMtXVtfREQGJpfp4njTyc+cIP04q58Va7gfs3JmD5gSYm9tpqr4\nJC7H3RdBNp0ObhYXYm9pcmMyURF5QGdazmE3772qN4A11I/p82ewbNmyAfMLLyJdZ5omJa1l9zyp\nAeDEydmWYjelEhFvVGmvwnmPEtLBsEG5rdINifqHmpLTXXpalmEYVJecdkMi6aAi8oBaXC1d2s7P\n6sewUcP6OI2IeCsHjvuWkA5trjsvticiAtDqagXuf8BtAo3OgXPm397SdM+rIR1cDjv2lkY3JJIO\nKiIPKMAI7NJ2LlwEGAF9nEZEvJUNWxcOG27zt2hap4jcXYCl68cbwZagPkzSv9gCgrDY7n8TumGz\n4RcY7IZE0kFF5AGlBo/Fz7j/X+oQ6yBCrYPdkEhEvJFhGIwKuP/q6FYsjA0c44ZEIuKthvkNwejC\nqQ2bYSM5KMkNifqHyNGpmGYXrjybEJk4vu8DSScVkQeUEDAS232KiA0rU0ImahVPEbmnzEFpWLn3\ngqaGYWFCcIqbEomIN7IYFiYOmoDtHuOJgcFgSwhD/WLcmMyz/IMH314n5B6P5jWsNiITxuE/SCeP\n3UlF5AFZDSs5EY8QYPhjvcOP0YaVCcGpjAnUY3pF5N6i/aKYEzoDG9bPnM00MLBhY1HYPEKsgzyU\nUES8xcTgNEYF3vlkqRUrwZZglkQsHHAnScfMe5RB0cOw2D47xdVi82NQ1FDGZD/ugWQDm1Zt6YEI\nWzhfiH6U083nONV8jjazDQOD4f7DmDgojTj/WE9HFBEvMTZoNJG2CAqaiihtu4QLFzZsjA0aTXrw\neMJsoZ6OKCJewDAMskNnc6ntCgVNRVQ5bmJy+56QtOBUUoOS8bf4ezqm21n9/Jnw6F9zs/gk147n\n01p3E4DA8CjiMucQnZyhxQw9QD/xHgqyBDElJJMpIZm4TBcGxoA7yyAivSPKL4L54XOAObhMFxZD\nF61FpPsMwyAhcCQJgSMxTRMTU+MJYLHaGJIymSEpkzE/WtjQ0M/Fo1REepF+yUWkt2g8EZHeYBhG\nl25gH2hUQPoH/V8QERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxER\nERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERER\nERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3\nUxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxER\nERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERERERG3UxERERER\nERG3UxERERERERG3UxERERERERG3M0zT7PrGhlEFXOq7OCLSTaNM04zxdIju0lgi0i9pPBGR3tKl\n8aRbRURERERERKQ3aGqWiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi4\nnYqIiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi4nYqIiIiIiIi43f8P+Hw01nd+4ZkAAAAASUVORK5C\nYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7ff9e1777470>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'a': 'c', 'x': 'f', 'y': 'd', 'z': 'a_b'}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "instances[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'f'}), (y:node { id : 'd'}), (z:node { id : 'a_b'}), (a:node { id : 'c'}) , (x)-[x_y:edge]->(y), (y)-[y_z:edge]->(z), (z)-[z_z:edge]->(z), (z)-[z_a:edge]->(a)WITH ['a_b'] as ignoredNodes, x, y, z, a OPTIONAL MATCH (y:node)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(y:node) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x, y, z, a OPTIONAL MATCH (same_id_node:node { id : 'y2'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, x, y, z, a WITH same_id_node, same_id_node_new_count, 'y2' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as y2_clone_id, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x, y, z, a MERGE (y2:node {id : y2_clone_id }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (y2)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(y2)) WITH x, y, a, z, y2_clone_id WITH [] as ignoredNodes, x, y, a, z, y2_clone_id OPTIONAL MATCH (y:node)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(y:node) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x, y, a, z, y2_clone_id OPTIONAL MATCH (same_id_node:node { id : 'y1'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, x, y, a, z, y2_clone_id WITH same_id_node, same_id_node_new_count, 'y1' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as y1_clone_id, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x, y, a, z, y2_clone_id MERGE (y1:node {id : y1_clone_id }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (y1)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(y1)) WITH x, y1_clone_id, y, a, z, y2_clone_id DETACH DELETE x WITH y1_clone_id, y, a, z, y2_clone_id OPTIONAL MATCH (y)-[:edge]->(suc_y) OPTIONAL MATCH (pred_y)-[:edge]->(y) OPTIONAL MATCH (a)-[:edge]->(suc_a) OPTIONAL MATCH (pred_a)-[:edge]->(a)  WITH COLLECT(suc_y) as sucs_y, COLLECT(pred_y) as preds_y, COLLECT(suc_a) as sucs_a, COLLECT(pred_a) as preds_a, y1_clone_id, y, a, z, y2_clone_id  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'd_c' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , sucs_a, y1_clone_id, y, sucs_y, preds_a, a, z, preds_y, y2_clone_id UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['d_c' + same_id_node.count] ELSE ['d_c'] END AS y_a_id CREATE (y_a:node { id : y_a_id }) FOREACH(s IN sucs_y | CREATE UNIQUE (y_a)-[:edge]->(s))  FOREACH(s IN sucs_a | CREATE UNIQUE (y_a)-[:edge]->(s)) FOREACH(p IN preds_y | CREATE UNIQUE (p)-[:edge]->(y_a))  FOREACH(p IN preds_a | CREATE UNIQUE (p)-[:edge]->(y_a)) FOREACH(n IN sucs_y + preds_y + sucs_a + preds_a | FOREACH(dummy_var IN CASE WHEN n IN [y, a] THEN ['dummy'] ELSE [] END | CREATE UNIQUE (y_a)-[:edge]->(y_a)) ) DETACH DELETE y, a WITH y_a, sucs_a, y1_clone_id, sucs_y, y_a_id, preds_a, z, preds_y, y2_clone_id  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'new_node' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , y_a, sucs_a, y1_clone_id, sucs_y, y_a_id, preds_a, z, preds_y, y2_clone_id UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['new_node' + same_id_node.count] ELSE ['new_node'] END AS new_node_id CREATE (new_node:node { id : new_node_id }) CREATE UNIQUE (new_node)-[:edge]->(z) RETURN y_a, sucs_a, y1_clone_id, sucs_y, y_a_id, preds_a, new_node, z, new_node_id, preds_y, y2_clone_id \n",
      "\n",
      "\n",
      "Rewriting rule to commands: \n",
      "\n",
      "CLONE y AS y2.\n",
      "DELETE_NODE x.\n",
      "DELETE_EDGE y2 z.\n",
      "MERGE [y, a] AS 'y_a'.\n",
      "ADD_NODE new_node {}.\n",
      "ADD_EDGE new_node z {}.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g = g.rewrite(rule, instances[0])\n",
    "print(\"\\n\\nRewriting rule to commands: \\n\")\n",
    "print(rule.to_commands())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'new_node': 'new_node', 'y_a': 'd_c', 'z': 'a_b'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rhs_g"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('x', 'y'), ('y', 'z'), ('z', 'z'), ('z', 'a')]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pattern.edges()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
