{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Examples of utils provided by ReGraph's neo4j module"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "\n",
    "from regraph import Rule, plot_rule\n",
    "from regraph.neo4j.graphs import Neo4jGraph\n",
    "from regraph.neo4j.cypher_utils import *"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Initializing Neo4j graph\n",
    "\n",
    "0. When installing neo4j you will be asked to choose login/password for you dbs (here its \"neo4j\"/\"admin\"), if you choose other -- change in the cell below.\n",
    "1. To start neo4j server run `sudo service neo4j start`\n",
    "2. Check status by running `sudo service neo4j status`. Here you can check the _bolt_ port, change the cell below if different from 7687\n",
    "3. You can query the db by using the neo4j browser, the address can be found also in the result of 'status', e.g. \"Remote interface available at http://localhost:7474/\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# initialize the neo4j driver, wrappped into Neo4jGraph object\n",
    "g = Neo4jGraph(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"admin\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# here we clear the db\n",
    "res = g.clear()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "nodes = [\n",
    "    (\"a\", {\"name\": \"Jack\", \"age\": 23, \"hobby\": {\"hiking\", \"music\"}, \"weight\": 75}), \n",
    "    (\"b\", {\"name\": \"Bob\", \"age\": 24, \"hobby\": {\"sport\", \"music\"}, \"height\": 178}),\n",
    "    \"c\", \n",
    "    (\"d\", {\"name\": \"Paul\"}), \"e\", \"f\"\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"b\", {\"type\": {\"friends\", \"colleagues\"}}), \n",
    "    (\"d\", \"b\", {\"type\": \"enemies\"}), \n",
    "    (\"a\", \"c\"),\n",
    "    (\"d\", \"a\", {\"type\": \"friends\"}),\n",
    "    (\"e\", \"a\"), \n",
    "    (\"f\", \"d\")\n",
    "]\n",
    "g.add_nodes_from(nodes)\n",
    "g.add_edges_from(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (n:node { id : 'a' })\n",
      "RETURN n\n",
      "\n",
      "{'name': ['Jack'], 'weight': [75], 'id': 'a', 'age': [23], 'hobby': ['hiking', 'music']}\n"
     ]
    }
   ],
   "source": [
    "print(get_node(\"a\"))\n",
    "print(g.get_node(\"a\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Primitive operations on Neo4j graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Basic operations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "collapsed": true,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "g.add_node(\"x\", {\"name\": \"Roberto\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "g.add_edge(\"x\", \"c\", {\"type\": {\"friends\", \"colleagues\"}, \"since\": 1993})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['c', 'd', 'a', 'e', 'f', 'x', 'b']"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('x', 'c'),\n",
       " ('a', 'c'),\n",
       " ('f', 'd'),\n",
       " ('d', 'a'),\n",
       " ('e', 'a'),\n",
       " ('d', 'b'),\n",
       " ('a', 'b')]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.edges()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'age': [23],\n",
       " 'hobby': ['hiking', 'music'],\n",
       " 'id': 'a',\n",
       " 'name': ['Jack'],\n",
       " 'weight': [75]}"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.get_node('a')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'type': ['friends', 'colleagues']}"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.get_edge('a', 'b')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cloning"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "By default if we clone a node without specifying the new id for it, the id is automatically derived from the original one (however it takes some additional time to generate it, and some naming collisions may happen in the future when using clone operation inside of complex queries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' })\n",
      "WITH [] as sucIgnore, [] as predIgnore, x \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (x)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, x \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(x) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, x, suc_maps \n",
      "// search for a node with the same id as the clone id\n",
      "OPTIONAL MATCH (same_id_node:node { id : 'a'}) \n",
      "WITH same_id_node,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, pred_maps, x, suc_maps\n",
      "// generate new id if the same id node was found\n",
      "// and filter edges which will be removed \n",
      "WITH same_id_node, same_id_node_new_count, 'a' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as uid, pred_maps, x, suc_maps\n",
      "// create a node corresponding to the clone\n",
      "CREATE (new_node:node) \n",
      "WITH same_id_node, same_id_node_new_count, new_node, uid, x.id as original_old, pred_maps, x, suc_maps\n",
      "// set the id property of the original node to NULL\n",
      "SET x.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET new_node = x\n",
      "// set id property of the clone to the generated id\n",
      "SET new_node.id = uid, new_node.count = NULL, same_id_node.count = same_id_node_new_count + 1\n",
      "// set back the id property of the original node\n",
      "SET x.id = original_old\n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (new_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(new_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "RETURN uid\n",
      "\n"
     ]
    }
   ],
   "source": [
    "clone1_res = g.clone_node('a')\n",
    "# print(\"Created clone by the name: \", clone1_res)\n",
    "# print(\"Properties of the resulting node: \")\n",
    "# print(g.get_node(clone1_res))\n",
    "# print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "# print(g.get_edge(clone1_res, 'b'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can specify the parameter `ignore_naming=True` to avoid automatic id derivation. In this case cloning uses Neo4j native ids (this mode is more suitable for using clone operation inside of complex queries as the Neo4j id have the guaranteed uniqueness)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Here we ignore pretty naming of new clones\n",
      "\n",
      "MATCH (x:node { id : 'a' })\n",
      "WITH [] as sucIgnore, [] as predIgnore, x \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (x)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, x \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(x) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, x, suc_maps \n",
      "// create a node corresponding to the clone\n",
      "CREATE (new_node:node) \n",
      "WITH new_node, toString(id(new_node)) as uid, x.id as original_old, pred_maps, x, suc_maps \n",
      "// set the id property of the original node to NULL\n",
      "SET x.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET new_node = x\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET new_node.id = toString(id(new_node)), new_node.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET x.id = original_old\n",
      "WITH new_node, toString(id(new_node)) as uid, pred_maps, x, suc_maps \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (new_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(new_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "RETURN uid\n",
      "\n",
      "Created clone by the name:  10708905\n",
      "Properties of the resulting node: \n",
      "{'name': ['Jack'], 'weight': [75], 'id': '10708905', 'age': [23], 'hobby': ['hiking', 'music']}\n",
      "Properties of incident edges are also cloned, e.g: \n",
      "{'type': ['friends', 'colleagues']}\n"
     ]
    }
   ],
   "source": [
    "print(\"Here we ignore pretty naming of new clones\\n\")\n",
    "clone2_res = g.clone_node('a', ignore_naming=True)\n",
    "print(\"Created clone by the name: \", clone2_res)\n",
    "print(\"Properties of the resulting node: \")\n",
    "print(g.get_node(clone2_res))\n",
    "print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "print(g.get_edge(clone2_res, 'b'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The third option is to specify the id of the new node manually"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' })\n",
      "WITH [] as sucIgnore, [] as predIgnore, x \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (x)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, x \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(x) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, x, suc_maps \n",
      "// search for a node with the same id as the clone id\n",
      "OPTIONAL MATCH (same_id_node:node { id : 'a_clone'}) \n",
      "WITH same_id_node,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, pred_maps, x, suc_maps\n",
      "// generate new id if the same id node was found\n",
      "// and filter edges which will be removed \n",
      "WITH same_id_node, same_id_node_new_count, 'a_clone' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as uid, pred_maps, x, suc_maps\n",
      "// create a node corresponding to the clone\n",
      "CREATE (new_node:node) \n",
      "WITH same_id_node, same_id_node_new_count, new_node, uid, x.id as original_old, pred_maps, x, suc_maps\n",
      "// set the id property of the original node to NULL\n",
      "SET x.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET new_node = x\n",
      "// set id property of the clone to the generated id\n",
      "SET new_node.id = uid, new_node.count = NULL, same_id_node.count = same_id_node_new_count + 1\n",
      "// set back the id property of the original node\n",
      "SET x.id = original_old\n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (new_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(new_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "RETURN uid\n",
      "\n",
      "Created clone by the name:  a_clone\n",
      "Properties of the resulting node: \n",
      "{'name': ['Jack'], 'weight': [75], 'id': 'a_clone', 'age': [23], 'hobby': ['hiking', 'music']}\n",
      "Properties of incident edges are also cloned, e.g: \n",
      "{'type': ['friends', 'colleagues']}\n"
     ]
    }
   ],
   "source": [
    "clone3_res = g.clone_node('a', 'a_clone')\n",
    "print(\"Created clone by the name: \", clone3_res)\n",
    "print(\"Properties of the resulting node: \")\n",
    "print(g.get_node(clone3_res))\n",
    "print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "print(g.get_edge(clone3_res, 'b'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'x'}), (f:node { id : 'f'}) \n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, x, f\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(x) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in x[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, x, f\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(f) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in f[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, x, f\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, x, f\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, x, f\n",
      "SET x = new_props\n",
      "WITH x as merged_node, f\n",
      "// search for a node with the same id as the clone id\n",
      "OPTIONAL MATCH (same_id_node:node { id : 'x_f'}) \n",
      "WITH same_id_node,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, merged_node, f\n",
      "// generate new id if the same id node was found\n",
      "// and filter edges which will be removed \n",
      "WITH same_id_node, same_id_node_new_count, 'x_f' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as new_id, merged_node, f\n",
      "// set appropriate node id\n",
      "SET merged_node.id = new_id\n",
      "SET merged_node.count = NULL\n",
      "WITH new_id, merged_node, f\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_maps, [] as pred_maps, new_id, merged_node, f\n",
      "OPTIONAL MATCH (merged_node)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, new_id, merged_node, f\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(merged_node)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, new_id, merged_node, f\n",
      "OPTIONAL MATCH (f)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, new_id, merged_node, f\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(f)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, new_id, merged_node, f\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + CASE WHEN NOT map['neighbor'] IS NULL THEN [map['neighbor']] ELSE [] END) as pred_nodes, \tREDUCE(l=[], el in suc_maps + pred_maps| \n",
      "\t\tl + CASE WHEN el['id'] IN [id(merged_node),id(f)] THEN [el['id']] ELSE [] END) as self_loops, new_id, merged_node, f\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, new_id, self_loops, merged_node, f\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, new_id, self_loops, merged_node, f\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "DETACH DELETE (f)\n",
      "RETURN new_id\n",
      "\n",
      "Properties of the resulting node: x_f\n",
      "{'name': ['Roberto'], 'id': 'x_f'}\n"
     ]
    }
   ],
   "source": [
    "merge1_res = g.merge_nodes1([\"x\", \"f\"])\n",
    "print(\"Properties of the resulting node: {}\".format(merge1_res))\n",
    "print(g.get_node(merge1_res))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (a_b:node { id : 'a_b'}), (d:node { id : 'd'}) \n",
      "// use the APOC procedure 'apoc.refactor.mergeNodes' to merge nodes\n",
      "CALL apoc.refactor.mergeNodes([a_b, d], {properties: 'combine'})\n",
      "YIELD node as merged_node\n",
      "// search for a node with the same id as the clone id\n",
      "OPTIONAL MATCH (same_id_node:node { id : 'a_b_d'}) \n",
      "WITH same_id_node,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, merged_node\n",
      "// generate new id if the same id node was found\n",
      "// and filter edges which will be removed \n",
      "WITH same_id_node, same_id_node_new_count, 'a_b_d' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as new_id, merged_node\n",
      "// set appropriate node id\n",
      "SET merged_node.id = new_id\n",
      "SET merged_node.count = NULL\n",
      "WITH new_id, merged_node\n",
      "// find and merge multiple relations resulting from the node merge\n",
      "OPTIONAL MATCH (merged_node)-[out_rel:edge]->(suc)\n",
      "WITH collect({neighbor: suc, edge: out_rel}) as suc_maps, new_id, merged_node\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(merged_node)\n",
      "WHERE pred.id <> merged_node.id\n",
      "WITH collect({neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, new_id, merged_node\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'neighbor') as suc_maps, apoc.map.groupByMulti(pred_maps, 'neighbor') as pred_maps, new_id, merged_node\n",
      "WITH REDUCE(edges=[],  k in filter(k in keys(suc_maps) WHERE length(suc_maps[k]) > 1 ) | \n",
      "\tedges + [suc_maps[k]]) + \n",
      "\tREDUCE(edges=[],  k in filter(k in keys(pred_maps) WHERE length(pred_maps[k]) > 1)| \n",
      "\t\tedges + [pred_maps[k]]) as all_merge_edges, new_id, merged_node\n",
      "UNWIND all_merge_edges as edge_list\n",
      "\tCALL apoc.refactor.mergeRelationships(\n",
      "\t\tREDUCE(rels=[], el in edge_list | rels + el['edge']),  {properties: 'combine'})\n",
      "\tYIELD rel\n",
      "RETURN new_id\n",
      "\n"
     ]
    },
    {
     "ename": "AttributeError",
     "evalue": "'NoneType' object has no attribute 'value'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mAttributeError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-16-cb5cc5692b4e>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mmerge2_res\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mg\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmerge_nodes\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m\"a_b\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"d\"\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Properties of the resulting node: {}\"\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmerge2_res\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mg\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget_node\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmerge2_res\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/lib/python3.6/site-packages/ReGraph-1.0-py3.6.egg/regraph/neo4j/graphs.py\u001b[0m in \u001b[0;36mmerge_nodes\u001b[0;34m(self, node_list, name, ignore_naming)\u001b[0m\n\u001b[1;32m    210\u001b[0m         \u001b[0;31m# print(result.value())\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    211\u001b[0m         \u001b[0;31m# print(result.single())\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 212\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msingle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mvalue\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    213\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    214\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mmerge_nodes1\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnode_list\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mname\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mignore_naming\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mFalse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mAttributeError\u001b[0m: 'NoneType' object has no attribute 'value'"
     ]
    }
   ],
   "source": [
    "merge2_res = g.merge_nodes([\"a_b\", \"d\"])\n",
    "print(\"Properties of the resulting node: {}\".format(merge2_res))\n",
    "print(g.get_node(merge2_res))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Rewriting Neo4j graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Create an SqPO rewriting rule"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", \"y\", \"z\"])\n",
    "pattern.add_edges_from([(\"y\", \"x\"), (\"y\", \"z\"), (\"z\", \"z\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "clone_name1, _ = rule.inject_clone_node(\"y\")\n",
    "clone_name2, _ = rule.inject_clone_node(\"y\")\n",
    "rule.inject_remove_edge(clone_name2, \"z\")\n",
    "rule.inject_remove_node(\"x\")\n",
    "rule.inject_add_node(\"new_node\")\n",
    "rule.inject_add_edge(\"new_node\", \"z\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAIABJREFUeJzt3Xl01fWd//HX53vXJCRsYQkEiCgE\nhUBkM1UqKEswLtXa1r3tjNaxuNTq2GpnWnXsz9G6tWp/cwStrWjpuFVQESibIFYKVEBWAyIYlrAY\nIGTPvZ/5I0CBkuQGk+83N/f5OIdzSO7nhhc55M339V2NtVYAAAAA4CbH6wAAAAAAEg9FBAAAAIDr\nKCIAAAAAXEcRAQAAAOA6iggAAAAA11FEAAAAALiOIgIAAADAdRSRNsQY87kxZtwJnxtjjCk6ydqF\nxpibjvn4Z8aYLcaYQ8aYImPM/7qRGUB8OjxvKg7PjGJjzO+NMe28zgWgdTlhVuw6dlYc/v0vT1if\nZYyxxhj/4Y8zjTFvGGP2GmMOGGPWGGO+78FfBS2AIgIZY74n6QZJ46y17SQNlzTP21QA4sClh2fG\nUNXNjf/0OA+A1unIrMiVdLak+5rw3qmSvpDUR1Jn1W2vFDd7QnjC73UAtAojJM221m6WJGvtLkmT\nvY0EIF5Ya7cbY96TNMjrLABaL2vtLmPMbNUVkliNkPRja23Z4Y8/bv5k8ApHRCBJH0n6rjHmHmPM\ncGOMz+tAAOKHMaaXpAKxgQCgAcaYTEkXSdrUhLd9JOm3xpirjTG9WyYZvEIRSQw9jDH7j/0ladSR\nF621L0u6XVK+pPcl7TbG/NSjrADix1uH58kHqpsdD3ucB0Dr9JYxplR1p1jtlnT/Ma/9+wnbJ6tP\neO+3JS2W9HNJW4wxK40xI1xJjRZHEUkMO6y1HY79pboNh6Osta9Ya8dJ6iDpFkkPGWPyvQgLIG5c\nfnim9LHWTrLWVngdCECrdLm1NlXSGEkDJKUf89rjJ2yfDD72jdbaEmvtvdbagZK6SVqpumJjXMqO\nFkQRwXGstTXW2tdUt0eC870BAECzsNa+L+n3kh4/xffvPfzeHpI6NV8yeIUi0vYEjDHhI78Uww0J\njDHfN8ZcbIxJNcY4xpiLJA2UtLTF0wIAgETya0njjTFDYllsjHnUGDPIGOM3xqRK+qGkTdbafS2a\nEq7grlltz8wTPl4Sw3sOSvqZpJcl+SRtlfRDa+0HDb4LAACgCay1e4wxL0n6haTSGN6SLOnPkjIk\nVahuJ+llLZcQbjLWWq8zAAAAAEgwnJoFAAAAwHUUEQAAAACuo4gAAAAAcB1FBAAAAIDrmnTXrPT0\ndJuVldVCUQA01YoVK/Zaa7t4naOpmCVA68M8AdBcYp0nTSoiWVlZWr58+amnAtCsjDFbvc5wKpgl\nQOvDPAHQXGKdJ5yaBQAAAMB1FBEAAAAArqOIAAAAAHAdRQQAAACA6ygiAAAAAFxHEQEAAADgOooI\nAAAAANdRRAAAAAC4jiICAAAAwHUUEQAAAACuo4gAAAAAcB1FBAAAAIDrKCIAAAAAXEcRAQAAAOA6\niggAAAAA11FEAAAAALiOIgIAAADAdRQRAAAAAK6jiAAAAABwHUUEAAAAgOsoIgAAAABcRxEBAAAA\n4DqKiKTHHntMt95669GPi4uL1a1bN5WXl3uYCkA8Yp4AaC7ME7R1FBFJN954o9544w0dOnRIkjR5\n8mRde+21Sk5O9jgZgHjDPAHQXJgnaOsoIpI6deqkyy67TFOnTlVtba2mTJmiSZMmeR0LQBxingBo\nLswTtHV+rwO0Frfffruuu+46de3aVWeeeab69evndSQAcYp5AqC5ME/QlnFE5LCcnBx17txZd955\n53HnYwJAUzFPADQX5gnaMorIMW666SY5jqNLLrnE6ygA4hzzBEBzYZ6graKIHGPBggW67bbb5Dh8\nWwB8NcwTAM2FeYK2in/Rknbs2KHs7GwVFhZy2BPAV8I8AdBcmCdo67hYXVKPHj20ceNGr2MAaAOY\nJ23PlClT9Mwzz8haK2OMfvKTn+j666/3OhYSAPOk7WGeHI8iAgBAA/r166eFCxeqU6dOKioqUm5u\nrkaNGqWsrCyvowGIM8yT43FqFgAAqv8p1iNHjlSnTp0kSZmZmcrIyFBRUZFXMQHEAeZJbCgiAAAo\ntqdYL1y4UPv379ewYcO8igkgDjBPYkMROSxqa1Qa2ayDtRtVEy31Og6AOFYTLdXB2o0qjWxW1NZ4\nHQcxauwp1uvWrdN3v/tdTZs2TUlJSR4mRSKpjBbrYO0GlUeKZK31Og5ixDyJTcJfIxKxFdpS+bK2\nV82QZCU5sqpR50CeTg/fpGRfT68jAogT5ZEiba58XntrPpKjoKSoJEc9Q5fqtPD18pnE/c8mXtT3\nFOvCwkIVFBToueee06hRozxOiUSwr2aZNle8oPLoVhkFZFWroNNJp4VuUPfgBBljvI6IRjBPGpfQ\nRaTWVmhF6W2qiO5QVNXHvbanZrG+rFmuoam/VqrvdI8SAogXpbWb9PdDP1ZEFZKsIvrHkZCiqje1\nr+YjDUt9Vn7KSKt27FOsf/vb30qSPvvsM+Xn5+vpp5/WRRdd5HFCJIKiyunaVPmcoqo6/Jm6bZTK\n6E5trHhaByOfKjv5du8CIibMk8Yl9KlZheXPqvwkJaSOVUTlWnXoPlkbdT0bgPhhbUSryn6miMpV\nd2T1eFFVqzy6Q4Xlz7ofDk124lOsf/rTn2rfvn36xS9+odzcXOXm5mr27Nkep0RbVRbZekIJOV5U\nldpZPUt7az485T8jKytLa9asOeX3I3bMk4Yl7BGRWntIxTXzZU9aQv4hYsu1r3aZ0gPnuJQMQLzZ\nV7tMEVve4BqrahXXzFc/O0l+k+JSMpyKE59i/dprr3mcCIlkW+Xriqq2wTVRVerzymlKD5zrUiqc\nKuZJwxL2iEhJ7WqZGHpYRBXaU/2+C4kAxKs91YsOn5LVMCO/SmpXuZAIp4KnWKOpjDF6+OGHNWLE\nCPXt21dvvPHG0deWLl2qCy64QMOGDdOwYcP07rvvSpLuu+8+PfbYY5KkV199VY7jaPfu3ZKkgoIC\nzZzzZ0mRk/55j05ap6d+vEF3X/Z3XZ77gm747vVHL2AvLi7WFVdcocGDBysnJ0cvvfTS0fctXrxY\nOTk5ysnJ0W233XbcRe8bN27URRddpBEjRmjIkCF68cUXm/V7lKiYJ7FJ2CIStZUxr62NYQMDQOJq\nyoxoyuyBu448xfr9998/7habQEPS0tK0bNkyTZ06VXfccYckaf/+/brlllv0xz/+UStWrNA777yj\nf/u3f9P+/fs1duxYzZs3T5I0b9485eXlaf78+aqpqdHSpUs16Jy0Bv+8z9eX6b9fHaLf/fU8/X3F\nCs2dO1eSdMcdd2jQoEFavXq15syZo3vvvVdr1qxRVVWVrr76aj3zzDP65JNPdP7552vbtm2SpNra\nWl177bV66qmntGzZMn3wwQd65JFHtGHDhhb8jiUG5klsEvbUrLCTobo72jTMKKAUp3fLBwIQt1Kc\n3tqrgKwau1WvVZLTw5VMANxx9dVXS5Ly8vK0Y8cOVVZW6sMPP9SWLVuOuxjZGKNNmzbpvPPO01VX\nXaXq6motWbJEjz/+uF5//XX17NlTgwYNUvt23VUe3Vrvn3fexV0UDPvkU1BDhw7T5s2bNX78eM2d\nO1dPPPGEJCkjI0MFBQVasGCBotGokpOTNWbMGEnSd77zHd18882SpE8//VTr168/+neQpKqqKq1f\nv14DBgxo7m8V8E8Stoik+QYoYNor0sjeSSOjHqECl1IBiEcZoQJtq/rfk1ymfryAaa9UX7YrmQC4\nIxwOS5J8Pp+kuqMM1loNHjxYixYtOul7Bg8erGnTpikjI0MXXHCB7r77bmVmZmrs2LHqHRqmTyv+\nv6I6+fZJMOTIyK+MYIF8vmWqrW34epKTOXLrX2ut0tPTtXLlyiZ/DaA5JOypWcYYnZH0QzkK1bvG\nUUhdA2MUdrq5mAxAvElyuqlr4IJG58kZST/k3v9AAjj33HNVWFioBQsWHP3csmXLjl6bMXbsWN1/\n//0aO3asQqGQMjMz9fvf/15jx45Vt+BYBU2aTAObaI5C6h3+9nGfGzdunKZMmSJJ2rVrl2bOnKkL\nL7xQ2dnZqqio0OLFiyVJr7/+uvbv3y9Jys7OVnJysqZOnXr062zYsEEHDx5snm8E0IiELSKS1DX4\ndfVPulWOgjIKHv28kSNHIaUH8jQg+W4PEwKIFwOS71Z6IE+OQsdtQBgF5Sio/km3qmswsR9cBSSK\njh07asaMGXrwwQc1ZMgQnXnmmXrggQeOKyJbt27V2LFjj368b98+jRw5Uj4T1tDUpxV2usun4587\nZOSXY8Ia2u5JhZ2ux7329NNPa9WqVRo8eLDGjx+vRx55RAMHDlQoFNK0adM0adIkDR48WAsXLlTv\n3nWnnPv9fr399tv605/+pMGDB2vgwIGaNGmSqqsbvqMo0FzMsXdOaMzw4cPt8uXLWzCON6qiX2p7\n1dvaUfa+9uwtVnav0eoV+qZS/Wd4HQ1okDFmhbV2uNc5mqqtzhKp7sGGX1S9qV0HP1bAH1bPdmPU\nM3SpQk4nr6OhCay1OhhZry+q/qzy6Db5FFbXwBhlhCa02dsvM09aF2sj2le7VEVVM1T8ZaE6te+p\nzKRL1TUwWj4TbPwLoNWI2hrtqVmiHdUzVWMPKGg6KzN0iTr7z5ExPq/jtYhY50nCXiNyrJDTSX2T\nvift/LreeO4ZXfHUT7yOBCBOpfrP0Fn+n2jP8vfVpVs39e3CBZ/xJmIrtPrQz3Ugsv7wQ+XqdtiV\nRjZpc+Xzykm5X50DI70NiTbPGJ/SA+cqPXCuXn7rZY264gqlBNtmCW7LyiLb9PGhuxWxFcfc5n2T\nDtSuVsDpoKHtnkjoSwAoIidoyhEiAEDbYq3V6kM/1/7Imn+6C9qRi4c/KXtAQ9s9qTQ/JRPNb+XK\nlfr+979/3OdKSkp04MABnkcRZ6qjJVpx6A7V2kPSCbcziahCkWiVVpTeoXPSXpTfJOYtfikiANAC\nuCg9Ph2MrNeByPoGb8UcVZU2VUzR0NQnXEyGRJGbm/tPd7F65ZVX9I1vfMOjRDhVX1T9+fDdWevb\nyR1VjS3Vrqo5ygxf7ma0ViOhL1Y/ERsOAJoTR1jjzxdVfz58OlbDDkbWqSq614VEAOLV9uoZjT5f\nKqoqfVH9hkuJWh+KyDEoIgCaC/MkPpVHt6n+vZf/YBRQZbS45QMBYp7Eo6itOXxKVuMSeacGRUR1\n98zu1auXioqKZK3Vgw8+eNxTRgHgVHBEJP74FI5xZbTB58YAzeFQeY1enbtJ8z6p1bQ5m7WnpKLx\nN6FVMIr9blgmga+USNy/+TEGDBighx9+WLfffrv69OmjWbNmadmyZV7HAhDH2IMZn7oGxqg0sqne\np1ofYUxAKb7TXEqFRBOJRPXg88v1+3c2yOcYVVRGNHfNKv3XC6t00bm99dRd5yklKeB1TDTAGEcd\nfIO1P7KqkZWO0gPnuJKpNeKIyGE33HCDTj/9dL377rv64x//qLS0NK8jAYhzHBGJPxmhCWqsQjoK\nqVfwm3La6P3/4S1rrW555H394Z0NqqyKqKyiVlErVVRFVFUT0XsfbtXl//6eqqojXkdFI/qEr5HT\nyFFWRwH1Cn3HpUStD0XksOrqahUWFioUCqm4mPN+ASAR+U2KBqXcX+9pV45CSvMNUJ/wNS4nQ6JY\n9PFO/WVpkSqqTl40qmqi+nTbfr0y61OXk6GpOgdGqGfo4nrLiKOQssI3KM3f3+VkrQdF5LB77rlH\nOTk5+sY3vqFbbrlFRUVFXkcCEMeMMRwRiVOdAyM1tN2T6uDLlaOgfEqRT0nymzT1CV2j3Ha/kmM4\nsxkt47evfaLyytoG11RURfTsq58wY+LAGeEfKjvpRwo7GXIUkk8pchRSitNHA5N/pqwE36nBJJX0\n1ltvaeHChXrttdf07LPP6v7779c111yjBQsWyO/nWwQAiSbNP0BDU59QVXSfKqPFchRUiu80TsdC\ni/t4Y2x3UNq5t1zllbVcK9LKGWOUEZqg7sHxKo9+oVpbqoDpqGRfD6+jtQocEZF0+eWXa9WqVQqH\n6w6d3XjjjVq8eDElBMAp42L1tiHkdFZ7/1lK9Z9BCYErYj3IYUwsN5pGa2GMUYqvt9r7B1JCjkER\nOQanUgBoTswTAE016PROMa1L75CklDA7TBHfKCLHYA8mgObCjg0Ap+K27wxSciMFIxz06YdXDmS7\nBXGPIgIAANBKXDg8U3k53ZQUPPmpgMGAo97d2+l7lwxwORnQ/CgiANAC2FMJ4FQ4jtFLD4zVNy/s\nq1DQp6RQXSEJ+I1CQZ++npuhd399caNHTYB4wL/iwyZPnqySkhKtWbNGkydP1s033+x1JABxjlOz\nAJyKYMCnp+4apf/41+GavmiLpk57SxMuHKXrL81V7+6pXscDmg1HRI6yCpkydUyullHD9+8GAABo\naekdwrrxsjM1pOsuXZ/fhxKCNifhj4jYaI1K1r6okfqVAu3LdMHFUfn0/7RrSZHSz75D/uTuXkcE\nEIe4WB1AczHGKBqNeh0DaHYJfUQkGqnStne+qT1/+6WWfrJX3/rlXl3931/q2w8Vq/fo/9aU+4ap\n+sBnXscEEGdmzpypG264QVdddZVyc3MVDAY1ffp0r2MBiDMzZ85Ubm6uXnnlFRUUFDBL0OYk9BGR\nPUv/S5V7VspGKjU6J6jROUFJ0quLK/XnDyt1bv8affHe1ep71VIuPAUQs4KCAqWnpysYDGrZsmV6\n8cUXlZ+f73UsAHGmoKBABQUF+vGPf6wuXbronXfeYZagTUnYIhKtKdP+DVNlI5XHff6DtdX6w9wK\nvXxPe4UCVrXlu1W+c4lSeozyKCmAeLVkyRI9++yzWrx4scLhsNdxAMSpbdu26e2339ZHH33ELEGb\nkrBFpHznEhnj17FncG/4olYPvHJIU37UXh3b1Z21ZmvLdXDTmxQRAE1SWFiohx9+WAsWLFB6errX\ncQDEqVWrVmnu3Ll6/fXXmSVocxL2GpFo9SHpmBpSXBLRj547qF/9a6pO63bsQ4SsolX7Xc8HIH5t\n375d9957rx566CH179/f6zgA4tT27dt15ZVX6qKLLlJWVpbXcYBml7BFxJ+ScdzHr39QpS9LrR6a\ndkhXPFSiKx4q0dKN1ZLxK5Dax6OUAOLR888/r5KSEj366KPKzc1Vbm6uFixY4HUsAHHm+eef1549\nezR//nxddtllzBK0OaYpt5ccPny4Xb58eQvGcY+1UW16OUeRit0NrjO+sE771kIF25/uUjIgdsaY\nFdba4V7naKq2NEvqs3z5chljNGzYMK+jADFhnrRe99xzj2666SZlZ2d7HQWISazzJGGPiBjjqMvI\n/5TxJ9W/xhdSSuYYSgiAJqmsrDz6q7y83Os4AOJUNBpVRUWFIpGIysvLVVVV5XUkoFkl7MXqktQh\n+xrVlu3Uvo+fUjRSLaO6hwVZScaXpHDXoeox9jlvQwKIOy+99JK2bt0qa63Wrl2rH/zgB9wCHECT\nbd++Xe+9957Wrl2r6dOna+fOnSooKPA6FtBsEvaIyBHpQ+9S1jfnqTTlfJVH03SoOqwSnaHQ2Y+r\n9yVvyvEnex0RQByieAD4qo7MEeYJ2qqEPiJyRKhjf33Z+Uat3ZWnwsJCDR06VJnpeTIm4XsagFNw\n4kaDtZYNCQCnzBgja62acl0vEA/Y0q4HP+wAAABAy6GIHIM9lgCaw5FZwg4NAF9FcXGxli5dqh07\ndmj16tX6+OOPvY4ENCtOzZJUXWP10dqumvlhlkoO5GtzuVWvfn714fEhAJroywNW81cN1OrNo2St\ndOb+A7p4T1Q9u7HfB0DTfL4zqOVFV2pn8F91cJ8j/9adqqi0Sgqz4xRtQ8IXkZUbo7ryzlqVlQ9Q\nZXXdt2Pvpqj+5QFp5Bs1euVRv1JT+IEH0LgX3ozoP34TUSQyWDWRgCSpeHWthn4nqjtvqNW9N/o4\n8gqgUdU1Vjc/UKv3FvdTdc3psn6/qmukheur1P+SGr38iF+jh7NzA/Evof8VbymyunRSrfbt19ES\nIknWOqqsdrT0E6tv31XL6RUAGvXqrIj+8+mIKqt1tIRIUm3Ur6pq6ZlXovrNyxEPEwKIFz94oFaz\nllhV1Tiyx+wzromEVFomXX1PrT5eH/UwIdA8ErqIPPJ8rcor63+9qlr6pNBq0XKKCID6RSJW9/0m\noooGnjVWXik9+ruoyiqYJwDqt25zVHOWWFU2ME8qKqWfP8uODcS/hC0iZRVW0xdYRRrZoVBWIT07\njR92APWb/zerqurG1zlGenMuezEB1G/y61FV1zS+bvkaq+272bGB+JawRWTnHskf4xUyGz/nBx1A\n/TZ/YVUTw4ZDWQXzBEDD1m1ufCepJAWDdaeYA/EsYYtIMCBFYjzQEQo0vgZA4goFJMfX+DpjpKRQ\ny+cBEL/CwdjWWSuFYlwLtFYJW0R6dZc6pDW+LhSQLhmdsN8mADEYPdyRjWEPZlLIalwe8wRA/S4d\nY5QcbnxdNCrl9OMufIhvCfs/ojFGP7rOafSH3TjSTd+KYVcngITVt5fR0LOMfA2OiqhSQoc0uF8M\nF5MASFhXXdT4NoffV6sLz/6CIyKIewlbRCTppit9Gplj6j1VIikkPXa3Tz27sscBQMMmP+BXxzTJ\nf9JtiKj8TpWuGz1Hf/nLHEViPS8UQMJJSzH63UP+erdNHFOj9uHdOuf0hVqxYoW74YBmltBFxO83\neu1Jv+64zlH7dlJqipTWTkoKSwNOk/7wsF83XMrREACNy+xmtPgPAV06xigclNIOz5OAP6oBmdt1\n+ZDf6sDuv2nnzp1atGiR13EBtGITRzl68zd+DT3LKByqmyWpKVIoUKtzsjfo/D6/0pd7t+vvf/+7\nNm3a5HVc4JQl/JPVA36j+37g17//i9WKtVZlFVJmd6PsLI6CAGiajC5GL/4yoJIDVqsLrWxUyj7N\nasXS9Soq6qRPPtmurVu3yhijjh07Kjc31+vIAFqprw1xNP8FR1uKrLZstwoFpX69qjRr5lqVlGRr\n1apVCofDWrhwoVJTU9WtWzevIwNNltBHRI4V8BvlDXE0Ns+hhAD4Sjq2Nxo93NGYkY4yuvg0fvx4\ndezYUWeddZZ2796t4uJi/e1vf9OWLVu8jgqglTst0+jCcxydd7ajrumpys/PV0pKigYMGKANGzao\nrKxMs2fPVmlpqddRgSajiABACwuFQpo4caLatWungQMH6rPPPtOBAwe0YMEClZWVeR0PQBzp1q2b\nxowZow4dOigrK0tr1qxRaWmp5s2b53U0oMkoIgDggvbt22v8+PFKTU1Vdna2Nm7cqCFDhiglJcXr\naADizBlnnKGhQ4eqe/fu6ty5s7Zs2aJzzz3X61hAkyX8NSIA4JYePXpo1KhRWrp0qfLy8vTZZ58p\nJydHwSD34ATQNMOGDdP+/fuVnp4un8+nDRs2qGvXrl7HApqEIgIALhowYICysrIUDoe1ZMkSzZ07\nVxMnTpTjcIAaQOyMMRozZowkyVqrGTNmaPXq1Ro8eLC3wYAm4H8+AHBZOFz3JNWvfe1rkqS//vWv\nXsYBEKf8fr/8fr8CgYDy8/O1evVqbd261etYQMwoIgDgEcdxNG7cOO3YsUNr1671Og6AONauXTtN\nmDBB77//vvbt2+d1HCAmFBEA8FAwGFR+fr4+/vhjFRUVeR0HQBzr2rWrRo0apdmzZ6u8vNzrOECj\nKCIA4LG0tDSNGzdO8+fPV0lJiddxAMSxvn37asCAAZo9e7Zqa2u9jgM0iCICAK1A9+7dlZeXp1mz\nZqmystLrOADi2NChQ9W+fXstXLhQ1lqv4wD1oogAQCvRv39/nXHGGZozZ44ikchX+lorV67Ueeed\np+TkZH3rW99qpoQA4sXo0aNVVlamFStWfKWvwyxBS6KIAEArMnz4cCUlJWnRokVf6et07dpVTz75\npJ566qlmSgYgnvh8Pk2YMEGFhYXatGnTKX8dZglaEkUEAFoRY4wuuOAClZSUaOXKlY2uf+yxx3Tr\nrbce/bi4uFjdunVThw4ddM455ygUCrVkXACtWFJSkvLz8/Xhhx+quLi4wbXMEniBIgIArYzf79fE\niRO1bt06bdmypcG1N954o9544w0dOnRIkjR58mRde+21Sk5OdiMqgFauU6dOGjNmjP7yl7+otLS0\n3nXMEniBIgIArVBycrImTJigxYsXa8+ePfWu69Spky677DJNnTpVtbW1mjJliiZNmuRiUgCtXe/e\nvZWbm6tZs2apurr6pGuYJfACRQQAWqn09HSdf/75mjNnjsrKyupdd/vtt+t//ud/NH36dJ155pnq\n16+fiykBxINBgwYpIyND8+bNUzQaPekaZgncRhEBgFYsKytLgwYNavCZADk5OercubPuvPPO487x\nBoBjnXvuuYpGo/roo49O+jqzBG6jiABAKzdkyBB17txZ8+fPr/eZADfddJMcx9Ell1wiSfr888+V\nmZmpu+66SzNnzlRmZqZeeOEFN2MDaGUcx9H48eNVVFSkdevWnXQNswRu8nsdAADQuK9//et69913\ntWzZMo0cOfKfXl+wYIFuu+02OU7d/qWsrCwVFRW5HRNAKxcMBjVx4kRNnz5daWlpyszMPO51Zgnc\nxBERAIgDR/ZkfvbZZ9q4cePRz+/YsUPZ2dkqLCzkVAoAMUlLS9O4ceM0f/587d+/XxKzBN7giAgA\nxIlwOKyJEydqxowZSktLU0ZGhnr06HFcMQGAWGRkZCgvL0+zZs3S5ZdfziyBJzgiAgBxpEOHDho7\ndqzmzp2rgwcPeh0HQBzr37+/+vbtqzlz5igSiXgdBwmIIgIAcaZnz54aNmyYZs2apaqqKq/jAIhj\nI0aMUDgc1uLFi72OggREEQGAOHTWWWepV69emjt3br3PBACAxhhjdOGFF+rLL7/UypUrvY6DBEMR\nAYA4lZeXJ5/PpyVLlngdBUAc8/v9ys/P19q1a7Vlyxav4yCBcLE6AMSpI3syZ8yYoU/WrFb3/ge1\ntepPOhTZLElK8WWpT+hqpQfookydAAAD9ElEQVRGyTE+j9MCaM1SUlKUn5+vmTNnKjnVp+p2y/RF\n1ZuqsnvlKKBOgRHqE7pKaf4BXkdFG0IRAYA4FgwGNX7ChVqy607tLdsra/5xzUhp5FOtK/+V0nzT\nNaTdI/KZoIdJAbR26enpyht9plbX3ip/ZURWdfMkolrtqVmsfTVL1Sd8nU4LX+dxUrQVnJoFAHFu\np/8PSuqy57gSckRUlToYWa8N5Y97kAxAPLE2or0dfy1fqOJoCTnmVUVVpa2Vr2hP9Qee5EPbQxEB\ngDhWEy3Vruo5sqa63jVRVWtPzSJVR790MRmAeLO3dqlqogckY+tdE1WVNlf+zsVUaMsoIgAQx/bU\nLFFso9zR7ppFLR0HQBzbXvW2IqpodF1ldJfKI9tdSIS2jiICAHGsxpYoqppG10VVpapoiQuJAMSr\n6ui+mNYZ+VVj97dwGiQCiggAxDG/SZMTw31HjIIKOmkuJAIQrwJOh5jWWdXKb5gn+OooIgAQx7oE\nzpNVLA80tOoSOL/F8wCIXz2DF8unpEbXhZzOSnYyXUiEto4iAgBxLOh0ULfAaDmq/9a8RkGlB85R\n2OniYjIA8SY9cJ58JlmSqXeNo7BOC39fxtS/BogVRQQA4lx28l1K9fWXo/A/veYopHa+LJ2ZfK8H\nyQDEE8f4dXa7JxQwqTIK/PPrCqtn6DJ1D471IB3aIh5oCABxzmdCOrvdEyqumaetlf+r8ug2SVKS\n00N9Qlere3CcHB5mCCAGKb5eOif1RRVVTdf26rdUY0slGXX056pP6Bp1Cgz1OiLaEIoIALQBjvEr\nI5ivjGC+rK27ZsQYDnoDaLqg00F9k76nvknfU9RGZORwKhZaBEUEANoYCgiA5uIYn9cR0IbxvxUA\nAAAA11FEAAAAALiOIgIAAADAdRQRAAAAAK6jiAAAAABwHUUEAAAAgOsoIgAAAABcRxEBAAAA4DqK\nCAAAAADXUUQAAAAAuI4iAgAAAMB1FBEAAAAArqOIAAAAAHAdRQQAAACA6ygiAAAAAFxHEQEAAADg\nOooIAAAAANdRRAAAAAC4jiICAAAAwHUUEQAAAACuo4gAAAAAcB1FBAAAAIDrKCIAAAAAXEcRAQAA\nAOA6iggAAAAA11FEAAAAALiOIgIAAADAdRQRAAAAAK6jiAAAAABwHUUEAAAAgOsoIgAAAABcRxEB\nAAAA4DqKCAAAAADXGWtt7IuN2SNpa8vFAdBEfay1XbwO0VTMEqBVYp4AaC4xzZMmFREAAAAAaA6c\nmgUAAADAdRQRAAAAAK6jiAAAAABwHUUEAAAAgOsoIgAAAABcRxEBAAAA4DqKCAAAAADXUUQAAAAA\nuI4iAgAAAMB1/wdhrq2xGmYEDgAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  []\n"
     ]
    }
   ],
   "source": [
    "instances = g.find_matching(pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "ename": "IndexError",
     "evalue": "list index out of range",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mIndexError\u001b[0m                                Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-24-20b22c2ea6b4>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mrhs_g\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mg\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrewrite\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrule\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0minstances\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"\\n\\nRewriting rule to commands: \\n\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrule\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mto_commands\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mIndexError\u001b[0m: list index out of range"
     ]
    }
   ],
   "source": [
    "rhs_g = g._rewrite_base(rule, instances[0])\n",
    "print(\"\\n\\nRewriting rule to commands: \\n\")\n",
    "print(rule.to_commands())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'rhs_g' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-19-3cdf228bd402>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mrhs_g\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name 'rhs_g' is not defined"
     ]
    }
   ],
   "source": [
    "rhs_g"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
