{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Examples of utils provided by ReGraph's neo4j module"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "\n",
    "from regraph import Rule, plot_rule\n",
    "from regraph.neo4j.graphs import Neo4jGraph\n",
    "from regraph.neo4j.cypher_utils import *"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Initializing Neo4j graph\n",
    "\n",
    "0. When installing neo4j you will be asked to choose login/password for you dbs (here its \"neo4j\"/\"admin\"), if you choose other -- change in the cell below.\n",
    "1. To start neo4j server run `sudo service neo4j start`\n",
    "2. Check status by running `sudo service neo4j status`. Here you can check the _bolt_ port, change the cell below if different from 7687\n",
    "3. You can query the db by using the neo4j browser, the address can be found also in the result of 'status', e.g. \"Remote interface available at http://localhost:7474/\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [],
   "source": [
    "# initialize the neo4j driver, wrappped into Neo4jGraph object\n",
    "g = Neo4jGraph(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"admin\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# here we clear the db\n",
    "res = g.clear()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "nodes = [\n",
    "    (\"a\", {\"name\": \"Jack\", \"age\": 23, \"hobby\": {\"hiking\", \"music\"}, \"weight\": 75}), \n",
    "    (\"b\", {\"name\": \"Bob\", \"age\": 24, \"hobby\": {\"sport\", \"music\"}, \"height\": 178}),\n",
    "    \"c\", \n",
    "    (\"d\", {\"name\": \"Paul\"}), \"e\", \"f\"\n",
    "]\n",
    "edges = [\n",
    "    (\"a\", \"b\", {\"type\": {\"friends\", \"colleagues\"}}), \n",
    "    (\"d\", \"b\", {\"type\": \"enemies\"}), \n",
    "    (\"a\", \"c\"),\n",
    "    (\"d\", \"a\", {\"type\": \"friends\"}),\n",
    "    (\"e\", \"a\"), \n",
    "    (\"f\", \"d\")\n",
    "]\n",
    "g.add_nodes_from(nodes)\n",
    "g.add_edges_from(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (n:node { id : 'a' })\n",
      "RETURN n\n",
      "\n",
      "{'name': ['Jack'], 'weight': [75], 'id': 'a', 'age': [23], 'hobby': ['hiking', 'music']}\n"
     ]
    }
   ],
   "source": [
    "print(get_node(\"a\"))\n",
    "print(g.get_node(\"a\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Primitive operations on Neo4j graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Basic operations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "g.add_node(\"x\", {\"name\": \"Roberto\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "g.add_edge(\"x\", \"c\", {\"type\": {\"friends\", \"colleagues\"}, \"since\": 1993})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['f', 'x', 'a', 'b', 'c', 'd', 'e']"
      ]
     },
     "execution_count": 70,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('e', 'a'),\n",
       " ('d', 'a'),\n",
       " ('a', 'b'),\n",
       " ('d', 'b'),\n",
       " ('x', 'c'),\n",
       " ('a', 'c'),\n",
       " ('f', 'd')]"
      ]
     },
     "execution_count": 71,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.edges()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'age': [23],\n",
       " 'hobby': ['music', 'hiking'],\n",
       " 'id': 'a',\n",
       " 'age': [23],\n",
       " 'hobby': ['hiking', 'music']}"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.get_node('a')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'type': ['friends', 'colleagues']}"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.get_edge('a', 'b')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cloning"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "By default if we clone a node without specifying the new id for it, the id is automatically derived from the original one (however it takes some additional time to generate it, and some naming collisions may happen in the future when using clone operation inside of complex queries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' })\n",
      "WITH [] as sucIgnore, [] as predIgnore, x \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (x)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, x \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(x) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, suc_maps, x \n",
      "// search for a node with the same id as the clone id\n",
      "OPTIONAL MATCH (same_id_node:node { id : 'a'}) \n",
      "WITH same_id_node,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, suc_maps, x, pred_maps\n",
      "// generate new id if the same id node was found\n",
      "// and filter edges which will be removed \n",
      "WITH same_id_node, same_id_node_new_count, 'a' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as uid, suc_maps, x, pred_maps\n",
      "// create a node corresponding to the clone\n",
      "CREATE (new_node:node) \n",
      "WITH same_id_node, same_id_node_new_count, new_node, uid, x.id as original_old, suc_maps, x, pred_maps\n",
      "// set the id property of the original node to NULL\n",
      "SET x.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET new_node = x\n",
      "// set id property of the clone to the generated id\n",
      "SET new_node.id = uid, new_node.count = NULL, same_id_node.count = same_id_node_new_count + 1\n",
      "// set back the id property of the original node\n",
      "SET x.id = original_old\n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (new_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(new_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "RETURN uid\n",
      "\n"
     ]
    }
   ],
   "source": [
    "clone1_res = g.clone_node('a')\n",
    "# print(\"Created clone by the name: \", clone1_res)\n",
    "# print(\"Properties of the resulting node: \")\n",
    "# print(g.get_node(clone1_res))\n",
    "# print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "# print(g.get_edge(clone1_res, 'b'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can specify the parameter `ignore_naming=True` to avoid automatic id derivation. In this case cloning uses Neo4j native ids (this mode is more suitable for using clone operation inside of complex queries as the Neo4j id have the guaranteed uniqueness)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Here we ignore pretty naming of new clones\n",
      "\n",
      "MATCH (x:node { id : 'a' })\n",
      "WITH [] as sucIgnore, [] as predIgnore, x \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (x)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, x \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(x) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, suc_maps, x \n",
      "// create a node corresponding to the clone\n",
      "CREATE (new_node:node) \n",
      "WITH new_node, toString(id(new_node)) as uid, x.id as original_old, suc_maps, x, pred_maps \n",
      "// set the id property of the original node to NULL\n",
      "SET x.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET new_node = x\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET new_node.id = toString(id(new_node)), new_node.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET x.id = original_old\n",
      "WITH new_node, toString(id(new_node)) as uid, suc_maps, x, pred_maps \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (new_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(new_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "RETURN uid\n",
      "\n",
      "Created clone by the name:  10708495\n",
      "Properties of the resulting node: \n",
      "{'name': ['Jack'], 'weight': [75], 'id': '10708495', 'age': [23], 'hobby': ['music', 'hiking']}\n",
      "Properties of incident edges are also cloned, e.g: \n",
      "{'type': ['friends', 'colleagues']}\n"
     ]
    }
   ],
   "source": [
    "print(\"Here we ignore pretty naming of new clones\\n\")\n",
    "clone2_res = g.clone_node('a', ignore_naming=True)\n",
    "print(\"Created clone by the name: \", clone2_res)\n",
    "print(\"Properties of the resulting node: \")\n",
    "print(g.get_node(clone2_res))\n",
    "print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "print(g.get_edge(clone2_res, 'b'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The third option is to specify the id of the new node manually"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' })\n",
      "WITH [] as sucIgnore, [] as predIgnore, x \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (x)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, x \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(x) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, suc_maps, x \n",
      "// search for a node with the same id as the clone id\n",
      "OPTIONAL MATCH (same_id_node:node { id : 'a_clone'}) \n",
      "WITH same_id_node,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, suc_maps, x, pred_maps\n",
      "// generate new id if the same id node was found\n",
      "// and filter edges which will be removed \n",
      "WITH same_id_node, same_id_node_new_count, 'a_clone' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as uid, suc_maps, x, pred_maps\n",
      "// create a node corresponding to the clone\n",
      "CREATE (new_node:node) \n",
      "WITH same_id_node, same_id_node_new_count, new_node, uid, x.id as original_old, suc_maps, x, pred_maps\n",
      "// set the id property of the original node to NULL\n",
      "SET x.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET new_node = x\n",
      "// set id property of the clone to the generated id\n",
      "SET new_node.id = uid, new_node.count = NULL, same_id_node.count = same_id_node_new_count + 1\n",
      "// set back the id property of the original node\n",
      "SET x.id = original_old\n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (new_node)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(new_node) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "RETURN uid\n",
      "\n",
      "Created clone by the name:  a_clone\n",
      "Properties of the resulting node: \n",
      "{'name': ['Jack'], 'weight': [75], 'id': 'a_clone', 'age': [23], 'hobby': ['music', 'hiking']}\n",
      "Properties of incident edges are also cloned, e.g: \n",
      "{'type': ['friends', 'colleagues']}\n"
     ]
    }
   ],
   "source": [
    "clone3_res = g.clone_node('a', 'a_clone')\n",
    "print(\"Created clone by the name: \", clone3_res)\n",
    "print(\"Properties of the resulting node: \")\n",
    "print(g.get_node(clone3_res))\n",
    "print(\"Properties of incident edges are also cloned, e.g: \")\n",
    "print(g.get_edge(clone3_res, 'b'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (a:node { id : 'a'}), (b:node { id : 'b'}) \n",
      "// accumulate all the attrs of the nodes to be merged\n",
      "WITH [] as new_props, b, a\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(a) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in a[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, b, a\n",
      "WITH new_props + REDUCE(pairs = [], k in keys(b) | \n",
      "\tpairs + REDUCE(inner_pairs = [], v in b[k] | \n",
      "\t\tinner_pairs + {key: k, value: v})) as new_props, b, a\n",
      "WITH apoc.map.groupByMulti(new_props, 'key') as new_props, b, a\n",
      "WITH apoc.map.fromValues(REDUCE(pairs=[], k in keys(new_props) | \n",
      "\tpairs + [k, REDUCE(values=[], v in new_props[k] | \n",
      "\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])) as new_props, b, a\n",
      "SET a = new_props\n",
      "WITH a as merged_node, b\n",
      "// search for a node with the same id as the clone id\n",
      "OPTIONAL MATCH (same_id_node:node { id : 'a_b'}) \n",
      "WITH same_id_node,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, b, merged_node\n",
      "// generate new id if the same id node was found\n",
      "// and filter edges which will be removed \n",
      "WITH same_id_node, same_id_node_new_count, 'a_b' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as new_id, b, merged_node\n",
      "// set appropriate node id\n",
      "SET merged_node.id = new_id\n",
      "SET merged_node.count = NULL\n",
      "WITH new_id, b, merged_node\n",
      "// accumulate all the attrs of the edges incident to the merged nodes\n",
      "WITH [] as suc_maps, [] as pred_maps, \t[toString(id(b)), toString(id(merged_node))] as self_loops, b, merged_node, new_id\n",
      "OPTIONAL MATCH (merged_node)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, b, merged_node, new_id, self_loops\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(merged_node)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, b, merged_node, new_id, self_loops\n",
      "OPTIONAL MATCH (b)-[out_rel:edge]->(suc)\n",
      "WITH suc_maps + collect({id: id(suc), neighbor: suc, edge: out_rel}) as suc_maps, pred_maps, b, merged_node, new_id, self_loops\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(b)\n",
      "WITH pred_maps + collect({id: id(pred), neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, b, merged_node, new_id, self_loops\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'id') as suc_props, REDUCE(list=[], map in suc_maps | \n",
      "\tlist + map['neighbor']) as suc_nodes, apoc.map.groupByMulti(pred_maps, 'id') as pred_props, REDUCE(list=[], map in pred_maps | \n",
      "\tlist + map['neighbor']) as pred_nodes, b, merged_node, new_id, self_loops\n",
      "WITH suc_nodes, pred_nodes, apoc.map.fromValues(REDUCE(edge_props=[], k in keys(suc_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in suc_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\tvalues + {key: kk, value: v}))), 'key')])) as suc_props, \n",
      "\tapoc.map.fromValues(REDUCE(edge_props=[], k in keys(pred_props) | \n",
      "\tedge_props + [k, apoc.map.groupByMulti(REDUCE(props=[], el in pred_props[k] | \n",
      "\t\tprops + REDUCE(pairs=[], kk in keys(el['edge']) | \n",
      "\t\t\tpairs + REDUCE(values=[], v in el['edge'][kk] | \n",
      "\t\t\t\t values + {key: kk, value: v}))), 'key')])) as pred_props,  \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(suc_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + suc_props[k]) + \n",
      "\tREDUCE(edge_props=[], k IN filter(k IN keys(pred_props) WHERE k IN self_loops) |\n",
      "\t\tedge_props + pred_props[k]) as self_loop_props, b, merged_node, new_id, self_loops\n",
      "WITH suc_nodes, suc_props, pred_nodes, pred_props, apoc.map.groupByMulti(REDUCE(pairs=[], el in self_loop_props |\n",
      "\tpairs + REDUCE(inner_pairs=[], k in keys(el['edge']) | \n",
      "\t\tinner_pairs + REDUCE(values=[], v in el['edge'][k] |\n",
      "\t\t\tvalues + {key: k, value: v}))), 'key') as self_loop_props, b, merged_node, new_id, self_loops\n",
      "FOREACH(suc IN filter(suc IN suc_nodes WHERE NOT id(suc) in self_loops) |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(suc)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(suc_props[toString(id(suc))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in suc_props[toString(id(suc))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "FOREACH(pred IN filter(pred IN pred_nodes WHERE NOT id(pred) in self_loops) |\n",
      "\tMERGE (pred)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(pred_props[toString(id(pred))]) | \n",
      "\t\t pairs + [k, REDUCE(values=[], v in pred_props[toString(id(pred))][k] | \n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "// add self loop \n",
      "FOREACH(dummy in CASE WHEN length(self_loops) > 0 THEN [NULL] ELSE [] END |\n",
      "\tMERGE (merged_node)-[new_rel:edge]->(merged_node)\n",
      "\tSET new_rel = apoc.map.fromValues(REDUCE(pairs=[], k in keys(self_loop_props) |\n",
      "\t\tpairs + [k, REDUCE(values=[], v in self_loop_props[k] |\n",
      "\t\t\tvalues + CASE WHEN v.value IN values THEN [] ELSE v.value END)])))\n",
      "DETACH DELETE (b)\n",
      "RETURN new_id\n",
      "\n",
      "Properties of the resulting node: a_b\n",
      "{'name': ['Jack', 'Bob'], 'weight': [75], 'id': 'a_b', 'age': [23, 24], 'height': [178], 'hobby': ['music', 'hiking', 'sport']}\n"
     ]
    }
   ],
   "source": [
    "merge1_res = g.merge_nodes1([\"a\", \"b\"])\n",
    "print(\"Properties of the resulting node: {}\".format(merge1_res))\n",
    "print(g.get_node(merge1_res))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (a_b:node { id : 'a_b'}), (d:node { id : 'd'}) \n",
      "// use the APOC procedure 'apoc.refactor.mergeNodes' to merge nodes\n",
      "CALL apoc.refactor.mergeNodes([a_b, d], {properties: 'combine'})\n",
      "YIELD node as merged_node\n",
      "// search for a node with the same id as the clone id\n",
      "OPTIONAL MATCH (same_id_node:node { id : 'a_b_d'}) \n",
      "WITH same_id_node,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, merged_node\n",
      "// generate new id if the same id node was found\n",
      "// and filter edges which will be removed \n",
      "WITH same_id_node, same_id_node_new_count, 'a_b_d' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as new_id, merged_node\n",
      "// set appropriate node id\n",
      "SET merged_node.id = new_id\n",
      "SET merged_node.count = NULL\n",
      "WITH new_id, merged_node\n",
      "// find and merge multiple relations resulting from the node merge\n",
      "OPTIONAL MATCH (merged_node)-[out_rel:edge]->(suc)\n",
      "WITH collect({neighbor: suc, edge: out_rel}) as suc_maps, merged_node, new_id\n",
      "OPTIONAL MATCH (pred)-[in_rel:edge]->(merged_node)\n",
      "WHERE pred.id <> merged_node.id\n",
      "WITH collect({neighbor: pred, edge: in_rel}) as pred_maps, suc_maps, merged_node, new_id\n",
      "WITH apoc.map.groupByMulti(suc_maps, 'neighbor') as suc_maps, apoc.map.groupByMulti(pred_maps, 'neighbor') as pred_maps, merged_node, new_id\n",
      "WITH REDUCE(edges=[],  k in filter(k in keys(suc_maps) WHERE length(suc_maps[k]) > 1 ) | \n",
      "\tedges + [suc_maps[k]]) + \n",
      "\tREDUCE(edges=[],  k in filter(k in keys(pred_maps) WHERE length(pred_maps[k]) > 1)| \n",
      "\t\tedges + [pred_maps[k]]) as all_merge_edges, merged_node, new_id\n",
      "UNWIND all_merge_edges as edge_list\n",
      "\tCALL apoc.refactor.mergeRelationships(\n",
      "\t\tREDUCE(rels=[], el in edge_list | rels + el['edge']),  {properties: 'combine'})\n",
      "\tYIELD rel\n",
      "RETURN new_id\n",
      "\n"
     ]
    },
    {
     "ename": "AttributeError",
     "evalue": "'NoneType' object has no attribute 'value'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mAttributeError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-63-cb5cc5692b4e>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mmerge2_res\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mg\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmerge_nodes\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m\"a_b\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"d\"\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Properties of the resulting node: {}\"\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmerge2_res\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mg\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget_node\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmerge2_res\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/lib/python3.6/site-packages/ReGraph-1.0-py3.6.egg/regraph/neo4j/graphs.py\u001b[0m in \u001b[0;36mmerge_nodes\u001b[0;34m(self, node_list, name, ignore_naming)\u001b[0m\n\u001b[1;32m    182\u001b[0m         \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    183\u001b[0m         \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mexecute\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 184\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msingle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mvalue\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    185\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    186\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mmerge_nodes1\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnode_list\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mname\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mignore_naming\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mFalse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mAttributeError\u001b[0m: 'NoneType' object has no attribute 'value'"
     ]
    }
   ],
   "source": [
    "merge2_res = g.merge_nodes([\"a_b\", \"d\"])\n",
    "print(\"Properties of the resulting node: {}\".format(merge2_res))\n",
    "print(g.get_node(merge2_res))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Rewriting Neo4j graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Create an SqPO rewriting rule"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", \"y\", \"z\"])\n",
    "pattern.add_edges_from([(\"y\", \"x\"), (\"y\", \"z\"), (\"z\", \"z\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "clone_name1, _ = rule.inject_clone_node(\"y\")\n",
    "clone_name2, _ = rule.inject_clone_node(\"y\")\n",
    "rule.inject_remove_edge(clone_name2, \"z\")\n",
    "rule.inject_remove_node(\"x\")\n",
    "rule.inject_add_node(\"new_node\")\n",
    "rule.inject_add_edge(\"new_node\", \"z\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/matplotlib/cbook/deprecation.py:107: MatplotlibDeprecationWarning: Passing one of 'on', 'true', 'off', 'false' as a boolean is deprecated; use an actual boolean (True/False) instead.\n",
      "  warnings.warn(message, mplDeprecation, stacklevel=1)\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAIABJREFUeJzt3Xl4VOXd//HPmZnsrAECWdgUxLAL\nAVFwCQkiiCFo675Wai2gj9WqtZtdrK0PVp/HPvirS6sVK7biBkoLAYKGRWQRQTZBILKvgZBkktnu\n3x9AChKywOScGXi/ritXMjP3nPlOruQ79+esljFGAAAAAGAnl9MFAAAAADj3EEQAAAAA2I4gAgAA\nAMB2BBEAAAAAtiOIAAAAALAdQQQAAACA7QgiAAAAAGxHEDmLWJa1xbKs3G/dd6VlWdtqGDvPsqyx\nx93+qWVZmy3LKrMsa5tlWf+wo2YA0elov/Ee7Rm7Lct6zbKsJk7XBSCyfKtX7Dq+Vxz9+clvje9k\nWZaxLMtz9HaGZVnvWJa1z7KsQ5ZlfWlZ1l0OvBU0AoIIZFnWnZJul5RrjGkiKUvSHGerAhAFrj3a\nM/rpSN/4ucP1AIhMx3pFX0kXSXq8Ac+dLGmrpI6SWunIfGV32CuEIzxOF4CIMEDSTGPM15JkjNkl\n6SVnSwIQLYwx2y3L+peknk7XAiByGWN2WZY1U0cCSX0NkPQjY0z50dufh78yOIUtIpCkTyXdYVnW\nI5ZlZVmW5Xa6IADRw7Ks9pJGigkCgFpYlpUhaYSkjQ142qeSJlmWdZNlWR0apzI4hSBybkizLOvg\n8V+Shhx70BjzhqT7JQ2X9LGkPZZlPeZQrQCix/tH+8l8HekdTzlcD4DI9L5lWYd1ZBerPZKeOO6x\nH39rfrLyW8/9rqQiSb+QtNmyrBWWZQ2wpWo0OoLIuWGHMabF8V86MnGoZoz5uzEmV1ILSfdJ+q1l\nWcOdKBZA1Mg/2lM6GmPGGWO8ThcEICLlG2OaSrpS0oWSWh/32DPfmp/0Pv6JxpgSY8xPjDE9JLWV\ntEJHgo1lU+1oRAQRnMAY4zfGvK0jayTY3xsAAISFMeZjSa9JeuY0n7/v6HPTJCWHrzI4hSBy9omx\nLCv+2JfqcUICy7LusizrGsuymlqW5bIsa4SkHpIWN3q1AADgXPI/koZZltWnPoMty3rasqyelmV5\nLMtqKumHkjYaY/Y3apWwBWfNOvvM+NbtBfV4Tqmkn0p6Q5JbUrGkHxpj5tf6LAAAgAYwxuy1LOt1\nSb+UdLgeT0mU9J6kVEleHVlJmtd4FcJOljHG6RoAAAAAnGPYNQsAAACA7QgiAAAAAGxHEAEAAABg\nO4IIAAAAANs16KxZrVu3Np06dWqkUgA01LJly/YZY9o4XUdD0UuAyEM/ARAu9e0nDQoinTp10tKl\nS0+/KgBhZVlWsdM1nA56CRB56CcAwqW+/YRdswAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1B\nBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACw\nHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAA\nALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4IIAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gA\nAAAAsB1BBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA2xFEAAAAANiOIAIAAADAdgQRAAAAALYj\niAAAAACwHUEEAAAAgO0IIlFsxowZ6tu3b/VXbGysPvjgA6fLAhCF6CcAwoV+gvoiiESxkSNHasWK\nFVqxYoXGjx+vrKwsDR8+3OmyAEQh+gmAcKGfoL4IImeBmTNn6tlnn9W0adMUHx/vdDmOmjhxosaP\nH199e/fu3Wrbtq0qKiocrAqIHvST/6CfAGeGfvIf9JOaEUSi3BdffKH77rtPH3zwgVq3bu10OY67\n55579M4776isrEyS9NJLL+mWW25RYmKiw5UBkY9+ciL6CXD66Ccnop/UjCASxbZv367rr79eb7zx\nhi644AKny4kIycnJysvL0+TJkxUIBPTyyy9r3LhxTpcFRDz6ycnoJ8DpoZ+cjH5SM4/TBeD0vfLK\nK9q7d+8Jm/qee+45ZWdnO1iV8+6//37deuutSklJUWZmprp27ep0SUDEo5/UjH4CNBz9pGb0k5NZ\nxph6D87KyjJLly5txHKA8MjOztbGjRs1adIk5eXlOV1Oo7Esa5kxJsvpOhqKXoJoQj+JbPQTRBP6\nyYnYNQtnpbFjx8rlcmnUqFFOlwIgytFPAIQL/eREBBGclQoLCzVhwgS5XPyJAzgz9BMA4UI/ORG/\nBUSMdevWqX379iouLpYk/frXv9ZNN93UoGXs2LFD3bp104YNG07YNxUAGop+AiBc6Cc142B1RIwL\nL7xQTz31lG688Ub95je/0ZtvvqklS5Y0aBlpaWlav359I1UI4FxCPwEQLvSTmhFEEFFuv/12zZkz\nR/n5+SoqKlKzZs2cLgkAAACNgCASxQ76SjVt2xztryxRq/iWGp2Rq+axTZ0u64z4fD6tXr1aLVq0\n0O7du50uBzhnfH24WLN2zldV0KeuTTtpeNpl8rj4iADQMMYYFe1ZohUla+SSS4NT+uui5B5Ol4UI\nxadMFPIFffrR0t/ptU3vyGO55Qv5FeuK0Q8X/0J3nXe9nsv6mWLdsU6XeVoeeeQR9e/fX6+99ppG\njBihhQsXKiMjw+mygLPWtvKdum3BQ1qyf5UsWQqakOJcMYpxefRM/5/qzvOvc7pEAFFizs6FGrvo\ncR3wHZQ/FJAlyWW51blJhl4f/Iz6Jnd3ukREGIJIlAmGgho97wcq2rNUlcGq6vt9Ib8k6fVN72pT\n2Tf6MPsVuV1up8o8Le+//77mzZunxYsXKz4+Xk888YRuvvlmFRYWyuNp2J9qKBiUJLnc0fU7AOy0\ns2KPBvxrjPZXHVTQBKvv94V8kqQJnz2hskC5xne73akSI0LQ75fL45FlWU6XAkSsmTuKdP3H4+QN\nVp702OpDG3TFrJv1yfC31KdlpgPVRQZjjIJ+v9wxMfSTozhrVpR5d+ssLdi7vMZ/dEmqCFZqwd7l\nenfrLJsrO3P5+fn64osvFB8fL0m65557VFRUVO8QEvT79dkbU/SHrMF6tHWGHm2doacuGqRFr76u\nQFVV3QsAzjE/Xv57HfhWCDleRbBSjy5/Wnsr99tcmfMO792rf/3uaf2i84V6LKWDHmmVrv937fVa\nP3ee06UBEScQCui2+Q+dcm4iSWWBCt254BEbq4ocO1at1htjf6jH2nbUT9p21OOpnfXPBx7Sng0b\nnS7NcVxZPcoMmJGv5QdW1znuPFe6nm36sNxutzwejzweT/XPNX2PjY1Vly5dbHgHjcPv9erP+Tdo\nx6rV8lVUnPBYbGKCUrp21biP3lNckySHKmwcXAkZp6uk6pAy3h18wpbVmsTKo+/EDNONSVed1Dtq\n6icej0fNmzdXamqqTe8k/HZ/tUH/d3WefOUVJ63EiE1M1CV336Frn3zirFujST/B6Xp/a4HuWvCI\nDgfKax0Xqxj9PvF+dY3rUO/5SVpaWlSfuGbZ2+/o7Qd+rEBVlUwoVH2/y+OROyZGd77+ijKH5ThY\nYeOobz9h16wos7JkXb3GbQnu0Nq1a+VyueRyueR2u2VZltxud/V9x3+IxsfHR3UQefvBR7Tti1UK\nVJ68NsZX4dWudev15g8m6O6/v+pAdUDk+aJkneJcsXUGEZ8C+vTwCvX+pn117zi+pxz7+Xhdu3aN\n2iAS9Pv157zvyFtyUDWtqPNVVGjhq39TWq8eyrrpuw5UCESehXuW1RlCJMmEQira/pn8lWU1zkuO\nfR1v6NChURtEdqxarbcf+LH8Xu9Jj4UCAYUCAb1+5/f1yKcfK7lDewcqdB5BJMoY1W8LlpFUXFys\nUChU41cwGDzhnz4hIUHx8fG1ruWsbY1FfZ/XGMr279cX70+vdferQFWV1s2eq4Pbd6hFelqj1AFE\nk5BCdQ86qtJXqS1btigYDB7ZxzkYPKmnHB9Otm/frv3795+yHzSkZ5xqTGNdlfjLj/6lqrKyGkPI\nMf4Kr2Y9/Uf1v/E7Z91WEeB0BE39+knIGB0oOaDNuzbXOC8xxsgYc8IKj6qqKqWmpjbq/KSx/o/n\n/M//1blreDAQ0PyX/qK8J3/VKDVEOoJIlOnW7DytOVT3PoVtTbL69OlT65jj//GTkpKUm5urYDCo\nYDCoQCCgQCBQ/fO376uqqjrpsbqeFwqFGtQc6ttAVr/7gax6TkpWfvChLh93b73GAmezbkmdVeE/\neS3dt3mMW33iu9XaT4wxJ0wounXrpqysrDr7SDAYlN/vl9frrVcfOf67MSZsE5Hjb3/y8quqKqt7\nzW7p7t3as2Gj2l7QtUG/d+Bs1COhi+IVq0r5ah3ndrk0KO0idW536hWCoVDohBUe2dnZateuXa39\n4FjPqKqqUnl5eY29prZ+dCz0hHN+4na7tWrahyfsjlWToM+npVPeJoggOjzS415NWPyEyoOnnkAk\nuuP1eM8falTKsDonAcdux8fHKzk5uVFrP9ZYGhJejv1c22Rly6pV8tfjYPRAVZXK9h9o1PcIRIPS\n0lItnFmkCwMd9aX7a5laVga63W49efljauNpWeck4NjP6enpjd5Pjq1IaUh4qc9kZe/WbfV6fbfH\no4qSg436HoFo8M033yjw2SGFXCGpjh0fMpJS9UDuD+rsI8ffTk9PV8uWLRv1PRz/mg2dn/h8vhrH\n+LxeBQOBer1+VVlZo76/SEYQiTI3dbxG/2/9G1pZsl6VoZMn3/GuOPVocYHu7XVzxF1LxLKs6rUF\ntQkGgkf2PXfXbyvHZwcPa9uH/5a/ova1uzHx8WrWtk296wXORtu3b9fs2bNVVlam3pvStL5Xsfzu\nQI1hJNGdoIe736O+HXvaX2gdju26ERMTE9bl7np9itZ+s7XOcUG/X03btA7rawPR5vPPP9eSJUu0\nfft2ddiSqE1Xlip0in/JBHe8Xh3y30pNibzjx45twYiNDd+8yRijReMfUqCy7hWlCc2j8xiYcOD0\nvVEm1h2r2cMma0T6FYp3xSnOdeSfJs4Vq3hXnK5Ov1xzhk2OuBBSF5/Xr8KXF+nx3hM1PuUJjWvz\nS/3qkv/Vp299rmCg5lOL+v1+rVmzRptCfgX8/jpfwxijPvl54S4diBpffvmlZsyYoQMHDmjFihVK\nj22rn/huV6qrjRLdCXId/Uho4klUojtBv+g9QU/0fsDhqu016K476nV2veQOHdT6vM42VAREnkAg\noDlz5lSHkMLCQnXdn6rz5jZVbMCjOPOfOUgTT5LaxbfRR0Nf0ZCUqDsp22mzLEsXXT9GVh3Hx3ri\n4jTw9ltsqirysEUkCiV5EjX1iknaWr5TbxfP0C7vXrVLaKPvdhyp9kmRt6ahLuUHvZp49Uva/02J\nfN7/BIqd6/bo7w9/oIVvLtcDU++UJ/bIn+uBAwe0Zs0aff3110pLS9NlOTmKueNWLXnznzWemUKS\nPPHx6jN6lJqmsEUE555gMKgFCxZo3bp12rdvnzZs2KDzzz9fKSkpOv/88/XTyx/R8kOrNXNHkSoC\nXnVrfp5u6DhSSZ5Ep0u3XffhuUpq1Uo+b6VMsOaVIDEJCRrx85/YXBkQGcrKyjRr1izt3btXmzdv\n1vLly5WSkqI9e/Yop8Mg9fL1kqt/U33j2iW35dbglCwNSx0sl3XurfvO/q/xWvHuB6ecm0iSOyZG\ng8febWNVkYXriMBxz+X/VRsXbVHAV/OHvjvWpcG39tfAH/bQmjVrVFZWpszMTHXr1k1JSUfWXAb9\nfr162936ev5C+cq/dR2RpER16N9P33/77/LExTX227EV5/1HXSoqKlRQUKBdu3Zp69at2rlzp7p3\n766mTZtqwIABuuiii5wuMeIc+Gar/m/4tao4dOiEXT4tl0ueuDgNe+RHynno7NtSRD9BXXbt2qWC\nggIdPnxY69at065du+R2u3Xw4EFlZGRowIAB6tu3rwYOHOh0qRFj7azZ+ttd31fIH1DwuL03PHFx\ncsd49P2pU9R50Nn3++I6IogKu7/ep68XF58yhEhS0BdS0eSlanKpS32y+qhDhw4nnbrTHROj7015\nXWv+XaDC5ydp+xcrJSO1656poQ9OUM9rrparkU4fDESq0tJSTZ8+XaWlpVq/fr18Pp8uuugiJSUl\naejQoerYsaPTJUak5A7t9ehn87Vkyj/0yQsvqXTnLrljYpR5VY6ufGCc2vet/YyEwNlo06ZNmjt3\nrsrLy7V69Wq53W7FxMQoEAiobdu26tevn9q1a6esrKjLso0q86pcPbJwnua/+Bct/cfbqiorV0Lz\nZrr4jls1eOzdap7azukSHUUQgaOWvrtSoUDd5x93e1xKVUd16tTplGNcLpd6jhyuniOHh7FCIHo1\nadJEHo9HK1asUJMmTdS7d2+1aNFCw4cPb/Sz0ES7+KZNdNm99+iye+9xuhQgIrRu3VqlpaVatWqV\n0tPTtX37djVt2lRer1d9+vRRkyZNlJub22jX+IlmrTp11Ojf/0ajf/8bp0uJOAQROKp0b7mC9Qgi\noaBR+YGKOscB+I/du3ervLxcnTt3VnJysjIyMpSTk6O4s2wXRQCNb/PmzfJ4PMrMzFRxcbFSUlJ0\n4MABdenSpXora2LiuXdcGc4MQQSOapnWTO4Yt4L+U++aJUmxcTFqltLEpqqA6LdmzRotW7ZMw4cP\nV3x8vDZu3KgBAwawthJAgwQCARUVFamkpETf+973NH36dPn9fu3bt0/NmzdX27ZtlZWVpfT0dKdL\nRRTiEwmOGnBdb1muWq6mdlQoFFLPYd1sqAiIbqFQSEVFRVq9erVGjx6t9PR0tWrVShdffDEhBECD\nlJeXa/r06QqFQsrLy9O+fft0+PDh6osMd+nSRRkZGZz0AqeNTyU4qlWHluqZ21UxcafeOBebGKMr\nxw5SXFJ0XRsFsJvX69WHH36oiooKjR49Ws2anbsXyQJwZvbs2aP33ntPnTt3Vk5OjioqKjRv3jwd\nPnxYxcXFyszMVNOmTTV06FBZVt0rFIGaEETguO+9eIPa906tMWjEJcWq57ALNOaXVzlQGRA99u/f\nr/fee0+pqam66qqrwnqFYADnlq+++kr//ve/dfnll6tv376SpI8//ljl5eVau3atunbtqqSkJOXm\n5io+Pt7hahHNOEYEjotLitWPP/q+Pv9wjWb+7yfauX6PLJelTv0yNPyBy9Qj9wLWtgC12LRpk+bP\nn68hQ4bovPPOc7ocAFEqFApp8eLFKi4uVl5enlq0aFH92JAhQ/TMM8+oVatWat26tS6++GK1bdvW\nwWpxNiCIICK4Y9zKGtNLWWN6OV0KEDWMMVq2bJm++uorjRw5Uq1bt3a6JABRqqqqSnPmzJEkjRkz\n5qSz6xUXF6tfv35q2bKlgsGgevXi8xpnjiACAFHI7/ersLBQlZWVGjNmjBISEpwuCUCUKikp0cyZ\nM9WpUycNHDjwpBNb7Ny5U6tWrdKYMWPUpEkThUJ1n3YfqA+OEQGARrBixQoNHjxYiYmJ+s53vhPW\nZZeWlur9999XQkKCRo0aRQgBznKN2U+Ki4s1ffp09evXT4MGDTophHi9Xs2dO1dXXnmlmjQ5chp9\nzsCHcGGLCAA0gpSUFD377LNasWKFCgoKwrbc7du3a+7cuerfv7+6d+8etuUCiFyN1U8+//xzrVmz\nRldffbVSUlJOetwYozlz5qhbt25q37592F4XOIZICwBnYOLEiRo/fnz17d27d6tt27Zq0aKFLr74\n4rBexfzLL7/U3LlzlZOTQwgBzkJ29ZNAIKA5c+aouLhYY8aMqTGESNKyZcskSf379w/L6wLfRhAB\ngDNwzz336J133lFZWZkk6aWXXtItt9yixMTEsL1GMBjUxx9/rHXr1ik/P19paWlhWzaAyGFHPykr\nK9O0adPkcrl07bXXnnLZW7du1fr165WTk8OZK9FoCCIAcAaSk5OVl5enyZMnKxAI6OWXX9a4cePC\ntvyKigp9+OGH8vl8Gj16tJo2bRq2ZQOILI3dT3bt2qX3339fXbp0UXZ2ttxud43jysrKNG/ePA0d\nOpRj0NCoOEYEAM7Q/fffr1tvvVUpKSnKzMxU165dw7LcvXv3qqCgQN26dVO/fv1YKwmcAxqrn6xb\nt05LlixRdna2MjIyTjkuFApp9uzZ6tWrl1JTU8Py2sCpEEQA4Az16tVLrVq10oMPPqhJkyaFZZkb\nN27UwoULddlll6lz585hWSaAyBfufhIKhbRo0SJt375deXl5at68ea3jFy9erPj4ePXp0+eMXxuo\nC7tmAUAYjB07Vi6XS6NGjZIkbdmyRRkZGXrooYc0Y8YMZWRk6C9/+UudyzHGaPHixVqyZIlGjRpF\nCAHOQeHqJ5WVlZoxY4YOHz6s/Pz8OkPI5s2btWXLFmVnZ7MFFrZgiwgAhEFhYaEmTJhQfX79Tp06\nadu2bQ1ahs/n09y5cxUIBDRmzBjFx8c3RqkAIlw4+smBAwc0c+ZMnX/++RowYECdwaK0tFRFRUUa\nMWJEWM/2B9SGIAIAZ2DHjh3Kzs5Wu3bt9Pzzz5/2cg4dOqSZM2cqPT1dl1xyCRcMA85B4eonmzdv\nVlFRkS699FJ16dKlzvGBQEAFBQXq37+/2rRpc9qvCzQUQQQAzkBaWprWr19/RsvYunWrCgsLNXDg\nQF144YVhqgxAtDnTfmKM0fLly7V+/XqNHDlSrVu3rtfzFi5cqObNm6tHjx6n/drA6SCIAICDVq5c\nqZUrV+qqq65Su3btnC4HQJTy+/2aN2+eKioqlJ+fX+9rj2zYsEE7d+7Udddd18gVAicjiACAA4LB\noD755BOVlJQoPz9fTZo0cbokAFHq8OHDmjlzptq0aaOhQ4ee8vog31ZSUqJFixZp1KhRiomJaeQq\ngZMRRADAZuXl5Zo1a5aaNWumvLw8eTy0YgCnZ8eOHZozZ44uuugi9ezZs97P8/v9Kigo0KBBg5Sc\nnNyIFQKnxqcfAISRMUabFizSrnXr5Y6J0fmDL1GbLudXP75nzx4VFBSoR48e6tu3r4OVAoh0fq9X\na2bN1uHde5TQvLkyh+cqsUWL6sdXr16t5cuXa+jQoUpPT2/QsouKitS2bVtdcMEF4S4bqDeCCACE\nyZqZBZr6o0flPVQqEwxKLksKGaX37qlbXpqk/b4qffrpp7riiivUsWNHp8sFEKFCoZBm/n6iPnnh\nRVmWS8GAX26PR8H/Cqjfd69T/tO/0+KlS7V7926NHj1azZo1a9Dy16xZowMHDig/P7+R3gFQPwQR\nAAiDLz6Yrin3PSC/13vSY8VLl2vikKHK/MlDyrv1FrVs2dKBCgFEA2OM3hr3X1o57UP5K/7TTwKq\nkiQtf/s9rVu0WBf/5ufKz89v8LEde/fu1dKlSzV69Gh2C4XjOFE9AJwhX0WF3hr3YI0hRJJMKCR/\neYUqCuYRQgDUatOCRVo17aMTQsjxApWVKt+6Xc127WtwCKmqqtLs2bM1ZMiQOq+yDtiBIAIAZ2jF\nux/UPcgYbfn0Mx3cvqPxCwIQtQqff0G+U6zUOCZYVaV5z09q8LLnzZunjh076rzzzjvd8oCwIogA\nwBn6qvAT+crL6xznjo3VN0uX21ARgGi15bMlkjF1jivZuk2+iop6L3flypXyer0aNGjQmZQHhBVB\nBADOUCgUrPdYY0KNWAmAaGdCdYcQSZJl1Xvsrl279MUXXyg3N1cuF1M/RA7+GgHgDHUamKWYxIQ6\nx4X8fqX17GFDRQCiVWqPzHqNS2zZUrFJdV893ev1as6cObriiiu4cCoiDkEEAM7QgJtvrNeayXY9\nMk+4pggAfNuV94+rM2B44uN1xfgfyLKsWscZYzR37lx17dpVHTp0CGeZQFgQRADgDCW0aK5rfvnT\nWreKxCYl6jvP/reNVQGIRt2H56pDv4vkiY+v8XF3TIxapKXq0nvuqnNZy5cvVygUUlZW1gn3d+rU\nSV9++WUYqgXODEEEAMLg8nH36ponfqbYxETFJiVV3x/XJEnNUtvpvg+mKqNPLwcrBBANXG63xr79\nd/W85mp54uLkiY09cr/Ho5j4eHUc2F/3F3yo+Ka172a1bds2rV27Vjk5ORwXgojFXyYAhMllPxir\nX2/8UmP++3e67L7vK/uB8bpz8l/1i9XL1TGrn9PlAQgzy7L01FNPacCAATrvvPP0zjvvVD+2ePFi\nZWdnq3///urfv78++ugjSdLjjz+uiRMnSpL++c9/yuVyac+ePZKkkSNHatasWYqJj9ftf/mzfvr5\npxr+s8c05N57lPvIj7T50n5a1b6d8r77XXXt2lV33HGHzNEzbO3evVtjxoxR79691aNHDz355JMa\nOnSoEhMTVVRUpF69eqlXr16aMGFC9XMkaf369RoxYoQGDBigPn366NVXX7Xr1wcc2X+wvl/9+/c3\nACKHpKWmAf/DkfJFLwEiD/2k4SSZP/3pT8YYY+bPn2/S0tKMMcaUlJSYvn37mh07dhhjjNmxY4dJ\nT083JSUlpqCgwAwfPtwYY8y9995rLrnkEjNlyhTj8/lMcnKyKS8vP+Xr3XnnnWbw4MHG6/Waqqoq\n0717dzNr1ixjjDE33HCD+fnPf26CwaD561//alq3bm1WrVplKisrTVpamiksLDTGGPOPf/zDSDKr\nVq0yfr/f9OvXz6xdu9YYY0xpaam54IILqm8Dp6u+/cTjaAoCAACIYjfddJMkadCgQdqxY4cqKyu1\ncOFCbd68WSNGjKgeZ1mWNm7cqMGDB+vGG2+Uz+fTggUL9Mwzz2jq1KlKT09Xz549lZhY+4Hq+fn5\nij96/Ei/fv309ddfa9iwYZo9e7b++Mc/6rPPPlNqaqry8vJUWFioUCikxMREXXnllZKkG264Qffe\ne68k6auvvtLatWur34N05Orra9eu1YUXXhjOXxNQI4IIACDqvPzyy/rTn/4kY4wsy9Kjjz6q2267\nzemycA46FgrcbrckKRAIyBivv7HbAAAJB0lEQVSj3r1765NPPqnxOb1799aUKVOUmpqq7OxsPfzw\nw8rIyFBOTk69X+/YawYCgerbW7du1ebNm3Xddddp6tSpp1zGsbNtGWPUunVrrVixou43ehajnziH\nY0QAAFGna9eumjdvnlatWqUZM2bowQcf1JYtW5wuC5AkXXrppdqwYYMKCwur71uyZEn1sRk5OTl6\n4oknlJOTo7i4OGVkZOi1116rVxA5lSuuuEJPP/20cnNzdfDgQc2YMUNDhw5Vt27d5PV6VVRUJEma\nOnWqDh48KEnq1q2bEhMTNXny5OrlrFu3TqWlpaddRzSinziHIAIAiFgTJ07U+PHjq2/v3r1bbdu2\n1cCBA5WcnCxJysjIUGpqqrZt2+ZUmcAJWrZsqWnTpunXv/61+vTpo8zMTP3qV786IYgUFxdXB4+c\nnBzt379fAwcOPK3XCwaDGjVqlEpLS5Wbm6thw4bpD3/4g3r06KG4uDhNmTJF48aNU+/evTVv3rzq\na4p4PB5Nnz5db731VvVB7uPGjZPP5wvPLyLC0E8ij3Xsn6I+srKyzNKlSxuxHAANYVnWMmNMVt0j\nIwu9BPV14MABde/eXRs3blSTJk3029/+VgcOHNBzzz1XPWbevHm6/fbb9dVXXykhoe4r3KNm9JPo\nNX/+fFVWVio3N9fpUiIa/cQ+9e0nbBEBAESs5ORk5eXlafLkyQoEAnr55Zc1bty46sfXrFmjO+64\nQ1OmTGHSgHPSxo0btX37dl1++eVOlxLx6CeRh4PVAQAR7f7779ett96qlJQUZWZmqmvXrpKkDRs2\naOTIkXrxxRc1ZMgQh6sEwmPFihW66667Trp/woQJGjt27An3HTx4UAsXLtQ111yj2KMXPkTt6CeR\nhSACAIhovXr1UqtWrfTggw9q0qRJkqRNmzZp+PDhev755084RSoQ7fr27Vuvs1gFAgEVFBRo4MCB\natWqlQ2VnR3oJ5GFXbMAABFv7NixcrlcGjVqlCTpscce0/79+/XLX/5Sffv2Vd++fTVz5kyHqwTs\nU1RUpDZt2nC9j9NAP4kcbBEBAES8wsJCTZgwQS7XkfVnb7/9tsMVAc5Zu3at9u/fr/z8fKdLiUr0\nk8hBEAEARKwdO3YoOztb7dq10/PPP+90OYBtqsp8WvXBai2Z/LnK91Uormmc+lzfU52uytCSJUuU\nl5cnj4dpXEPQTyIPf8EAgIiVlpam9evXO10GYKu9G/bpb7e8Jb83IL/XL0mqKPFq/guL9PGkkIY+\nOUQtWrRwuMroQz+JPBwjAgAAECEqSyv12s1vqaLEWx1CjglUBWV8Rp/86lPt33zAoQqB8CGIAAAA\nRIgVU79UwOuXarnedKAqoAUvfmZfUUAjIYgAAABEiCWTP5e/MlDrGBM0+nLaGoWCIZuqAhoHQQQA\nACBClO+vqNe4UMjIV+GveyAQwThYHQAQFbyHSvXZG2+q6M+vqHT3bnliY5V5Va6ufGCc2vft43R5\nQFjEJsbIV+6rc5wJGcXEM407Xfs2bdYnL7yk5VPfla+8Qgktmuvi22/R4O9/T81T2zld3jmDLSIA\ngIi3f0uxnh4wWP968mmVbN2moM+vqrJyffH+dE0aka/C/53kdIlAWPS89kK5Y+qennW+pIPcMW4b\nKjr7rJz+kZ4ZPFSL/jZZ3oOHFPT7VbZ3nz6e9KKeHjBEWz5b6nSJ5wyCCAAgogX9fr1wzRiV7dsv\nv9d7wmMmFJLf69XMPzyj1f+a5VCFQPgMvLO/LHft07OYBI+GjLvEporOLjtXr9Wb906Q3+tVyH/i\nsTiBqipVlZXppetu0uE9ex2q8NxCEAEARLQvZ/xb3kOHZEKnPjDX7/Xq3089bWNVQONokdFcY569\nRp54j2Sd/HhMgkeX33+pOl3c3v7izgJznvuTAr7ad30LBvxa9Npkmyo6txFEAAARbdFfX1dVWXmd\n4/Zu+FoHvtlqQ0VA48ocfoHu/uct6pbbRe4YtzzxHrk8LnUcmKEbX7xOg39wsdMlRqVQKKSV06bL\nBIO1jgtUVunT196wqapzG0c5AQAiWunuPfUa546NUdm+fUruwJpiRL/UHm1145/HyF/pV+WhKsUm\nxSquSazTZUU1X3mFTKiWC7Qcx3vwYCNXA4kgAgCIcEmtkus1Luj3Kym5fmOBaBETH6OY+Binyzgr\nxCYm1HtsfLOmjVgJjmHXLABARBt0522KbZJU57iW7durVaeONlQEIBq53G71GDFclqv26a8nLk4D\nbrnRpqrObQQRAEBE6zN6lOISEyWrhiN3j4pJTNDVP33ExqoARKOchx+QJy6u1jEuj0eDx95tU0Xn\nNoIIACCieeLidN+0qUps0VzuGiYQMQkJunzcD9QnP8+B6gBEk/Z9++j6Z59WTELCSVtGXDEexSYm\n6u43X1PztFSHKjy3EEQAABGv3YXd9OhnRcp+YJwSW7aULEsut1vdhl6psf+YrJE//4nTJQKIEgNu\nvkEPzPpQfa/Llyc2VrIsxSYmatAdt+nhBXN1wRWXOV3iOYOD1QEAUaFpmzYa8bPHNOJnjykYCMjl\ndsuqZXctADiVtF49dNsrL0h6QcFAQG4PU2In8FsHAEQdJg0AwoV+4hx2zQIAAABgO4IIAAAAANsR\nRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDtCCIAAAAAbEcQAQAAAGA7gggAAAAA\n2xFEAAAAANiOIAIAAADAdgQRAAAAALYjiAAAAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAA\nAADbEUQAAAAA2I4gAgAAAMB2BBEAAAAAtiOIAAAAALAdQQQAAACA7QgiAAAAAGxHEAEAAABgO4II\nAAAAANsRRAAAAADYjiACAAAAwHYEEQAAAAC2I4gAAAAAsB1BBAAAAIDtCCIAAAAAbEcQAQAAAGA7\nyxhT/8GWtVdSceOVA6CBOhpj2jhdREPRS4CIRD8BEC716icNCiIAAAAAEA7smgUAAADAdgQRAAAA\nALYjiAAAAACwHUEEAAAAgO0IIgAAAABsRxABAAAAYDuCCAAAAADbEUQAAAAA2I4gAgAAAMB2/x++\nwGSXkXGpNAAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<Figure size 1008x216 with 3 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'x': 'c', 'y': 'a1', 'z': 'a_b_d'}, {'x': 'c', 'y': 'a_clone', 'z': 'a_b_d'}, {'x': 'c', 'y': '10708446', 'z': 'a_b_d'}, {'x': 'a_clone', 'y': 'e', 'z': 'a_b_d'}, {'x': '10708446', 'y': 'e', 'z': 'a_b_d'}, {'x': 'a1', 'y': 'e', 'z': 'a_b_d'}]\n"
     ]
    }
   ],
   "source": [
    "instances = g.find_matching(pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Rewriting rule to Cypher: \n",
      "\n",
      "// Match nodes and edges of the instance \n",
      "MATCH (lhs_x:node { id : 'c'}), (lhs_y:node { id : 'a1'}), (lhs_z:node { id : 'a_b_d'}) , (lhs_y)-[lhs_y_lhs_x:edge]->(lhs_x), (lhs_y)-[lhs_y_lhs_z:edge]->(lhs_z), (lhs_z)-[lhs_z_lhs_z:edge]->(lhs_z)\n",
      "\n",
      "// Cloning node 'y' of the lhs \n",
      "// Create clone corresponding to 'y2' of the preserved part\n",
      "WITH ['a_b_d'] as sucIgnore, [] as predIgnore, lhs_z, lhs_x, lhs_y \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_y)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, lhs_z, lhs_x, lhs_y \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(lhs_y) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, suc_maps, lhs_z, lhs_x, lhs_y \n",
      "// create a node corresponding to the clone\n",
      "CREATE (p_y2:node) \n",
      "WITH p_y2, toString(id(p_y2)) as p_y2_id, lhs_y.id as original_old, lhs_x, lhs_z, lhs_y, suc_maps, pred_maps \n",
      "// set the id property of the original node to NULL\n",
      "SET lhs_y.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET p_y2 = lhs_y\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET p_y2.id = toString(id(p_y2)), p_y2.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET lhs_y.id = original_old\n",
      "WITH p_y2, toString(id(p_y2)) as p_y2_id, lhs_x, lhs_z, lhs_y, suc_maps, pred_maps \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_y2)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(p_y2) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH lhs_x, p_y2, lhs_z, lhs_y \n",
      "\n",
      "// Create clone corresponding to 'y1' of the preserved part\n",
      "WITH [] as sucIgnore, [] as predIgnore, lhs_x, p_y2, lhs_z, lhs_y \n",
      "// match successors and out-edges of a node to be cloned\n",
      "OPTIONAL MATCH (lhs_y)-[out_edge:edge]->(suc) \n",
      "WHERE NOT suc.id IS NULL AND NOT suc.id IN sucIgnore\n",
      "WITH collect({neighbor: suc, edge: out_edge}) as suc_maps, predIgnore, lhs_x, p_y2, lhs_z, lhs_y \n",
      "// match predecessors and in-edges of a node to be cloned\n",
      "OPTIONAL MATCH (pred)-[in_edge:edge]->(lhs_y) \n",
      "WHERE NOT pred.id IS NULL AND NOT pred.id IN predIgnore\n",
      "WITH collect({neighbor: pred, edge: in_edge}) as pred_maps, lhs_x, p_y2, lhs_z, lhs_y, suc_maps \n",
      "// create a node corresponding to the clone\n",
      "CREATE (p_y1:node) \n",
      "WITH p_y1, toString(id(p_y1)) as p_y1_id, lhs_y.id as original_old, lhs_x, p_y2, lhs_z, lhs_y, suc_maps, pred_maps \n",
      "// set the id property of the original node to NULL\n",
      "SET lhs_y.id = NULL\n",
      "// copy all the properties of the original node to the clone\n",
      "SET p_y1 = lhs_y\n",
      "// set id property of the clone to neo4j-generated id\n",
      "SET p_y1.id = toString(id(p_y1)), p_y1.count = NULL\n",
      "// set back the id property of the original node\n",
      "SET lhs_y.id = original_old\n",
      "WITH p_y1, toString(id(p_y1)) as p_y1_id, lhs_x, p_y2, lhs_z, lhs_y, suc_maps, pred_maps \n",
      "// copy all incident edges of the original node to the clone\n",
      "FOREACH (suc_map IN suc_maps | \n",
      "\tFOREACH (suc IN CASE WHEN suc_map.neighbor IS NOT NULL THEN [suc_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (p_y1)-[new_edge:edge]->(suc) \n",
      "\t\tSET new_edge = suc_map.edge))\n",
      "FOREACH (pred_map IN pred_maps | \n",
      "\tFOREACH (pred IN CASE WHEN pred_map.neighbor IS NOT NULL THEN [pred_map.neighbor] ELSE [] END |\n",
      "\t\tMERGE (pred)-[new_edge:edge]->(p_y1) \n",
      "\t\tSET new_edge = pred_map.edge))\n",
      "WITH lhs_x, p_y2, lhs_z, lhs_y, p_y1 \n",
      "\n",
      "// Removing node 'x' of the lhs \n",
      "DETACH DELETE lhs_x\n",
      "\n",
      "WITH p_y2, lhs_z, lhs_y, p_y1 // Renaming vars to correspond to the vars of rhs\n",
      "WITH p_y2, p_y1 , lhs_y as p_y, lhs_z as p_z \n",
      "\n",
      "// Adding node 'new_node' from the rhs \n",
      "CREATE (rhs_new_node:node) \n",
      "SET rhs_new_node.id = toString(id(rhs_new_node)) \n",
      "WITH toString(id(rhs_new_node)) as rhs_new_node_id , p_y, p_z, p_y2, rhs_new_node, p_y1\n",
      "WITH p_y, p_z, rhs_new_node_id, p_y2, rhs_new_node, p_y1 \n",
      "\n",
      "// Renaming vars to correspond to the vars of rhs\n",
      "WITH rhs_new_node_id, rhs_new_node , p_y as rhs_y, p_z as rhs_z, p_y1 as rhs_y1, p_y2 as rhs_y2 \n",
      "\n",
      "// Adding edge 'new_node->z' from the rhs \n",
      "MERGE (rhs_new_node)-[:edge {  }]->(rhs_z)\n",
      "\n",
      "// Return statement \n",
      "RETURN rhs_y2, rhs_new_node_id, rhs_z, rhs_y, rhs_new_node, rhs_y1\n",
      "\n",
      "\n",
      "\n",
      "Rewriting rule to commands: \n",
      "\n",
      "CLONE y AS y2.\n",
      "CLONE y AS y1.\n",
      "DELETE_NODE x.\n",
      "DELETE_EDGE y2 z.\n",
      "ADD_NODE new_node {}.\n",
      "ADD_EDGE new_node z {}.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g = g.rewrite(rule, instances[0])\n",
    "print(\"\\n\\nRewriting rule to commands: \\n\")\n",
    "print(rule.to_commands())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'new_node': '10708543',\n",
       " 'y': 'a1',\n",
       " 'y1': '10708542',\n",
       " 'y2': '10708541',\n",
       " 'z': 'a_b_d'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rhs_g"
   ]
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
