{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "\n",
    "from regraph import Rule, plot_rule\n",
    "from regraph.neo4j.graphs import Neo4jGraph\n",
    "from regraph.neo4j.cypher_utils import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "g = Neo4jGraph(\"bolt://localhost:7687\", \"neo4j\", \"admin\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "res = g.clear()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7fcd782d6ef0>\n",
      "<neo4j.v1.result.BoltStatementResult object at 0x7fcd782d6eb8>\n"
     ]
    }
   ],
   "source": [
    "nodes = [\"a\", \"b\", \"c\", \"d\", \"e\", \"f\"]\n",
    "edges = [(\"a\", \"b\"), (\"d\", \"b\"), (\"a\", \"c\"), (\"e\", \"a\"), (\"f\", \"d\")]\n",
    "g.add_nodes_from(nodes)\n",
    "g.add_edges_from(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7fcd782d6908>\n"
     ]
    }
   ],
   "source": [
    "g.add_node(\"x\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7fcd782d6780>\n"
     ]
    }
   ],
   "source": [
    "g.add_edge(\"x\", \"c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7fcd782d6780>\n"
     ]
    }
   ],
   "source": [
    "g.remove_edge(\"x\", \"c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['d', 'e', 'f', 'x', 'a', 'b', 'c']"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('f', 'd'), ('e', 'a'), ('a', 'b'), ('d', 'b'), ('a', 'c')]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.edges()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "uid\n",
      "MATCH (x:node { id : 'a' })  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'a' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , x UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['a' + same_id_node.count] ELSE ['a'] END AS uid CREATE (new_node:node { id : uid }) WITH uid, x, new_node OPTIONAL MATCH (x)-[:edge]->(m:node), (o:node)-[:edge]->(x) WITH COLLECT(m) AS ms, COLLECT(o) AS os, uid, x, new_node FOREACH(o IN os | FOREACH(p IN CASE WHEN NOT o.id IN [] THEN [o] ELSE [] END | CREATE UNIQUE (p)-[:edge]->(new_node) )) FOREACH(m IN ms | FOREACH(p IN CASE WHEN NOT m.id IN [] THEN [m] ELSE [] END | CREATE UNIQUE (new_node)-[:edge]->(m) )) RETURN uid \n",
      "Created clone by the name:  a1\n"
     ]
    }
   ],
   "source": [
    "res_clone_1 = g.clone_node('a')\n",
    "print(\"Created clone by the name: \", res_clone_1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "uid\n",
      "MATCH (x:node { id : 'a' })  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'a_clone' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , x UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['a_clone' + same_id_node.count] ELSE ['a_clone'] END AS uid CREATE (new_node:node { id : uid }) WITH uid, x, new_node OPTIONAL MATCH (x)-[:edge]->(m:node), (o:node)-[:edge]->(x) WITH COLLECT(m) AS ms, COLLECT(o) AS os, uid, x, new_node FOREACH(o IN os | FOREACH(p IN CASE WHEN NOT o.id IN [] THEN [o] ELSE [] END | CREATE UNIQUE (p)-[:edge]->(new_node) )) FOREACH(m IN ms | FOREACH(p IN CASE WHEN NOT m.id IN [] THEN [m] ELSE [] END | CREATE UNIQUE (new_node)-[:edge]->(m) )) RETURN uid \n",
      "Created clone by the name:  a_clone\n"
     ]
    }
   ],
   "source": [
    "res_clone_2 = g.clone_node('a', 'a_clone')\n",
    "print(\"Created clone by the name: \", res_clone_2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "res_merge = g.merge_nodes([\"a\", \"b\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'a_b'"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res_merge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", \"y\", \"z\", \"a\"])\n",
    "pattern.add_edges_from([(\"x\", \"y\"), (\"y\", \"z\"), (\"z\", \"z\"), (\"z\", \"a\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'x': 'f', 'y': 'd', 'z': 'a_b', 'a': 'c'}, {'x': 'e', 'y': 'a_clone', 'z': 'a_b', 'a': 'c'}, {'x': 'e', 'y': 'a1', 'z': 'a_b', 'a': 'c'}]\n"
     ]
    }
   ],
   "source": [
    "instances = g.find_matching(pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "clone_name, _ = rule.inject_clone_node(\"y\")\n",
    "clone_name, _ = rule.inject_clone_node(\"y\")\n",
    "rule.inject_remove_edge(clone_name, \"z\")\n",
    "rule.inject_remove_node(\"x\")\n",
    "rule.inject_merge_nodes([\"y\", \"a\"])\n",
    "rule.inject_add_node(\"new_node\")\n",
    "rule.inject_add_edge(\"new_node\", \"z\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzt3Xl4VfW97/H3bw+ZExLIACFAGALE\nkDAFpEqtTCLiRJ0ovcfjc6s9WrnUe3ru0+lUe08nO9p6Tq+n6rEetfU49bS1WrEOVZwgIYSZJIQk\nzJlICBl29rTuH0gqQ0aStfdOPq/n4XmEvfZe3yD5Zn3Wb/1+P2NZFiIiIiIiInZyhLoAEREREREZ\neRRERERERETEdgoiIiIiIiJiOwURERERERGxnYKIiIiIiIjYTkFERERERERspyAiIiIiIiK2UxAZ\nRowx1caY5ef82ZXGmMMXOPavxpg7P/H7bxhjqowxrcaYw8aY5+yoWUQi08f9puPjnlFrjPm1MSYh\n1HWJSHg5p1ccN8Y8eaZXfPzf3z3n+GxjjGWMcX38+yxjzEvGmAZjzEljzE5jzB0h+FJkCCiICMaY\nvwf+DlhuWVYCUAi8GdqqRCQCXPdxz5gHLAD+OcT1iEh4OtMr5gBzga/3471PA4eAScAY4HagdtAr\nlJBwhboACQsLgI2WZVUCWJZ1HHg0tCWJSKSwLOuIMebPwKxQ1yIi4cuyrOPGmI2cDiR9tQD435Zl\ntX38+22DX5mEikZEBOAj4HZjzP8xxhQaY5yhLkhEIocxZgJwDbpAEJEeGGOygFXA/n687SPgl8aY\ntcaYiUNTmYSKgsjIkGmMaf7kL2DxmRcty3oG+F/ASuAdoM4Y87UQ1SoikeP3H/eT9zjdO74f4npE\nJDz93hhzitOPWNUBD3zitX865/pkxznvvQXYBHwLqDLGlBpjFthStQw5BZGR4ahlWcmf/MXpC4cu\nlmX9xrKs5UAycDfwL8aYlaEoVkQixo0f95RJlmV9ybKsjlAXJCJh6UbLshKBK4GZQOonXvvJOdcn\nBZ98o2VZTZZlfc2yrDwgAyjldLAxNtUuQ0hBRM5iWZbPsqwXOH1HQs97i4iIyKCwLOsd4EngJwN8\nf8PH780ERg9eZRIqCiLDj9sYE3PmF31YkMAYc4cxZrUxJtEY4zDGrALygM1DXq2IiIiMJD8HVhhj\n+jRh3RjzQ2PMLGOMyxiTCNwD7Lcsq3FIqxRbaNWs4efVc37/fh/e0wJ8A3gGcAI1wD2WZb3X47tE\nRERE+sGyrHpjzFOcnvNxqg9viQP+GxgHdHD6Jun1Q1eh2MlYlhXqGkREREREZITRo1kiIiIiImI7\nBREREREREbGdgoiIiIiIiNhOQURERERERGzXr1WzUlNTrezs7CEqRUT6a+vWrQ2WZaWFuo7+Ui8R\nCT/qJyIyWPraT/oVRLKzsykuLh54VSIyqIwxNaGuYSDUS0TCj/qJiAyWvvYTPZolIiIiIiK2UxAR\nERERERHbKYiIiIiIiIjtFERERERERMR2CiIiIiIiImI7BREREREREbGdgoiIiIiIiNhOQURERERE\nRGynICIiIiIiIrZTEBEREREREdspiIiIiIiIiO0URERERERExHYKIiIiIiIiYjsFERERERERsZ2C\niIiIiIiI2E5BREREREREbKcgIiIiIiIitlMQERERERER2ymIiIiIiIiI7RRERERERETEdgoiIiIi\nIiJiOwURCWs/+tGPWL9+fdfva2trycjIoL29PYRVifTuscceo6CggPz8fAoKCnjmmWdCXdKIp34i\nkUr9JHT62zc+//nPU1hYSH5+PmvWrKGpqcmuUiOSgoiEtbvuuosXX3yR1tZWAB599FHWrVtHXFxc\niCsT6VlOTg7vvPMOO3fu5NVXX+W+++6juro61GWNaOonEqnUT0Knv33jF7/4BcXFxezcuZO8vDx+\n+MMf2lluxFEQkbCWkpLC9ddfz9NPP43f7+exxx7jnnvuCXVZIl26u1u2cOFCUlJSAMjKymLcuHEc\nPnw4VGUK6icS/tRPwk9/+8ZTTz3F/Pnzyc/P57e//S2lpaU2Vht5XKEuQKQ3GzZsYN26daSnp5Ob\nm8v06dNDXZJIl7vuuovc3FwefPBBEhISLni37K9//SvNzc3Mnz8/hJUKqJ9IeFM/CU997RubNm3i\nkUce4YMPPiAtLY3f/va3PProozZXG1k0IiJhb9asWYwZM4b77ruPe++9N9TliJylt7tle/bs4fbb\nb+fZZ58lNjY2hJUKqJ9IeFM/CU997RvNzc2MGjWKMWPG0NnZyRNPPGFjlZFJQUQiwp133onD4WD1\n6tWhLkXkPBs2bOCRRx7hD3/4w1l3yyoqKrjmmmv41a9+xeLFi0NcpZyhfiLhTP0kPPWlb6xatYqp\nU6cyc+ZMVq1axbx582ysMDLp0SyJCG+//Tbr16/H6XSGuhSR83zybtkvf/lLAA4cOMDKlSt5+OGH\nWbVqVYgrlE9SP5Fwpn4SnvrSN1wuF88995yNVUU+jYhIWDt69CgzZsygoqJCj1FIWDv3btlXv/pV\nGhsbuf/++5kzZw5z5sxh48aNIa5yZFM/kUihfhI+1DeGlkZEJKxlZmZSVlYW6jJEenXu3bIXXngh\nxBXJudRPJFKon4SPC/WNf/mXf+F3v/vdece+/vrrpKen21XasKAgIiJyEY4ePcqSJUsYO3YsDz/8\ncKjLEZEIpn4SGe6//37uv//+UJcxLCiIiIhcBN1lF5HBon4iI43miIiIiIiIiO00IiJhrzlwjBrf\nNnx0kGBSmRK1kCij9dNFpH8sy+Kofw+1gf1YBEl1TmaCqwCH0T05Eekfv+WlylfEyWAtTtxMdM9m\njHNiqMuKOAoiErbagyf5S9vD1AUqsbAI4sdFNJs6nqQg+moWxtyC0QWEiPTBMX8Zb7T9G51WG368\nALiJxmmiWBL3RSa554a4QhGJBJZlsaPzzxR5XsRg8OHBgZNiz+9IcWRyVfyXSXJqwnpf6SpOwpIn\n2MrvTn2L44EKAvgI4gfATycBvOzs3Mi7Hb8OcZUiF9YSqKPGt41Dvh10BttCXc6Id9xfziutD9Jm\nncBPJ2ABFj48eKwWXm97mBpfSajLFDmPZVnU+Sup9pVwzL+PoBUIdUkj3lbPf1PkeRE/nfjwABAk\nQAAvjcEaXmr9Fq3BxhBXGTk0IiJhqaTzD7RbJ7G4cNP100m59z3yopeT6pxkc3UiF1bnP8D7Hf9J\nQ6AGBy4MEMDPFPdCLov9O2IdiaEuccSxLIu32v+9axTkQgJ4eav9V/x90v/DYbTJoYSHss532eJ5\ngU6rHQcGCwuHcTI7ejVzo6/TEwEh0BpsZFvnHwngu+DrFhZeq50PO37Livj/ZXN1kUn/iiXsBCw/\nezvf6hoF6U4QPzs8f7apKpGeHfXv5Y+t36E2sJ8APnx04KWDAD4qfR/x0qlv0hE8FeoyR5y6wH7a\ng829Hhe0/NT4ttlQkUjvtnS8yKaOX388iufBSwc+PHRabZR4fs9f2v8VywqGuswRZ3fnG1i9HGMR\npNq3VaPhfaQgImHnVLChT8dZBDkeKB/iakR6F7D8bGx7qNu77kECtFvNbOp4wubKpC5wAIveL9h8\neKgLVNpQkUjP6v1VbO98pdt+4sfLQd929vs+srkyOerfR7Cb0ZBPcuDiRPCwDRVFPgURCUtWr/cc\nRMJHtW9rr89uBwlQ49umURER6dH2zld6vdj100mp52WbKpIzzCAfJwoiEoYSHamYPvzTNDgY55xh\nQ0UiPavxlXRNWuyJAxfH/dqszE7pzml96iduYshw5dhQkUjPDvl39ulm3IngYfxW93OfZPBlunJx\n9mF6dQA/ox1ZNlQU+RREJOw4jYtLopf2+s3uwEVBzCqbqhLpXk8Toc9mdTvJUYZGunMK8Y7RvR7n\nNG4muubYUJFIz6w+roxlML3OpZTBlRe9gt7GOwwOJrsXEO2It6eoCKcgImFpXvQNxJpkHFx4BRsX\n0cyM+ow2D5KwMMYxCSfuXo+zsEh2ZtpQkZxhjGFp3N24iOr2GCdRLI27WxsbSlhIcmT06TiXicaN\nNve1U7wjhfkxazCBC1+bGBxEm3g+FbvO5soil7quhKVoRzw3JX6Hcc6ZEHBg+Q1WEIJeA34Hs6NX\nszj270NdpggAudFX9um4REeqlpsOgQzXNK5L+Abx1hjwO3HgxODETQxxJpmr4/83E90aDZHwMDvm\nGlxE93iMAxd5USswRrMR7JZnroYdUwh4wN9hQRAclhMnbtKck7kp8bvEO1JCXWbE0D4iErZiHUnM\nP3UHrVs30pJQTfOpRnwnHaR5c5n79zeoAUvYiHMkkxe9gj2db368Yd75XEQpPIdQhiuHnPJ1tMUe\nY8z0KCyCpDqzyXLlaT8GCStT3JeyzfFHmoPHCF5gLy2DIcrEURB9dQiqk8rKSkxFJn/80ftc8blZ\nZM0cw9yC+UxwF5DiHB/q8iKOgoiEtfLycvImzWf37hjq9u+nqamJ9JlOWltbSU5ODnV5Il0+FfM5\nLILs6XwTC6vr2e0zdzaXx9/LeHdeKEsc0SzLYn/FflavXk1KjO5WSvhyGhfXJ3yLV9t+zInAIQJ4\nuyavu4khxpHIdfHfINaRFOJKR6by8nJqa2vp7PAxpn0G+a6FFMTMC3VZEUtBRMKWz+ejurqaSy+9\nlIMHDxITE4PHc3plolOnTimISFgxxsHlsX/H7Ohr2NP5JvWBKhy4yHbPY1rUp3CbmFCXOKIdOXKE\n+Ph4UlIUQiT8xTgSWJPwbeoCB9jb+RatViMxJpEZUVdoFC+Empubqauro6ysjMmTJ+NwOJg+fXqo\ny4poCiIStqqqqhg7diyxsbEkJCScF0REwlGCYwwLY28NdRlyjvLycl0wSEQxxpDhmkqGa2qoS5GP\nlZeXEwgEOHjwINdccw2ZmZkkJCSEuqyIpkgtYeuTFw6JiYlERUXh9/sJBAIKIiLSZ16vl4MHDzJ1\nqi7oRGRgLMuioqKCqqoq4uPjGT16tG5uDAIFEQlLra2tNDY2MmnS6RWGEhMTMcYQHR1NZ2engoiI\n9NmBAwfIzMwkJkaPx4nIwLS1tREVFcX+/fuZOnUqLpeLyZMnh7qsiKcgImGpoqKCqVOn4nSeXqs7\nMTERgJiYGAUREekXPZYlIhcrISGBlStXEhcXx4033khubi5ud+/7R0nPNEdEwlJ5eTlLlizp+v2Z\nIBIdHY3H41EQEZE+aWlpobm5mYkTtfmpiFycv/71r8yePZvly5eHupRhQyMiEnbq6uoASE9P7/qz\nuLg4HA5H14R1j8eD3+8PVYkiEiEqKiqYNm0aDod+3InIxfnwww+54oorQl3GsKLOLGHnQo9ROBwO\n4uPjtXKWiPSZZVl6LEtEBkVNTQ3Nzc3Mnz8/1KUMKwoiElYCgQCVlZXk5OSc91piYmLXHBFQEBGR\nnh0/fhyXy0VqamqoSxGRCPfWW28xf/58XC7NahhMCiISVmpqahgzZswF1+U+E0Q0IiIifaHREBEZ\nDMFgkKKiorPmroZadnY2u3btCnUZF01BRMJKTxcOiYmJuN1u7SUiIr3y+/1UVVVdcHRVRKQ/SkpK\nSEhI0F5EQ0BBRMJGR0cHx48f73Zd7nP3EmltbbW5QhGJFNXV1WRkZBAXFxfqUkQkjBlj+P73v8+C\nBQuYMmUKL730UtdrmzdvZsmSJaxZs4aXXnqJV155BYCvf/3r/PjHPwbg+eefx+FwdC20c8011/D6\n6693e7477riDu+++m6VLl5KTk8Ptt9+OZVkA1NbWsmbNGgoKCsjPz+epp57qet+mTZvIz89n4cKF\nbNiwoes9AGVlZaxatYoFCxYwe/Zsfv3rXw/eX9AQUxCRsFFRUUF2dna363J/ci8RLeErIj3RY1ki\n0ldJSUkUFRXx9NNPs2HDBgCam5u5++67efzxx1m5ciWvvPIK//AP/0BzczPLli3jzTffBODNN99k\n0aJFvPXWW/h8PjZv3szixYt7PN+uXbt49dVX2b17N1u3buWNN94AYMOGDcyaNYsdO3bw+uuv89Wv\nfpVdu3bR2dnJ2rVr+dd//Ve2bNnC4sWLOXjwIHB69HfdunU89NBDFBUV8d577/Hggw+yb9++Ifwb\nGzyacSNho7y8nMsuu6zb10eNGkVBQQExMTFkZmZSWFhoY3UiEina2tqor6/nqquuCnUpIhIB1q5d\nC8CiRYs4evQoHo+HDz74gKqqKq666ira29spLi7GGMP+/fu5/PLLufXWW/F6vbz//vv85Cc/4cUX\nX2T8+PHk5+f3OhJ74403EhMTA8C8efOorKxkxYoVvPHGG/z0pz8FYNy4caxevZq3336bYDBIXFwc\nV155JQC33norX/ziF4HT10579+7t+hoAOjs72bt3LzNnzhzsv6pBpyAiYaGxsRGv18u4ceO6PSY2\nNpZFixZ1rZyVnJxsY4UiEikqKiqYPHmyVrcRkT45EwqcTidwepTBsiwKCgr4zGc+w4oVK87bP2T2\n7Nk8++yzjBs3jiVLlvCVr3yFrKwsli5d2ufznTnnJ/dFM8acdawx5qzHsM5lWRapqamUlpb2/oWG\nIT2aJWHhzGMU534DXkhCQoIeyxKRbumxLBG5WJdddhllZWVs27aNRYsWAVBUVNQVCpYtW8YDDzzA\nsmXLiI6OJisriyeffJJly5YN+JzLly/n0UcfBU4vP/7qq6+yZMkSZs6cSUdHB++++y4AL774IidP\nngRgxowZxMXF8fTTT3d9zr59+2hpaRlwHXZSEJGQCwaD7N+/v8+r2yQmJmqiuohcUF1dHcFgkLFj\nx4a6FBGJYCkpKdx7772Ul5ezYMECcnNz+fa3v31WEKmpqekKHsuWLaOhoYGFCxcO+JwPP/ww27dv\np6CggBUrVvDggw+Sl5dHdHQ0zz77LPfeey8LFy6kuLiYiRMnAuByuXj55Zf5r//6LwoKCsjLy+NL\nX/oSXq/34v8SbGB6Gu45V2FhoVVcXDyE5chIVFNTQ2lpKTfccEOfjm9vb+fFF1/k9ttvH+LKwp8x\nZqtlWRE3WUa9RIbKe++9R1xcHPPmzQt1KRFH/UTkbBs2bOCee+4hNzc31KVEnL72E42ISMj19zGK\nuLg4fD7fWc9UiogEAgEOHDigvUNE5KLt2LEDp9OpEDLEFEQkpDo7Ozly5Ei/NwlKTEzUPBEROcvB\ngwcZPXp011LfIiID9c4773TNDemv0tJS5syZc96vxx9/fJCrjHwKIjKkXn311bO+CaOiovjDH/7Q\n9XplZSUTJkwgKiqqX5+rCesiI09v/UST1EWkr3rqJx6Phx07drBkyZIBffacOXMoLS0979edd945\nmF/CsKAgIkPqmmuu6foGvPfeeyksLGTlypVdrw/0wkET1kVGnp76SUdHB8eOHWPy5MkhrlJEIkFP\n/eT9998nKyuL9PT0EFc5/GmRdbHFxo0b+elPf8qmTZu61s9ubm6mtbWV8ePH9/vzEhMTI2ZpOhEZ\nXBfqJ/v372fSpEm43e4QVycikeRC/eS9997rdXd0GRwKIjLktm/fzt13383GjRtJS0vr+vPy8nKm\nTZuGw9H/gbnExEQaGhoGs0wRiQA99ZOBPs8tIiPThfpJQ0MDhw8f5vLLLx+Uc/gtP+82vc0bJ16n\nI9DGtLjprEm/hczo/t+EHY4URGRIHTlyhJtuuomnn376rEewLMuioqKCVatWDehzNVldZOTprp+c\nOHGCzs5OMjMzQ1idiESS7vrJW2+9RUFBwVm7nw/Uztbt3Ff2JbxBL+3BNgA+PPk+zxz7T1aOWcU3\nJ/9f3I6RPYqrICJD6vHHH6e+vp7169d3/dlDDz1ETk4OsbGxjB49ekCfqyAiMvJ0109iY2PJycnB\nGBPC6kQkknTXTz766CPuuOOOi/78/e0V3LP3C3QE28/6c5/lA+AvJ17DZ/n43rQfX/S5Ipkmq8uQ\neuCBBzh58mTXhLDXXnuNlpYW/vKXv1zUpNLY2Fj8fj8+n28QqxWRcHZuP3niiSfw+Xx8+OGH/V4C\nXERGtnP7yQ9+8AOOHTvGqVOnKCgouOjP/8XBn+AJdnT7uifo4e0Tb3Cgff9FnyuSKYiIrcrLyzly\n5AjvvPMOmzdvZteuXQP+LC3hKzJyWZbFvn37KCkpoaKigldeeYW6urpQlyUiEejEiRMcOnSIV155\nhUAgwEsvvUQgEBjw5zX6Gihu2YyF1eNxfsvPs7XPDPg8w4GCiNjG7/dTWVlJQ0MDycnJOBwOkpKS\nBvx5WsJXZOQ6evQora2t1NbWkp6ejs/nIyUlJdRliUgEKi8vJxAIcPDgQWbOnElsbCxOp3PAn3fI\nc5AoR+/7owUIUNa2d8DnGQ4URMQ21dXV+Hy+rguHuLg4srKyBvx5miciMnKVl5fj8/loamoiLS2N\nyZMna+leEem3YDDI/v37qaqqIikpieTk5IveGNVt3AStnkdDuo7VZHURe5SXl+PxeGhvb2f06NED\nXrr3DAURkZHJ5/NRVVVFfX09KSkpuN1u7aguIgNy5MgR2tvbqaioYOrUqbjdbrKzswf0We3t7VRV\nVVFWWY4vzdvr7f4YRwyfSV46oHMNFwoiYou2tjaOHDlCbW0taWlpOByOi75wSExM1DPhIiNQVVUV\nfr+furo6Jk6cSHx8vJbuFZEBKS8vp729nfr6epYsWcKUKVNwufp+eXwmfBw4cIATJ04wadIkCucs\n4ObAWl6qfw6v5e32vZZlcUP6Zwfjy4hYCiIypPytpzhZ9CGH9+xhXH09FbXHyci9hNTU1AEv3XuG\nJquLjCyeY0do2VZE3c6djG5tA08HycnJWrpXRPrFCgZp3buLln278e3Ygf94HePHjSMmJqZPN0k7\nOjq6wkdDQwOTJk2ioKCArKysrrklXwpsYPOpDzjsOXTBMBLtiOH+yd9hlCt50L++SKIgIkPCCgQ4\n9txTnNj0NhiDw+tlArAW6DhUTtLii9+xNCkpSUFEZATwnWzm4CM/p6PmAFYgyKhggHgMUx0W9Qf3\nk3PLLaEuUUQiRFvFPg7+6mGCHR0EOz2MB8YEgyxJjqK27SRjx44lEAgQDAbPmnfm8XioqqrqWnRn\n4sSJzJo1iwkTJlxwYnucM54n8/6Ln9Y8yGuNr+A2LiwgaAXIiBrLVyZ9ncuSF9v3hYcpBREZdJZl\nceg//h8tpcVYn9jnw/HxL2drC64XniYwaxbO+IQBnycmJoZAIIDX6yUqqvfVKUQk8gTa26j83rfw\nNTdB8G/Labo+XhYzo+E4LS88Q/I/bNCoiIj0qL2ygqqHfoDlPXuEIsbhACvI+H3b+eDXj1HhiGL2\n7Nnk5uZSXV1NZWUl9fX1TJgwgVmzZpGVldWnx7finfHcP+U7fGXS19h2qhhv0EtW9ASmx88cqi8x\n4iiIyKBrP1BBS+nW877Rz3AAgdYW6l57mXE3fe6iznVmCd+LfcxLRMJT/Wsv429pPiuEfJIjGODU\nzm20V1YQP00T1kWke4ef/FW31yYAjkCAuI/e5fD4aVRUVJCTk0NWVhaXXHIJEyZM6NfckU+Kd8az\nOPkzAy17WNPyvSPE5z//eQoLC8nPz2fNmjU0NTUN2bkaNr6C5ev+Gx3A8vs58de/YPn9F3UurZwl\nYj+7+okVCND4du99wvJ6qd/4pyGpQUSGh47qA3gbG3o9LhAIMKr+OHFxcVx77bUsX76cyZMnDziE\nSM8UREaIX/ziFxQXF7Nz507y8vL44Q9/OGTn6qiqhD6sn20FAvhONl/UuTRhXcR+dvUT38lmrEAf\nblZYFh3VlUNSg4gMDx0Hq6CXnc4Bog3MSEpg4sSJdHR0DH1hI5zi3Qjx1FNP8Zvf/Aav10tbW9vQ\nrrnfj+e0L/aZbo2IiNjPrn7ScuoUgUCgT3fMDJofIiLdO9HURMDft34yecpkVvyP/6F5ZzbQiMgI\nsGnTJh555BFee+01du7cyXe/+108Hs+QnS8uZ0afwojDHYUrOeWizqUgImIvO/pJe3s77777Lv+9\n8XX8fQkYDsfpviMico66ujpefvllPqw6hNWHpzUcMTGkzylUCLGJRkRGgObmZkaNGsWYMWPo7Ozk\niSeeGJLzBINBysrK2BNwMM3hwBG48ORSAON2M2bZSsxF7KwOf5usLiL2GMp+4vV62b59Ozt37qSt\nrY1t27ZR19jIqtRRuHu4JjAuF2lXrR60OkQk8jU3N1NUVERVVRVer5eDR48xLmiRbuj59obDQdKc\n+XaVOeIpiIwAq1at4plnnmHmzJlkZWVRWFjIli1bBu3zLcuisrKS4uJiEhMT+fRnb8aXGEvT++9g\neTvPO964XESNSSP1qmsv+twaERGx11D0k0AgwJ49e9i2bRunTp1i165d7Nmzh/T0dKIXLcZ3pBKn\n14MjGDzvvSYqmpTLPk1s9pSLqkFEhof29nZKSkrYu3cvfr+fQ4cOcezYMTIyMjiUO4fU8h04goEL\nhhETFcWEO+/FaGK6bfQ3PQK4XC6ee+65Ifns6upqiouLcbvdXHHFFWRmZgJgrbsD16hkGv78BzCG\noM+PcTohGCRh1mwm/M+7ccbEXPT5tZeIiL0Gs5+cuYlRVFREc3MzZWVlbN++naSkJJYvX05GRgaj\nRo0i9YYbcb79Gq07S8HhwAr4cbjdYFmkrryO9Os+Oyj1iEjk8nq97Nixgx07duD1ejl+/DgHDx4k\nJSWFuXPnEhMTw9gJExi7ciUtLzyDt6EOghZgYZwuHLFxZN3xRRJnzQ71lzKiKIjIgBw+fJji4mL8\nfj8LFy5k4sSJZ71ujCHj2jWkXbWalu1b8TWdwBkTQ2LBXNzJg7vnx5lRkTFjxgzq54rI0Dl8+DCb\nN2+mvr6eAwcOUFpaisvlYvHixUyYMIHY2Fjmz5/PzJkzcTgccMkl+JqbOLWjhIDHgzt5NElz5uPQ\nDQiRES0YDLJnzx5KSkro6OigoaGB6upqYmNjmTVrFgkJCaSmprJo0aKum6Vj82fTUVNF2/4ysCxi\nsiYSP+MSzQsJAQUR6Zfa2lqKiopoa2ujsLCQKVOm9PiN64iKInnBp4a0JgURkcjR0NDA5s2bOXz4\nMIcOHaKkpAS/38+cOXOYMmXv1vywAAAP5klEQVQK0dHRzJ49m/z8fNxu91nvdSenMPqKZSGqXETC\niWVZHDhwgKKiIlpaWmhqaqKqqgpjDDk5OSQnJ5OUlMSCBQsueK0SO2kysZMmh6h6OUNBRPqksbGR\noqIiTpw4wfz588nJyTl9lzIMaMK6SGQ4cuQIf/rTnzh+/DglJSW0traSn5/PjBkzcLvdXHLJJcyd\nO5fY2NhQlyoiYW7Lli1s376d1tZWqqqq8Hg8ZGdnk5qa2jWimpubGzbXKnJhCiLSo+bmZoqLizl+\n/Dhz5sxhxYoVOJ3OUJd1Fk1YF4kMHo+H9957jyNHjjBjxgzy8vKIiopi6tSpLFiwgKSkpFCXKCIR\nIjMzk+eff56mpiYmTpzI2LFjiYqKoqCggNmzZ583oirhSUFELqi1tZWtW7dSU1NDQUEBV155Ja4w\nXUUiMTGR48ePh7oMEenGkSNH+P3vf8++ffuYN28ehYWFxMbGkpmZyaWXXkpaWlqoSxSRCOHxeNi2\nbRvl5eXMnDkTv9+Py+UiNzeXefPmERcXF+oSpR/C88pSBlUwYFH1bgMNFW0YpyH78tGkz0zser2x\nsZHKykoWLlxIe3s7paWlVFRUcMkll7B27dqwX41KIyIi9uk85ad8Yy1tDV6ik1xMvyqd+NTortfP\nrNk/Y8YM6uvrefnllyktLSUvL49vfetbpKen8+677zJlyhSysrJC+JWISCTx+/3s2rWLHTt2MGXK\nFG655RYAPvroI+bPn8+oUaNCXKEMhILIMLf3T8d47Z/3EugM4vcGMcZgHDBmajzLfjCZysY9VFZW\n4vP5qK2t5cSJE0yfPp1bb701Yp7TVhARGXpBf5A3v1fOtt8cwjgNgc4gTrfh9Qf2MePqdGZvSGbb\nzq00NDTg8/koKiqiuLiY7Oxs/umf/umslfWuuOKKEH4lIhJJgsEg5eXlbN26lYyMDG644YazQsfS\npUtDWJ1cLAWRYWzn747y56/txu/55CZgFgC1e07x7C2lJN5xmOMdBzly5AhNTU18+ctfJjEx8cIf\nGKaio6OxLEt7iYgMEcuy+P36Hex/u/6sfhL0n+4ne185RnlRDVG3HKbiQBkVFRXk5OSwfv16Zs6c\nqSUxRWRAqqur2bJlC7GxsaxYsYL09PRQlySDTEFkmPK2+Xnt6+eGkE+wINgJx5+Pon1ZO3PmzCE2\nNpaTJ09GXBABLeErMpSqNjVS+dcG/B0X7ieW3+CtdbL3ucM0ZBxk4cKFTJkyhWnTpimEiEi/1dbW\nsnnzZrxeL4sWLTpvrzIZPhREhqld/30UerkAMDiIa0ln/Lg80rOSWbBgQcQ+s60gIjJ0Pvr3Knzt\ngR6PcQRcTDl1GQvuyGb69OkUFhZq1RoR6Zfm5ma2bNlCQ0MDhYWF5OTk6GbGMKcgMkzVfHCi1wsH\nAOM2XJK2gCs+mx/R3+yaJyIydI5tb+nTcc72GD57/c2MzdLjEyLSd+3t7RQXF1NdXc2cOXNYunRp\n2K7UKYNLu7wMU5bVt+PcLhcZ6ekRHUJAQUSGt9LSUi6//HLi4uK4+eabQ11Ot4zDaFRSJMyFUz/x\ner0UFRXxwgsvEB0dzW233UZBQYFCyAiiIDJMTViYgju2940Hgz6LjLzI30RMQUSGs/T0dH72s5/x\n0EMPheb8uX2bN5aQHo0rRj9WRMJZqPsJQCAQYOfOnTz33HO0t7dz0003cemllxIdHd37m2VY0U+M\nYSr/pkys3oZFDIwrGEXKpMjf/CchIYF9+/YxYcIEampqAPj2t7/N2rVrQ1yZSN/96Ec/Yv369V2/\nr62tJSMjg+Tk5JD+kM793GgcUT33E1eMg0u/mB3xo6siw0U49hPLsti/fz/PP/88R44cYfXq1Xzm\nM58hISHB9lokPCiIDFMxSW6W/fMM3LHd/y+OinNy9fcvsbGqoZOYmMioUaP4/ve/z2233cbrr7/O\ns88+y6OPPhrq0kT67K677uLFF1+ktbUVgEcffZR169aFbKfglpYW3njjDfa2fURaQWy3ox3OKEPy\nxFjmrptgc4Ui0p1w6yeHDx/md7/7Hbt27eLKK6/k6quvZvTo0SGpRcKHHsIbxubfPhGH28Gb39kH\nFnjbAuAAd4yT+LQobvrVHNJmDI+7EGfu7Nx66628+eab3HjjjWzatImkpMh/7ExGjpSUFK6//nqe\nfvpp7rrrLh577DHeeOMN2+vo6OigpKSEyspK8vPzufLKKzFrHfz5G3vY/YdjGAN+TxBnlAFjyP7U\naG74t4I+PQ4qIvYIl37S0NDA5s2baW1tZeHChUyePNn2GiR8KYgMc3M/l0X+ZzMp21hLQ3krzigH\nkxaNJmtB8rB7hCIxMZHGxkZ2795NcnIytbW1oS5JpN82bNjAunXrSE9PJzc3l+nTp9t2bp/Px44d\nO9i9ezc5OTnceuutxMTEdL1+7U9mseRrOez903Fa673EjnIzY1UGyRNibatRRPoulP2kpaWF4uJi\njh49yrx585g5cyYOhx7EkbMpiIwArmgHedePC3UZQy4xMZFvfvObzJ8/nyeffJJVq1bxwQcfROze\nKDIyzZo1izFjxnDffffxy1/+0pZzBoNB9u3bR0lJCZmZmaxZs6bbjU3jU6MpvGOSLXWJyMUJRT/x\neDyUlJSwf/9+Zs2axac//WntKSTdUjSVYaOkpIQPPviAn//85+Tl5fHAAw/wuc99Dr/fH+rSRPrl\nzjvvxOFwsHr1agCqq6vJysriH//xH3n11VfJysriP/7jPwblXAcOHOD555+nurqaq6++mqVLl3Yb\nQkQk8tjVT/x+PyUlJTz//PMA3HLLLcybN08hRHqkEREZNlavXs0VV1zR9SjJF77wBb7whS+EuCqR\n/nv77bdZv349TufpORfZ2dkcPnx4UM9x9OhRtmzZQjAY5NOf/jTjx48f1M8XkfAw1P0kGAxSVlbG\n1q1bGTduHDfeeKPmZ0qfKYjIsJGYmMjRo0dDXYbIgB09epQlS5YwduxYHn744SE5x4kTJ9iyZQtN\nTU0sWLCAqVOnDrv5YiJiTz+pqqpiy5YtxMfHs3LlStLS0obkPDJ8KYjIsKFNDSXSZWZmUlZWNiSf\n3draSnFxMYcOHWLu3LmsWLGi6w6piAw/Q9lPjh8/zkcffUQgEODyyy/XXEwZMAURGTYURETO19nZ\nybZt2ygrKyMvL4/bbruNqKioUJclIhGoqamJLVu20NjYyIIFC5g2bZpGVOWiKIjIsBEVFYUxBo/H\nc9aSoyIjkd/vZ/fu3Wzfvp3Jkydzyy23hGwjMxGJbG1tbRQXF1NTU8PcuXNZvny5RlRlUCiIyLCS\nmJhIa2urgoiMWJZlUV5eztatW0lLS+P6668nOTk51GWJSATyer2Ulpayd+9ecnNzWbt2rUZUZVAp\niMiwcubxrNTU1FCXImK7gwcPsnnzZqKjo1m2bBkZGRmhLklEIlAgEGD37t2UlpaSnZ3NzTffTHx8\nfKjLkmFIQUSGhTZ/Lbua/pPqrF9T6WnDXR5PTtINzB59F8lRU0Ndnki/+SwPZZ2b2OH9M63BRhw4\nGe/KY07MtYxzzTjr2Lq6OjZv3ozH42HhwoVMmqQNB0Xkb04FG9jZuZFy77t4rQ7cJpbp7sXkR19N\nkvNvK11ZlkVFRQXFxcWkpqZy3XXXkZKSEsLKZbhTEJGIV9tRwh8PrSVo+Qg4OgHwBk+yp/m3lJ18\ngaXjfsG0pGtDXKVI37UFm/h96/+lI3gSP14Agvip8W/jSOsuZkWvZFHsWpqbmykqKqKuro7CwkKm\nT5+uiaMicpbDvl281vYzggQIcnqD306rld3eN9jrfZuV8fcxwV3AoUOH2Lx5M263m6VLlzJ27NgQ\nVy4jgYKIRLQOfyMvH/ocvmDrea9Z+PFbft46toHkqGxSY2aFoEKR/rEsiz+1/oC24AmCBM59FT9e\ndnZupL6ylaaSKAoKCliyZAkul9q5iJytJVDPa20/w0/nea8F8RPEz2utD5FWvBJvk4OFCxeSnZ1t\nf6EyYuknl0S0Pc2/IWD5ejwmYHnZ2vhvrBz/7zZVJTJwR/17OBVsvEAI+ZsAXuoyivj8rb/Qwgwi\n0q2dna91jYJ0J2D5cFxyjJvHfRmHw2FTZSKn6V+cRLQ9zc8QsDw9HmMRpOrUnwlaPTdjkXCw1/s2\nfnr+Nw1guX20uo7bUJGIRKoy37s93tQAwGFRH79bIURCQv/qJKJ5gs19PtZ7gce3RMJNW7CpT8c5\ncNBhtQxxNSISyXy93KjrOo4OLMsa4mpEzqcgIhEtypHYp+MsLNwOLT0o4S/WkdSn4ywsok3CEFcj\nIpHMRXSfj9NCFxIKCiIS0XJHrcVpemu0hkkJS3Eaty01iVyMmVFX4qb3eR9uE0OaM3voCxKRiJUT\ndRmGnndANziY5v6UTRWJnE1BRCJaXsrtOHpZc8FlYpg/5ss2VSRycSa48ol1JGHo/u6kiyjmRd+I\nMWrhItK9guhrcPYSRJy4mB2z2qaKRM6mn2IS0eJdGVyT9Z+4TBzmnEBicOAysXw643tkxM4NUYUi\n/WOMg2vjv0GsGYWT80fxXESTE7WYvOjlIahORCJJsnMsy+LW4yIKc84ln8GBiyiWxt1DijMzRBXK\nSKfleyXijY+/jNsmv8n2E4+y7+Rz+K0OHMbNlIRVzB3zJdJi8kNdoki/JDnTuC3xR+zyvsGuztfo\nsFowGMY6ZzA35jomuGbreW4R6ZPJUfO5yfk9tnv+RIXvAwL4cOJmqvtTzIlZzWhnVqhLlBFMQUSG\nhVFRk7hi7Pe4Yuz3CFp+HEb/tCWyRTvimR9zA/NjbiBoBTEYhQ8RGZAUZyZXxn+RK/kiQSuAw/T8\nuJaIXXS1JsOOQogMNw7NBRGRQaIQIuFEP91ERERERMR2CiIiIiIiImI7BREREREREbGdgoiIiIiI\niNhOQURERERERGynICIiIiIiIrZTEBEREREREdspiIiIiIiIiO0URERERERExHYKIiIiIiIiYjsF\nERERERERsZ2CiIiIiIiI2E5BREREREREbKcgIiIiIiIitlMQERERERER2ymIiIiIiIiI7RRERERE\nRETEdgoiIiIiIiJiOwURERERERGxnYKIiIiIiIjYTkFERERERERspyAiIiIiIiK2UxARERERERHb\nKYiIiIiIiIjtFERERERERMR2CiIiIiIiImI7BREREREREbGdgoiIiIiIiNhOQURERERERGynICIi\nIiIiIrZTEBEREREREdspiIiIiIiIiO0URERERERExHbGsqy+H2xMPVAzdOWISD9NsiwrLdRF9Jd6\niUhYUj8RkcHSp37SryAiIiIiIiIyGPRoloiIiIiI2E5BREREREREbKcgIiIiIiIitlMQERERERER\n2ymIiIiIiIiI7RRERERERETEdgoiIiIiIiJiOwURERERERGxnYKIiIiIiIjY7v8DL+mdt9d2TbYA\nAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7fcd782d6fd0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'a': 'c', 'x': 'f', 'y': 'd', 'z': 'a_b'}"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "instances[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "y2_clone_id\n",
      "y1_clone_id\n",
      "MATCH (x:node { id : 'f'}), (y:node { id : 'd'}), (z:node { id : 'a_b'}), (a:node { id : 'c'}) , (x)-[x_y:edge]->(y), (y)-[y_z:edge]->(z), (z)-[z_z:edge]->(z), (z)-[z_a:edge]->(a) OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'y2' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , y, a, x, z UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['y2' + same_id_node.count] ELSE ['y2'] END AS y2_clone_id CREATE (y2:node { id : y2_clone_id }) WITH y, a, y2_clone_id, z, y2, x OPTIONAL MATCH (y)-[:edge]->(m:node), (o:node)-[:edge]->(y) WITH COLLECT(m) AS ms, COLLECT(o) AS os, y, a, y2_clone_id, z, y2, x FOREACH(o IN os | FOREACH(p IN CASE WHEN NOT o.id IN [] THEN [o] ELSE [] END | CREATE UNIQUE (p)-[:edge]->(y2) )) FOREACH(m IN ms | FOREACH(p IN CASE WHEN NOT m.id IN ['a_b'] THEN [m] ELSE [] END | CREATE UNIQUE (y2)-[:edge]->(m) )) WITH y, a, y2_clone_id, z, y2, x  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'y1' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , y, a, y2_clone_id, z, y2, x UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['y1' + same_id_node.count] ELSE ['y1'] END AS y1_clone_id CREATE (y1:node { id : y1_clone_id }) WITH y, y1_clone_id, a, y2_clone_id, y1, z, y2, x OPTIONAL MATCH (y)-[:edge]->(m:node), (o:node)-[:edge]->(y) WITH COLLECT(m) AS ms, COLLECT(o) AS os, y, y1_clone_id, a, y2_clone_id, y1, z, y2, x FOREACH(o IN os | FOREACH(p IN CASE WHEN NOT o.id IN [] THEN [o] ELSE [] END | CREATE UNIQUE (p)-[:edge]->(y1) )) FOREACH(m IN ms | FOREACH(p IN CASE WHEN NOT m.id IN [] THEN [m] ELSE [] END | CREATE UNIQUE (y1)-[:edge]->(m) )) WITH y, y1_clone_id, a, y2_clone_id, y1, z, y2, x DETACH DELETE x WITH y, y1_clone_id, a, y2_clone_id, y1, z, y2 OPTIONAL MATCH (y)-[:edge]->(suc_y) OPTIONAL MATCH (pred_y)-[:edge]->(y) OPTIONAL MATCH (a)-[:edge]->(suc_a) OPTIONAL MATCH (pred_a)-[:edge]->(a)  WITH COLLECT(suc_y) as sucs_y, COLLECT(pred_y) as preds_y, COLLECT(suc_a) as sucs_a, COLLECT(pred_a) as preds_a, y, y1_clone_id, a, y2_clone_id, y1, z, y2 OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'd_c' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL AND NOT same_id_node.id IN [y.id, a.id] THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node, sucs_y, preds_y, sucs_a, preds_a, y, y1_clone_id, a, y2_clone_id, y1, z, y2 UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['d_c' + same_id_node.count] ELSE ['d_c'] END AS y_a_id CREATE (y_a:node { id: y_a_id }) FOREACH(s IN sucs_y | CREATE UNIQUE (y_a)-[:edge]->(s))  FOREACH(s IN sucs_a | CREATE UNIQUE (y_a)-[:edge]->(s)) FOREACH(p IN preds_y | CREATE UNIQUE (p)-[:edge]->(y_a))  FOREACH(p IN preds_a | CREATE UNIQUE (p)-[:edge]->(y_a)) FOREACH(n IN sucs_y + preds_y + sucs_a + preds_a | FOREACH(dummy_var IN CASE WHEN n IN [y, a] THEN ['dummy'] ELSE [] END | CREATE UNIQUE (y_a)-[:edge]->(y_a)) )  DETACH DELETE y, a WITH y1_clone_id, y_a, y2_clone_id, y1, z, y2  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'new_node' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node  UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['new_node' + same_id_node.count] ELSE ['new_node'] END AS new_node_id CREATE (new_node:node { id : new_node_id }) CREATE UNIQUE (new_node)-[:edge]->(z) RETURN new_node, new_node_id \n"
     ]
    }
   ],
   "source": [
    "rhs_g = g.rewrite(rule, instances[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'new_node': 'new_node'}"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rhs_g"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
