{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "\n",
    "from regraph import Rule, plot_rule\n",
    "from regraph.neo4j.graphs import Neo4jGraph\n",
    "from regraph.neo4j.cypher_utils import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "g = Neo4jGraph(\"bolt://localhost:7687\", \"neo4j\", \"admin\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "res = g.clear()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7f790dfe6438>\n",
      "<neo4j.v1.result.BoltStatementResult object at 0x7f78ee28d710>\n"
     ]
    }
   ],
   "source": [
    "nodes = [\"a\", \"b\", \"c\", \"d\", \"e\", \"f\"]\n",
    "edges = [(\"a\", \"b\"), (\"d\", \"b\"), (\"a\", \"c\"), (\"e\", \"a\"), (\"f\", \"d\")]\n",
    "g.add_nodes_from(nodes)\n",
    "g.add_edges_from(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7f78ee721ef0>\n"
     ]
    }
   ],
   "source": [
    "g.add_node(\"x\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7f78ee721ef0>\n"
     ]
    }
   ],
   "source": [
    "g.add_edge(\"x\", \"c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7f78ee28d128>\n"
     ]
    }
   ],
   "source": [
    "g.remove_edge(\"x\", \"c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x7f78ef54f5c0>\n"
     ]
    }
   ],
   "source": [
    "g.remove_node(\"x\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['a', 'b', 'c', 'd', 'e', 'f']"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('e', 'a'), ('d', 'b'), ('a', 'b'), ('a', 'c'), ('f', 'd')]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.edges()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' }) WITH [] as ignoredNodes, x OPTIONAL MATCH (x)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(x) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x WITH filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x CREATE (new_node:node) SET new_node.id = toString(id(new_node)) WITH new_node, filtPred, filtSucc, toString(id(new_node)) as uid, x FOREACH (succ in filtSucc | MERGE (new_node)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(new_node)) RETURN uid \n",
      "Created clone by the name:  1828427\n"
     ]
    }
   ],
   "source": [
    "res_clone_1 = g.clone_node('a', ignore_naming=True)\n",
    "print(\"Created clone by the name: \", res_clone_1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'a' }) WITH [] as ignoredNodes, x OPTIONAL MATCH (x)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(x) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x WITH filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x CREATE (new_node:node) SET new_node.id = toString(id(new_node)) WITH new_node, filtPred, filtSucc, toString(id(new_node)) as uid, x FOREACH (succ in filtSucc | MERGE (new_node)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(new_node)) RETURN uid \n",
      "Created clone by the name:  1828428\n"
     ]
    }
   ],
   "source": [
    "res_clone_2 = g.clone_node('a', 'a_clone', ignore_naming=True)\n",
    "print(\"Created clone by the name: \", res_clone_2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "res_merge = g.merge_nodes([\"a\", \"b\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'a_b'"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res_merge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "pattern = nx.DiGraph()\n",
    "pattern.add_nodes_from([\"x\", \"y\", \"z\", \"a\"])\n",
    "pattern.add_edges_from([(\"x\", \"y\"), (\"y\", \"z\"), (\"z\", \"z\"), (\"z\", \"a\")])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instances:  [{'x': 'f', 'y': 'd', 'z': 'a_b', 'a': 'c'}, {'x': 'e', 'y': '1828427', 'z': 'a_b', 'a': 'c'}, {'x': 'e', 'y': '1828428', 'z': 'a_b', 'a': 'c'}]\n"
     ]
    }
   ],
   "source": [
    "instances = g.find_matching(pattern)\n",
    "print(\"Instances: \", instances)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "rule = Rule.from_transform(pattern)\n",
    "clone_name1, _ = rule.inject_clone_node(\"y\")\n",
    "clone_name2, _ = rule.inject_clone_node(\"y\")\n",
    "rule.inject_remove_edge(clone_name2, \"z\")\n",
    "rule.inject_remove_node(\"x\")\n",
    "rule.inject_merge_nodes([\"y\", \"a\"])\n",
    "rule.inject_add_node(\"new_node\")\n",
    "rule.inject_add_edge(\"new_node\", \"z\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:522: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(edge_color) \\\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:543: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if cb.is_string_like(edge_color) or len(edge_color) == 1:\n",
      "/home/eugenia/anaconda3/lib/python3.6/site-packages/networkx-1.11-py3.6.egg/networkx/drawing/nx_pylab.py:724: MatplotlibDeprecationWarning: The is_string_like function was deprecated in version 2.1.\n",
      "  if not cb.is_string_like(label):\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAyIAAADECAYAAABjuJVcAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzt3Xl0VeW9//H3PkNGIAMJQwgQCWEw\nJGEIiIrMiIAyOIuVayu2KhRtezt5+2t7e3u7qrW11Xtri1OvqDigDEUqIKKAKEMgzGRA5ikMCRlP\ncob9+wONIpCJZO+c5PNaK2t5ztn77E8w+eZ8936eZxumaSIiIiIiImIlh90BRERERESk9VEjIiIi\nIiIillMjIiIiIiIillMjIiIiIiIillMjIiIiIiIillMjIiIiIiIillMjIiIiIiIillMj0oIYhnHA\nMIyx33hupGEYRy6x7UeGYcz82uPHDcPYbxhGqWEYRwzDeNOKzCISnL6oNxVf1IyThmG8bBhGG7tz\niUjz8o1accIwjH98WSu++O/ffmP7JMMwTMMwXF88TjQM4x3DME4bhnHOMIwdhmHcb8O3Ik1AjYhg\nGMa/AfcBY03TbANkAqvsTSUiQeCWL2rGQGAw8Aub84hI8/RlregPDAB+Xo995wGHge5Ae2AGcLLR\nE4otXHYHkGZhMLDcNM19AKZpngDm2htJRIKFaZpHDcP4F9DP7iwi0nyZpnnCMIzlnG9I6mow8APT\nNMu+eLy18ZOJXXRFRAA+A2YYhvFjwzAyDcNw2h1IRIKHYRhdgYnoA4KI1MAwjERgApBfj90+A/7X\nMIy7DcPo1jTJxC5qRFqHBMMwir7+BQz78kXTNF8Fvg+MBz4GCgzD+JlNWUUkeCz6op6s43zt+J3N\neUSkeVpkGEYJ54dYFQC/+tpr//6Nzyfbv7HvHcBa4P8B+w3DyDYMY7AlqaXJqRFpHY6Zphn99S/O\nf3CoZprma6ZpjgWigYeA3xiGMd6OsCISNKZ+UVO6m6b5iGmaFXYHEpFmaappmm2BkUAfIO5rrz31\njc8n6V/f0TTNQtM0f2aaZirQEcjmfGNjWJRdmpAaEbmAaZpe0zTf5vwZCY33FhERkUZhmubHwD+A\npxq4/+kv9k0AYhsvmdhFjUjL4zYMI+zLL+qwIIFhGPcbhjHJMIy2hmE4DMOYAKQCG5o8rYiIiLQm\nfwbGGYZRpwnrhmE8YRhGP8MwXIZhtAUeBvJN0zzTpCnFElo1q+VZ9o3Hn9Rhn2LgceBVwAkcBB42\nTXNdjXuJiIiI1INpmqcMw3iF83M+SuqwSwSwEOgMVHD+JOnkpksoVjJM07Q7g4iIiIiItDIamiUi\nIiIiIpZTIyIiIiIiIpZTIyIiIiIiIpZTIyIiIiIiIpar16pZcXFxZlJSUhNFEZH6ysrKOm2aZrzd\nOepLtUSk+VE9EZHGUtd6Uq9GJCkpic2bNzc8lYg0KsMwDtqdoSFUS0SaH9UTEWksda0nGpolIiIi\nIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKW\nUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMi\nIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIi\nIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiIiIiKWUyMiIiK2ys7O5vrrryciIoLb\nb7/d7jgiEsRUT4KLGhEREbFVhw4d+NOf/sTTTz9tdxQRCXKqJ8FFjYiIiFjiySefZPbs2dWPT548\nSceOHYmOjuaaa64hNDTUxnQiEkxUT1oGNSIiImKJBx98kAULFlBaWgrA3LlzmT59OhERETYnE5Fg\no3rSMqgRERERS8TExDB58mTmzZuHz+fj+eef5+GHH7Y7logEIdWTlsFldwAREWk95syZw/Tp0+nQ\noQN9+/alV69edkcSkSClehL8dEVEREQs069fP9q3b89jjz3GrFmz7I4jIkFM9ST4qRERERFLzZw5\nE4fDwaRJkwA4cOAAiYmJ/PCHP2TZsmUkJiby4osv2pxSRIKB6klw09AsERGx1OrVq5k9ezZOpxOA\npKQkjhw5YnMqEQlGqifBTVdERETEEseOHaN3797k5eVpGIWIXBHVk5ZBV0RERMQSCQkJ5OTk2B1D\nRFoA1ZOWQVdERERERETEcmpERERERETEcmpERERERETEcmpERETENl5PFRXnygj4A3ZHEZEgZpom\nnpIKPCUVmKZpdxypI01WFxERS5mmSe7qHax9YTnHdx/G4XTgcDrImHIN139nHFGdY+2OKCJBwuup\nIuutdXz6f6soO1sKQGRsG4bOGE3mnTfgDg+xOaHURFdERETEMqZp8q/fvcW7P/sHx3YcxPQH8Ff5\n8FZUsWXBJ/xt2u84vvuw3TFFJAhUllbw4vSn+PDZf1JScI6Az0/A56ek4Byr/2cpL07/A5WlFXbH\nbDJJSUns3LnT7hhXRI2IiIhYZtuSDWxbtAFvRdVFrwV8ASrLPLz63Wfxei5+XUTk6xY+/gpnDhbg\n83gves3n8XLm0CkW/vwVG5JJXakRERERS5imyZq//avWJsPv9bPr/S0WpRKRYFR8opB9n+zBX+W7\n7Db+Kh/71u+h+ERhje9lGAa/+93vGDx4MD169OCdd96pfm3Dhg2MGjWKQYMGMWjQIN577z0Afv7z\nn/OHP/wBgLfeeguHw0FBQQEAEydOZMWKFZc93v33389DDz3E6NGjSUlJYcaMGdXzWk6ePMm0adNI\nT08nLS2NV175qpFau3YtaWlpDBkyhDlz5lwwFyYnJ4cJEyYwePBgMjIyePnll2v8npsLNSIiImKJ\nwsOnKT1dXOt2VeWVbH33UwsSiUiw2rtqG4Zh1LqdYRjsXbWt1u3atWvHpk2bmDdvHnPmzAGgqKiI\nhx56iNdff52srCyWLl3K9773PYqKihgzZgyrVq0CYNWqVQwdOpQPP/wQr9fLhg0bGDZsWI3H27lz\nJ8uWLWPXrl1kZWXxwQcfADBnzhz69evH9u3bWbFiBT/96U/ZuXMnlZWV3H333Tz77LNs3LiRYcOG\ncejQIQB8Ph/Tp0/n6aefZtOmTaxbt47f//737N27t9bv226arC4iIpbwlJTjdDnxcfEwiou2LS63\nIJGIBCtPqQdfVe21xFflxVPqqXW7u+++G4ChQ4dy7NgxPB4P69evZ//+/UyYMKF6O8MwyM/P5/rr\nr+fOO++kqqqKTz75hKeeeooFCxbQpUsX0tLSiIiIqPF4U6dOJSwsDICBAweyb98+xo0bxwcffMAf\n//hHADp37sykSZNYvXo1gUCAiIgIRo4cCcCdd97Jd7/7XQByc3PZs2dP9fcAUFlZyZ49e+jTp0+t\n37ud1IiIiIgl2rRvV+Mwiq9r1zGqidOISDBrE9cOd1jIJeebfZ07LIQ2ce1qfb8vmwKn0wmcv8pg\nmibp6emsWbPmkvtkZGQwf/58OnfuzKhRo/jRj35EYmIio0ePrvPxvjymz/dVbfzmlR7DMGpcktg0\nTeLi4sjOzq71uM2NhmaJiIgl2nWKoUOvLrVuFxIRSuY9IyxIJCLB6upx/TEDtd8vxAyYXD2uf4OO\ncd1115GXl8fq1aurn9u0aVN1UzBmzBh+9atfMWbMGEJDQ0lMTOQf//gHY8aMadDxAMaOHcvcuXMB\nOHHiBMuWLWPUqFH06dOHioqK6qZowYIFnDt3DoDevXsTERHBvHnzqt9n7969FBfXPhTWbmpERETE\nMqO+fzOuMPflN3AYEOag6+Bk60KJSNAJaxfBgFuvxV1DPTFcDhKu70Fo2/AGHSMmJoYlS5bwn//5\nn2RkZNC3b19+/etfX9CIHDx4sLrxGDNmDKdPn2bIkCENOh7AM888w7Zt20hPT2fcuHH8/ve/JzU1\nldDQUObPn8+sWbMYMmQImzdvplu3bgC4XC7++c9/8sYbb5Cenk5qaiqPPPIIVVXNf/VBoz53n8zM\nzDQ3b97chHFEpD4Mw8gyTTPT7hz1pVrSumW9vY7lT7xDwO8n4Pvqjuru8BAiYtow4IejOXr2OOPH\njyc2Vjc3tIrqiQSbgM/Pgh+/zL5Pdl80RMsdHkLS0N60GdMZd2gIo0ePJiRENze0Sl3rieaIiIiI\npQbdMYykwSl89upH7P0gG1+lj6jOMQy9bxSpEwbhDgshPz+fpUuXMnz4cJKSkuyOLCLNkMPl5I4/\nPcD+Dbl8+o8POLbzIACdU7tz3f1juGpob0zTZP369SxatIibbrqJdu1qny8i1lEjIiIilmuf1JFJ\nv7iLSb+465Kv9+zZk6ioKFasWEFhYSEDBgywOKGIBAPDMOgxtDc9hva+7OvDhg1j9+7dLF68mNGj\nR9OlS+1z1a5UdnY2999//0XPz549m5kzZzb58YOFGhERkSbw/PPP8+yzz2KaJoZh8JOf/IRvfetb\ndscKKvHx8UybNo3ly5dz9uxZRowYgculP1vS+qieXLmrr76a6OhoVq1axYABA+jXr1+THq9///5B\nuYqV1TRZXUSkCaSkpPDxxx+zY8cOli1bxmOPPcaBAwfsjhV0IiIiuOWWWzAMgyVLllBWVmZ3JBHL\nqZ40joSEBKZMmcLevXtZs2YNgUCg9p2kSakRERG5Ak8++SSzZ8+ufnzy5Ek6duzIkCFDiImJASAx\nMZHOnTtz5MgRu2IGNZfLxejRo0lOTmbhwoWcPHnS7kgiTUL1pOm1a9eOKVOm4PF4WLp0KRUVFXZH\natXUiIiIXIEHH3yQBQsWUFpaCsDcuXOZPn36BXfV/eijjygqKmLQoEF2xWwRMjIyGD58OMuXLyc3\nN9fuOCKNTvXEGm63m3HjxtG5c2cWLlzImTNnmvR4ATNAvj+fhZ53edXzKosrF3HAf6DGmxS2FmpE\nRESuQExMDJMnT2bevHn4fD6ef/55Hn744erXd+/ezYwZM5g/fz7h4Q1by16+0q1bN2655Ra2bNnC\nZ599pj/k0qKonljHMAwGDx7MNddcw3vvvcf+/fub5DiFgUL+7vkb/6xcQm4gl6OBI+z17+Xdynd4\n0fMCpWZpkxw3WKgRERG5QnPmzOG5555j8eLF9O3bl169egGQl5fHxIkT+fvf/86wYcNsTtlyxMTE\nMG3aNM6cOcP7778fFDftEqkr1RNrJScnM3HiRD799FOysrIa9eRGuVnOq555lJglVHFhnfLipdAs\n5FXPPKrM1lvD1IiIiFyhfv360b59ex577DFmzZoFwOeff8748eN55plnmDBhgs0JW57Q0FAmTJhA\nVFQUixYt4ty5c3ZHEmkUqifWi4uLY+rUqRw+fJhVq1bh8/ka5X23eLOopBKTSzc3AQKUm+Xs8u1q\nlOMFIzUiIiKNYObMmTgcDiZNmgTAT3/6U86cOcMvf/lL+vfvT//+/Vm+fLnNKVsWh8PBddddR3p6\nOkuWLNHkXWkxVE+s9+UKfS6Xi8WLF1fP07kSW3xb8OOvcRsvXjb5Nl7xsYKVFmSXFmfZsmU8/vjj\n1Y93797N22+/zZQpU2xMJS3d6tWrmT17Nk6nE4C3337b5kStR58+fYiKimLVqlVkZGSQlpbWKO+r\nWiJ2UT2xh9PpZOTIkWzfvp1FixYxduxYOnXq1KD38pt+KvhqRa697+9l+a9XVD8u2FvA9Fenk3rz\n1ZSYJVecPVjpioi0OBMnTiQ7O5vs7GxmzZpFZmYm48ePtzuWtFDHjh2jd+/e5OXlVQ+jEOt17tyZ\nKVOmkJOTw8cff4zfX/NZyLpQLRGrqZ40D+np6YwYMYIVK1aQk5PToPdw4MDAqH7c56Y+PPrZHB79\nbA7Xfm8oXQZ2odfYlOptW6vW+51Li7d8+XL++Mc/snjxYsLCwuyOIy1UQkJC9Yffry+xKdZr27Yt\nU6ZMobKykvfee6/R7g+gWiJWUT1pPrp27crkyZPJzs7m008/rffNDw3DIMGRcNHzuStzWfvMOma8\neR/uMDcGBlc5rmqs2EFHjYi0SNu2beOhhx5iyZIlxMfH2x1HRCzy5f0BEhISWLhwIadPn76i91Mt\nEWm9oqOjmTp1KoWFhbz//vtUVlbWa/9r3dfixl39+Nj24yx8dBEz3rqPNvFtAHDiZIj7mkbNHUzU\niEiLc/ToUW677TbmzZtXveyhiLQehmGQmZnJ0KFDWbZsGZ9//nmD3ke1RERCQ0O56aabiImJYdGi\nRRQVFdV53x6OZK52puLCzblj53jt3le564U7iU85f1LDhYshrmtIcF585aS10GR1aXFeeOEFTp06\nxezZs6ufe/rppxk1apSNqUTEaj169KBdu3asWLGCs2fPMmjQIAzDqH3HL6iWiAicX6Hv2muvJTY2\nliVLljBq1Ci6du1a636GYTA+ZDwdfB34xT9+Qdnpchb/YAmGYeDAwW/++BtuGHeDBd9B82XU58Yt\nmZmZ5ubNm5swjojUh2EYWaZpZtqdo75aei05mXuU05+fwOFy0rV/D9rEtbM7UqtWUVHBihUriIiI\nYOTIkbjd7tp3aoVUT5qfgD/Awax8yk4XE9o2nKuG9MIVqp9fO504cYIPPviA9PR00tPT67yfaZqc\nNE/yztJ3uOPmO4g34ut1YiTY1LWe6IqIiEgjObRlH8t++yaFh09hOB2Agd/rI/n6vtz8y3vUkNgk\nPDycm2++mXXr1rF48WLGjx9P27Zt7Y4lclmmabJp/ho+fm4Zfu/5m+sZhoEZMBl8z3BGzb4Zh8tp\nc8rWqVOnTkydOpXly5dz9uxZbrjhhupllmtiGAadjE64T7jp4OhgQdLgoDkiIiKNYN/6Pbz6vf+h\nIO8YXo+XqrJKqso8+Kt85K/dxdw7fk/p6WK7Y7ZaTqeTESNG0Lt3bxYvXsyJEycA8Pv91GdkgIgV\nVj61kFVPL6aiqOyLWlJJZamHqvJKNr72EW98/+8E/PVbxUkaT5s2bZgyZQo+n49//vOflJeXAzTa\nHdlbEzUiIiJXyFflZcG/v4TP473k6wFfgLLCUpb+Zr7FyeSb0tLSGDlyJCtXrmTPnj2sXr2alStX\n4vVe+v+diNWObD9A1lvr8HqqLvm61+PlYFY+O97bZHEy+TqXy8XYsWPp1q0bixYt4siRIyxYsIBt\n27bZHS2oaGiWiMgV2rMyG7OWs5OmP8C+T/ZQerpYQ7RslpiYyOTJk3nuuecoLCzkqquuori4WEO2\npFn49OUP8FXV3Bh7K6r45MUVZExuvcu+NhcDBw4kKiqKp556ivj4eIqLizl79izDhw+v05Ct1k5X\nRERErlD+2t1Ulde+vrzL7eJwdsOWkpXGVVhYSLt27aioqGDXrl2cPHmShQsXcuzYMbujSSt3YFMu\nZqD24YJnDhRc9qqJWOv48eN069aN/fv3c+DAAXJzcy8YsiWXp0ZEROQK+bx1GxdsYhLwaVx3cxAX\nF0fHjh1JTU0lMjKS7Oxszpw5w7Jly9i9e7fd8aQVq+vcD8Ph0DyRZiIpKYnY2Fj69+/PuXPn2LNn\nD8ePH+fdd9/l1KlTdsdr1tSISIuSsyfAT+dUMnpwBaMyK/jRI5Xs3qFCLU0rIbVbnZbUNP0m8T07\nW5BIavPlZNPk5GR69OhBt27d2L59O6dPn2bdunWsWbOO1Su8zLjNw4iBFdx4XQV/eaKKUyc1sV2a\nVvukuq2oFBoZRkhEaBOnkbpITExk2rRpdOjQgbS0NFwuF9nZ2Zw9e5YlS5awY/s+XnvZy+TRFTz3\n5FSm3VjBu2/4qPSonqgRkRbBNE1+83gV08Z6ePcNPwc+Nzm432TJAj+3T/Dw88cqCdThUrdIQ/Sf\nOhTqsPJSbLd4OqgRaTa+nGyamZlZfXUkNzeX/LxT/Gx2dx65v4J1HwU4fNAkP8fkb8/4GDGogvcW\naWUcaTrX3T8Wdy0NhjPExZB7R7To+1AEm6ioKKZOnUr37t3p1asXnTt3Jjs7m727HNw1MZZf/6yM\nndtMzhW2YVuWyS9/UsUNAyr4PK91nyxVIyItwl+f9vLmKz48HvD7v3re7wdPBSxZ4OcP/6VVcaRp\nRMa25dpvj8UdFnLZbVxhbib84k4LU0ldDRw4kBtvvPGLoRUDWLHwVgqOR1FZeeF6LpWe8/Xkx7Or\n2Ljef5l3E7kyvUdnEJfUAaf70hOdDaeDiOhIhkwfYXEyqU1ISAg33XQT6enpJCQk0CVhIItem4yn\nIhS/78K/D+VlcOYU3Hmzh+JzrfdEqRoRCXqeCpPn/uyjouLy21RUwD/m+igpbr2/7NK0Rs6axLX/\nNgZXiOuCYVohEaGEtg3nrr98l24Dkm1MKDVJSkpi6tSplBT2oqIsgUDg8otKeirgyd/oxIY0Dafb\nyYwX59BtUE9coe4vbo4KGAbu8BDirurIA6/9O+FRkfYGlUsyDIOhQ4cycuRI8nYOxTQvf4LKNM83\nJG+92nqvsmr5Xgl6K//lpy5Xp50OWLbEz13f0o+9ND7DMBg5exJD7h1B9sJPObb7ME6Xk5QRqfQd\n2x+nWz93zV1sbCxHPr8Bb1XtJyx27Qhw7GiAhC46nyeNL7RNOPc9/30K8o+TvfBTzh0/S0RMG9Jv\nGUJixlUakhUEevXqxa6tZQT8Nf+/8lTA/z3vY+as2ucZtkT6yygXuffee8nJyaGyspKePXvy0ksv\nERMTY3esyzp2xKTSU/t25eVw9FDrHospTS8ipg3XfWec3TGajWCrJ0cO1e0DXkgInDhmktCliQNJ\nq9ahZ2du/PGtdseQBqiqMqkor1s9OV3Qekdr6FSOXOQvf/kLmzdvZseOHaSmpvLEE0/YHalGEZHg\ndNb+S+x2Q2QbnUUSsVLQ1ZOIum3n90N4hOqJiFya202dRmsAhIY1bZbmTFdE5CKvvPIKr732GlVV\nVZSVldGrVy+7I13S2bNnyc/Pp7jiKH7/WKDmO5g6nTBugu5yKmKlYKgngUCAY8eOkZ+fT8euBiFb\nB1BVWfOfx4gI6N1XjYiIXJphGFw/wsGaD2seieF0wo2TWu9nEzUicoG1a9fy3HPPsX79euLj43n9\n9deZO3eu3bGqlZWVkZ+fT15eXvVQj3umj2DjR27Wr/Hh91/6Ip/TBakZDnqk6CKgiFWaez05deoU\n+fn57Nu3j8jISFJSUvjVf/fgo/ehqvLy+4WHw3e/78bhUCMiIpf3yA/cbFhfQaXn8p893CHwwCOt\nc34IqBGRbygqKiIqKor27dtTWVnJSy+9ZHckqqqq+Pzzz8nPz+fMmTNcddVVXH/99XTq1Kl6wt6P\n/t8htt8WSsm5MAKBC3+h3W6IjTP468u68ZOIlZpjPSkuLiY/P5/8/HwCgQA9e/bklltuISoqqnqb\nRx/fypO/6oG3ysk3RzCHR8D1wx18+yH9+RSRmmUONRg+NocP3++J33dxsxEWDr/4rZvefVvvSVJV\nUrnAhAkTePXVV+nTpw+JiYlkZmayceNGy3P4/X4OHz5MXl4eR48epUuXLqSmptKtWzeczgsvYZqm\nSU7uBu6eeYplCxM4eXgk4MTlcmIYcPd9Lh75oZuYWJ29FLFSc6knHo+Hffv2kZ+fz7lz50hOTmbk\nyJF06HDxHayLi4sxHVlMuGMdG9cM5tTxVELcBqbpoH2cwUOPurjnfpeuhohIrXJychh0fRa5+5Zy\n9vjdlJcmEBrqwOc1yBjo4LGfubn2htY7LAvUiMg3uFwu3nzzTVuObZomJ06cIC8vj/3799O+fXt6\n9uzJ8OHDCQ29/NWMvLw8CgsLOX4il+E3Hich4RTXDb2dqKhIOncxCA3VBwYRO9hZT3w+HwcPHiQv\nL48TJ07QrVs3BgwYQGJiIg7H5c8+btq0Ca/XS3HpVm6f4SU25gjDrp9KeLiDhERDy6aKSJ34fD6y\nsrI4cuQIpmsN3/tRPF0T+9O391Bi4wxi26uWgBoRaQa+nHSen59PSEgIKSkp3HbbbbRp06bWff1+\nP5s3b6a4uJiSkhJ69+5N374pZAxovsuDikjT+Pqk8wMHDtChQwdSUlIYM2YMbnftY7BPnz7Nvn37\nOHr0KNHR0bRp04ZhN/SnZ0/9qRSR+tmxYwfl5eVs2rSJ/v37ExoayugxGURGtt5hWJei6iq2uNSk\n85tuuonY2Nh6vc+uXbsoLS3lwIEDdO/eHbfbTWZmZhOlFpHm6FKTzocMGUJEXdfi/cLGjRvxer0c\nPXqU/v37ExcXR3JychOlFpGWyuPxsG3bNvLz8/H5fPTp04e0tDQiIyPtjtbsqBERy9Rl0nl932/r\n1q2cPXuWqqoqOnToQGpqap2upIhIcKvLpPP6OHr0KEeOHOHQoUPEx8cTHh7OkCFDNBRLROotOzsb\nj8fDli1bGDRoEGFhYWRkZNgdq1lSIyJNqj6TzuursLAQgAMHDpCUlERoaCgDBgxojNgi0gzVZ9J5\nfZ05c4aqqioKCgoYNGgQCQkJJCYmNkJqEWltioqK2L17N6GhoSQnJzNgwIAa57q2ZmpE5Ip5PB5C\nQkKqJ4A2dNJ5fXXs2JHBgwdz6tQpYmNjycjIICysFd+eVKQFKC8vv2BIVUMnnddXeno6hw4dwuFw\n4HK5uOaaaxrtvUWkdRk5ciTz589n3LhxREZGkpqaanekZkuNiFwgUOjD968iAie8GO2cuEa3w9nj\n4g/3X344yM/P5/Dhw4wdO5Z27do1eNJ5g7IGAmzbto3p06cTExNTp8moImIdf74H3+pizBI/joQQ\n3BOiMKIu/rNTXl7Ovn37yMvL4+zZs9x7772cOXOmwZPOG+Ls2bMUFhYyc+ZMPB4P7dq1a5LjiEjL\nt3TpUvr06cOjjz5KaWkpLpc+bl+O/mUEANNrUvn7Y3gXFYIBVJrghKq/FeBIDSf8T90xYp0cPXqU\n/Px89u/fj9frpbKykoKCAl588UX69OnT4EnnDbF7926io6NJSEho8mOJSN0FCrxU/OAggRwP+Ezw\nA2EGlX84jvv2WEJ/0hlfwMf+/fvJz8/n6NGjmKZJSUkJBQUFPPvss6SkpDR40nlDbNy4kQEDBhAS\nEkJISEiTH09EWqbS0lJWrFhJdG+KAAAQQUlEQVTBf/zHf2AYBm3btrU7UrOmRkQwTZOKnxzCv64E\nqsyvXvADfhP/tnIKb9vFyvt2Uewvxefzcfr0aQoKCigrK6N9+/Z06tSJ22+/3bIxkF6vl61btzJx\n4kRLjicidWMW+Si/Jx/zrA98X3vBc762VL1zhuM5R1g9fCc+n4+KigpOnTpFQUEBpmkSHx9Pt27d\nmDZtmmWZjx8/TmFhIePGjbPsmCLSMr399tukpaXRvXt3u6MEBTUigj+rHP8nJdUfFL7J8IOjyCRu\nZQifddpNUVFR9ZWI2NhYHA4H0dHRlJaWWtaIbN++nS5dutC+fXtLjicidVP5winMQv+FTcjXGJUQ\nvS2EynYl7PDlUFFRQXx8PL169aoeDtW2bVsCgUCjzgGpyYYNG8jMzLziBTREpHU7ffo069ev57//\n+7/tjhI01IgIVf936rJNyJdcfidpOd35tO9uUlJScLvdREREkJycTEpKCnFxcRalhYqKCnbu3Mmt\nt95q2TFFpHamN4B3wVnw1lxPHD6DjN1JnBtbQXR0NA6Hg/bt25OSkkJycrKla+0fOHAAv99Pz549\nLTumiLRMb7zxBkOHDm2UlfxaCzUiQmBnBdT8uQGAENNNz9gedE5NpGfPnnTp0sWWNfa3bt1KSkqK\nxl2KNDPmCR8Eai8mDhxcVZ7AgW5l9OzZk5SUFGJiYixIeKFAIMDGjRu59tprdb8QEbkiBw8eZPv2\n7Tz11FN2RwkqakTk/OT0OnA6nNx+5+24O9q3RG5xcTF5eXnceeedtmUQkcuox0iqiMgI7rnnHlsb\ngNzcXMLDw+natattGUSkZZg/fz5jxozRinv1ZM0AXGnWnAMj6/ST4GjrxBVv7w15Nm/eTFpaGuHh\n4bbmEJGLGR3d4K5DMXFCyNB2tjYhPp+PrKws3S9ERK7Yrl27OHToEFOmTLE7StBRIyKE3B8HIbV8\nIAg1cM+Iw3DY98HhzJkzHDt2jLS0NNsyiMjlGS6DkHtia68nboOQ++KtCXUZu3btokOHDhrLLSJX\n7M033+Tmm2/WTZUbQI2I4OwXgfvmGAi7zIeHEANH1xBCpls3If1SvlznXzcuFGm+Qr4Tj5Hghsv9\nmoYbuG+PxdnLvj/YlZWVbNu2jcGDB9uWQURahg0bNlBSUsKNN95od5SgpEZEAAj9ZQIh346HcAdE\nOM5/iAg3IMTANbwtEfOSMcLt+3E5duwY586do2/fvjVut3fvXrp27crBgwcB+PWvf83dd99tRUQR\nAYwIJ5Gv9cQ5rO35KyNhxvl6Enm+toR8twOhP+lsa8bs7GySkpKIjo62NYeIBLdAIMCCBQuYNm2a\n7p7eQPpXEwAMwyD0kY6EfCce30fFmAU+iHTgGtEWR5z9VyA2btxIZmZmrfcV6NOnD7/73e+46667\n+M1vfsP8+fPZtGmTRSlFBMBo5yTimSQCBV58a0qgPIDRyY1rRFuMUHvPf5WVlbF3715uv/12W3OI\nSPBbvXo1LpeL4cOH2x0laKkRkQsYYQ7cNzWvs4T79+8nEAiQnJxcp+3vu+8+Vq1axdSpU1m7dq1W\nsBCxiaODm5DbY+2OcYGsrCz69u1r6b1KRKTl8fl8LFq0iG9/+9t2RwlqGpollnvyySeZPXt29eOT\nJ0/SsWNHysvLL9r2y3X+hwwZUucVdqqqqti1axfR0dGcPHmy0XKLSPNTn3pSVFTEgQMHyMjIsDKi\niDRD9957L5mZmaSlpTFt2jQKCwsvud2mTZvo16/fBc9lZGTwhz/8gfj4eAYOHGhF3BZLjYhY7sEH\nH2TBggWUlpYCMHfuXKZPn05ERMRF2+bk5BAZGUliYmKd3//HP/4xgwYNYuXKlTz00EMcOXKk0bKL\nSPNSn3qyceNGMjIyCA21dxlyEbHfX/7yFzZv3syOHTtITU3liSeeuOR2gwcPpk2bNnz88ccArF27\nFjh/A8N77rnHsrwtlRoRsVxMTAyTJ09m3rx5+Hw+nn/+eR5++OGLtmvIOv+LFi3io48+4s9//jOp\nqan86le/4p577sHn8zXmtyAizURd60lBQQGnTp0iNTXVhpQi0ty88sorDBo0iLS0NF5//XWys7Mv\nu+2cOXP461//CsD//u//MnjwYFJSUkhJSbEqboulRkRsMWfOHJ577jkWL15M37596dWr10Xb7Ny5\nk06dOhEfX/f7DUydOpVt27ZVr+X9wAMPsHbtWq1mIdKC1aWebNiwgUGDBqkWiAhr167lueee4/33\n32fHjh389re/xePxXHb7O+64g88++4ytW7fy4Ycf4vf7dTWkkagREVv069eP9u3b89hjjzFr1qyL\nXq+srGT79u1a519EalVbPTl06BAVFRWXbFBEpPUpKioiKiqK9u3bU1lZyUsvvVTj9m63m+985ztM\nnjyZ9PR0hg4dSkJCgkVpWzY1ImKbmTNn4nA4mDRp0kWvbd26lauuuoqoqCgbkolIsLlcPTFNs3rB\ni9qW/xaR1mHChAkkJyfTp08fJkyYUKcJ5zNnzuTo0aPExsZyxx13WJCyddA1arHN6tWrmT17Nk6n\n84LnS0tLycnJ0S+6iNTZ5epJfn4+brebpKQke4KJSLPjcrl4880367x9IBBg9erV9O7dm8mTJxMb\n27yWJQ9makTEcseOHWPUqFF06tSJZ5555qLXv1zn/1Kr3oiIfF1N9cTv97N582ZGjhxpTzgRCXqB\nQIABAwZw8uRJhg0bxq233mp3pBZFjYhYLiEhgZycnEu+VlhYyMGDB7n77rstTiUiwaimerJnzx5i\nYmLo3LmzxalEJNgsW7aMxx9//KLnH3roIWbNmsXSpUur682AAQNsSNgyqRGRZmXTpk3079+fkJCQ\nBu1vBkxO7PZy5nMfmCaxSW46pblxOOp2M0QRaRmqqqrYunXrJeegiYh808SJE5k4ceIFz3m9Xt54\n4w1ycnIoLS2lb9++lJWV2ZSwZVIjIs3GyZMnOX36NGPGjGnY/nuq+HRuCT6Pia/y/HOu0AqcIQbX\nPNCWhPSGNTciEny2b99OYmKixnKLSIPt2LGDiooKsrKyqm+GqjupNy4tISLNxoYNG8jMzLxosmld\nnNxbxZq/FOM591UTAuCrhMoSk0/+Wsyx7VWNmFZEmquKigp27dpFZmam3VFEJEh5PB62bdtGbm4u\nfr+f3r17k5aWpvmrjUyNiDQLhw4dorKyskF3KTVNkw0vlOKvoc/wV8GGF0sIBMwrSCkiwWDLli30\n6tWLtm3b2h1FRILUli1b8Hg8bN26lczMTCIiIsjIyLA7VoujoVliKTMQIPfjnXzy0kpO7DmCaZrE\nJ3fGeXVbRs+YgGHUfy7HqVwfVWWBWrfzV5mc2OElIUNDtERagsoyD9sWfcZn81ZTUlCEw+Wk+5AU\nShNNZjz2HbvjiUgQKTxymo2vfcT2f26ksqwS0wWlcX6i3G1ISkpiwIABDZ6/KpenRkQs4/f6eesH\nz3NgYy7eiq8uX5zYcxjHPicffe4hce5s3GH1+0U/u9+L31f7dr5KOHtAjYhIS3DuRCEvf+uPVJwr\nx+s5X0/8Xj/5a3bhdDvZEPUhIx6eWMu7iIhA/rrdvP3DF/B7/QR8/vNP+iDsSIAMV1ccZ/xcffXV\n9oZsoTQ0Syyz8ql3ObAh54Im5EuBKj/Hdx/i7Z+8SFFRUY3vU1VVRUFBAbm5uWzcuJHcvFzMQO1X\nRDCABlxxEZHmxQwEeOWBZyg5VVzdhHz1Ivir/Kx/6QN2vZ9lT0ARCRpnDhbw9g9ewFtR9VUT8gUn\nDgwfFLybS+mpYpsStmy6IiKWqCytYMs76/FVei+7ja/SR/6a3Wxas4Gxt9xISUkJ586do6io6IIv\nr9dLdHR09Vf39BhydzlqnCMC4AqB9j30Iy8S7PI/2UPZ6eIaT0B4PVWsfnYpV48f2KAhnyLSOnz2\nf6vweWseVmH6A2x6/WPG/nCqRalaD30qE0vkrN6Bw1n7BTgzYPLRq8s5fPooYWFhREdHExUVRWxs\nLD169CA6OprIyMgL9zFNDi0rpOxUzVdFXGEGna52X9H3ISL22/L2OqrKK2vdrqTgHKf3nyS+RycL\nUolIMNq+dBOmv+bPD36vn+yFn6oRaQJqRMQSZWdL8NdyxgHAMCEqpA0zZszA5arbj6dhGFz7YFtW\nP3XusldFnCFw7XfbYujGhiJBr6TgXJ22c7idlJ0pUSMiIpcU8AcuOVz8UjwlFU2cpnXSHBGxRHhU\nJA5XHe4P4jSIT+xY76EUcT3djPr3KCLjHDhDweE8/+UKhYhYB8MfbUfHvpqkLtISRLav27K8AZ+f\niOjI2jcUkVbJ4XTgCq3bSImQyLAmTtM66YqIWKL3qDTe+683at3O6XQybc49DbqpYVxPNzc/EcPp\nfB9nPj9/9SWmu5MOvd0aIy7Sggy49ToOZuVTVVbz8KyI6DbE9+xsUSoRCUap4wey/b2ah2c53E7S\nbxlsYarWQ1dExBLhUZGkTRpc45kHZ4iLHtf2ITohtsHHMQyD+BQ3fcaH02d8OB37hKgJEWlheo3o\nR1jb8BqHWrrDQxjxSMPuTSQirce13x6Ly13zyU+ny8k1946yKFHrokZELDPxF3fSJa077vCLh0i5\nw0KI69GJW5+43/pgIhJUHC4nM158lPCoSFwhF1/Yd4eFMPC268iYMtSGdCISTDr07Mzk396HK8yN\n8Y1FdQynA3dYCLc/9QAxXeNsStiyaWiWWMYV4ua+57/Pzn9l8clLKzm17zgAMYlxXPftsWRMvqbO\nYzVFpHWL7RbPI0t+weY31rLx9Y8pLyrFMAy6Z6Zw/QPjSL6ur90RRSRIpI4fSHxyZ9a/vJLdy7fg\nq/LhCnWTNmkw1/7bGOKu6mh3xBbLME2zzhtnZmaamzdvbsI40pqYgQCmSZ2W9ZVLMwwjyzTNTLtz\n1JdqiTS2gM+P4XRoKNYVUD0ROS/g89dtgR25rLrWE10REdsYDgf6yCAijUEfGkSksaieWEenokVE\nRERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERE\nxHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJq\nRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERE\nRERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERE\nxHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJq\nRERERERExHKGaZp139gwTgEHmy6OiNRTd9M04+0OUV+qJSLNkuqJiDSWOtWTejUiIiIiIiIijUFD\ns0RERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERERERExHJqRERE\nRERExHJqRERERERExHJqRERERERExHL/H5KpFe/VvrdrAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f78ee28d1d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plot_rule(rule)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'a': 'c', 'x': 'f', 'y': 'd', 'z': 'a_b'}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "instances[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (x:node { id : 'f'}), (y:node { id : 'd'}), (z:node { id : 'a_b'}), (a:node { id : 'c'}) , (x)-[x_y:edge]->(y), (y)-[y_z:edge]->(z), (z)-[z_z:edge]->(z), (z)-[z_a:edge]->(a)WITH [] as ignoredNodes, x, a, y, z OPTIONAL MATCH (y)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(y) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, x, a, y, z OPTIONAL MATCH (same_id_node:node { id : 'y1'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, x, a, y, z WITH same_id_node, same_id_node_new_count, 'y1' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as y1_clone_id, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, x, a, y, z MERGE (y1:node {id : y1_clone_id }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (y1)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(y1)) WITH y1_clone_id, a, y, x, z WITH ['a_b'] as ignoredNodes, y1_clone_id, a, y, x, z OPTIONAL MATCH (y)-[:edge]->(succ) OPTIONAL MATCH (pred)-[:edge]->(y) WITH collect(succ) as listSucc, collect(pred) as listPred, ignoredNodes as ig, y1_clone_id, a, y, x, z OPTIONAL MATCH (same_id_node:node { id : 'y2'}) WITH same_id_node, listSucc, listPred, ig,  CASE WHEN same_id_node IS NOT NULL THEN (coalesce(same_id_node.count, 0) + 1) ELSE 0 END AS same_id_node_new_count, y1_clone_id, a, y, x, z WITH same_id_node, same_id_node_new_count, 'y2' + CASE WHEN same_id_node_new_count <> 0 THEN toString(same_id_node_new_count) ELSE '' END as y2_clone_id, filter(varNode in listSucc WHERE NOT (varNode.id in ig)) AS filtSucc, filter(varNode in listPred WHERE NOT (varNode.id in ig)) AS filtPred, y1_clone_id, a, y, x, z MERGE (y2:node {id : y2_clone_id }) SET same_id_node.count = same_id_node_new_count + 1 FOREACH (succ in filtSucc | MERGE (y2)-[:edge]->(succ)) FOREACH (pred in filtPred | MERGE (pred)-[:edge]->(y2)) WITH y2_clone_id, y1_clone_id, a, y, x, z DETACH DELETE x WITH y2_clone_id, y1_clone_id, a, y, z OPTIONAL MATCH (a)-[:edge]->(suc_a) OPTIONAL MATCH (pred_a)-[:edge]->(a) OPTIONAL MATCH (y)-[:edge]->(suc_y) OPTIONAL MATCH (pred_y)-[:edge]->(y)  WITH COLLECT(suc_a) as sucs_a, COLLECT(pred_a) as preds_a, COLLECT(suc_y) as sucs_y, COLLECT(pred_y) as preds_y, y2_clone_id, y1_clone_id, a, y, z  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'c_d' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , y2_clone_id, preds_a, preds_y, y1_clone_id, sucs_y, a, y, sucs_a, z UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['c_d' + same_id_node.count] ELSE ['c_d'] END AS a_y_id CREATE (a_y:node { id : a_y_id }) FOREACH(s IN sucs_a | CREATE UNIQUE (a_y)-[:edge]->(s))  FOREACH(s IN sucs_y | CREATE UNIQUE (a_y)-[:edge]->(s)) FOREACH(p IN preds_a | CREATE UNIQUE (p)-[:edge]->(a_y))  FOREACH(p IN preds_y | CREATE UNIQUE (p)-[:edge]->(a_y)) FOREACH(n IN sucs_a + preds_a + sucs_y + preds_y | FOREACH(dummy_var IN CASE WHEN n IN [a, y] THEN ['dummy'] ELSE [] END | CREATE UNIQUE (a_y)-[:edge]->(a_y)) ) DETACH DELETE a, y WITH a_y, y2_clone_id, preds_a, preds_y, y1_clone_id, sucs_y, a_y_id, sucs_a, z  OPTIONAL MATCH (same_id_node:node) WHERE same_id_node.id = 'new_node' FOREACH(new_count IN CASE WHEN same_id_node IS NOT NULL THEN [coalesce(same_id_node.count, 0) + 1] ELSE [] END | SET same_id_node.count=coalesce(same_id_node.count, 0) + 1 ) WITH same_id_node , a_y, y2_clone_id, preds_a, preds_y, y1_clone_id, sucs_y, a_y_id, sucs_a, z UNWIND CASE WHEN same_id_node IS NOT NULL THEN ['new_node' + same_id_node.count] ELSE ['new_node'] END AS new_node_id CREATE (new_node:node { id : new_node_id }) CREATE UNIQUE (new_node)-[:edge]->(z) RETURN a_y, y2_clone_id, preds_a, new_node, preds_y, y1_clone_id, sucs_y, new_node_id, a_y_id, sucs_a, z \n",
      "\n",
      "\n",
      "Rewriting rule to commands: \n",
      "\n",
      "CLONE y AS y1.\n",
      "CLONE y AS y2.\n",
      "DELETE_NODE x.\n",
      "DELETE_EDGE y2 z.\n",
      "MERGE [a, y] AS 'a_y'.\n",
      "ADD_NODE new_node {}.\n",
      "ADD_EDGE new_node z {}.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "rhs_g = g.rewrite(rule, instances[0])\n",
    "print(\"\\n\\nRewriting rule to commands: \\n\")\n",
    "print(rule.to_commands())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'a_y': 'c_d', 'new_node': 'new_node', 'z': 'a_b'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rhs_g"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('x', 'y'), ('y', 'z'), ('z', 'z'), ('z', 'a')]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pattern.edges()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
